function HVConverter(w) {
    var hvMAP = [{
            h: "婀",
            v: "A"
        },
        {
            h: "阿",
            v: "A/Á"
        },
        {
            h: "哀",
            v: "Ai"
        },
        {
            h: "埃",
            v: "Ai"
        },
        {
            h: "欸",
            v: "Ai/Ái"
        },
        {
            h: "挨",
            v: "Ai/Ải"
        },
        {
            h: "諳",
            v: "Am"
        },
        {
            h: "庵",
            v: "Am"
        },
        {
            h: "安",
            v: "An"
        },
        {
            h: "英",
            v: "Anh"
        },
        {
            h: "桜",
            v: "Anh"
        },
        {
            h: "瑛",
            v: "Anh"
        },
        {
            h: "櫻",
            v: "Anh"
        },
        {
            h: "罌",
            v: "Anh"
        },
        {
            h: "瓔",
            v: "Anh"
        },
        {
            h: "霙",
            v: "Anh"
        },
        {
            h: "嚶",
            v: "Anh"
        },
        {
            h: "嬰",
            v: "Anh"
        },
        {
            h: "凹",
            v: "Ao"
        },
        {
            h: "亜",
            v: "Á"
        },
        {
            h: "痾",
            v: "Á"
        },
        {
            h: "亞",
            v: "Á"
        },
        {
            h: "唖",
            v: "Á"
        },
        {
            h: "悪",
            v: "Ác"
        },
        {
            h: "握",
            v: "Ác"
        },
        {
            h: "渥",
            v: "Ác"
        },
        {
            h: "堊",
            v: "Ác"
        },
        {
            h: "惡",
            v: "Ác"
        },
        {
            h: "齷",
            v: "Ác"
        },
        {
            h: "厄",
            v: "Ách"
        },
        {
            h: "扼",
            v: "Ách"
        },
        {
            h: "愛",
            v: "Ái"
        },
        {
            h: "曖",
            v: "Ái"
        },
        {
            h: "藹",
            v: "Ái"
        },
        {
            h: "暗",
            v: "Ám"
        },
        {
            h: "闇",
            v: "Ám"
        },
        {
            h: "案",
            v: "Án"
        },
        {
            h: "按",
            v: "Án"
        },
        {
            h: "暎",
            v: "Ánh"
        },
        {
            h: "奥",
            v: "Áo"
        },
        {
            h: "懊",
            v: "Áo"
        },
        {
            h: "墺",
            v: "Áo"
        },
        {
            h: "奧",
            v: "Áo"
        },
        {
            h: "圧",
            v: "Áp"
        },
        {
            h: "押",
            v: "Áp"
        },
        {
            h: "鴨",
            v: "Áp"
        },
        {
            h: "壓",
            v: "Áp"
        },
        {
            h: "靄",
            v: "Ải"
        },
        {
            h: "黯",
            v: "Ảm"
        },
        {
            h: "影",
            v: "Ảnh"
        },
        {
            h: "映",
            v: "Ảnh/Ánh"
        },
        {
            h: "幻",
            v: "Ảo"
        },
        {
            h: "陰",
            v: "Âm"
        },
        {
            h: "音",
            v: "Âm"
        },
        {
            h: "恩",
            v: "Ân"
        },
        {
            h: "慇",
            v: "Ân"
        },
        {
            h: "殷",
            v: "Ân"
        },
        {
            h: "欧",
            v: "Âu"
        },
        {
            h: "謳",
            v: "Âu"
        },
        {
            h: "歐",
            v: "Âu/Ẩu"
        },
        {
            h: "印",
            v: "Ấn"
        },
        {
            h: "悒",
            v: "Ấp"
        },
        {
            h: "揖",
            v: "Ấp"
        },
        {
            h: "邑",
            v: "Ấp"
        },
        {
            h: "乙",
            v: "Ất"
        },
        {
            h: "幼",
            v: "Ấu"
        },
        {
            h: "拗",
            v: "Ấu"
        },
        {
            h: "飲",
            v: "Ẩm"
        },
        {
            h: "蔭",
            v: "Ẩm"
        },
        {
            h: "隠",
            v: "Ẩn"
        },
        {
            h: "殴",
            v: "Ẩu"
        },
        {
            h: "毆",
            v: "Ẩu"
        },
        {
            h: "嘔",
            v: "Ẩu"
        },
        {
            h: "媼",
            v: "Ẩu"
        },
        {
            h: "嫗",
            v: "Ẩu"
        },
        {
            h: "波",
            v: "Ba"
        },
        {
            h: "巴",
            v: "Ba"
        },
        {
            h: "班",
            v: "Ban"
        },
        {
            h: "頒",
            v: "Ban"
        },
        {
            h: "袢",
            v: "Ban"
        },
        {
            h: "斑",
            v: "Ban"
        },
        {
            h: "瘢",
            v: "Ban"
        },
        {
            h: "般",
            v: "Ban/Bàn"
        },
        {
            h: "搬",
            v: "Ban/Bàn"
        },
        {
            h: "邦",
            v: "Bang"
        },
        {
            h: "幇",
            v: "Bang"
        },
        {
            h: "褒",
            v: "Bao"
        },
        {
            h: "包",
            v: "Bao"
        },
        {
            h: "鞄",
            v: "Bao"
        },
        {
            h: "襃",
            v: "Bao"
        },
        {
            h: "勹",
            v: "Bao"
        },
        {
            h: "覇",
            v: "Bá"
        },
        {
            h: "伯",
            v: "Bá"
        },
        {
            h: "播",
            v: "Bá"
        },
        {
            h: "叭",
            v: "Bá/Bát"
        },
        {
            h: "博",
            v: "Bác"
        },
        {
            h: "搏",
            v: "Bác"
        },
        {
            h: "駁",
            v: "Bác"
        },
        {
            h: "剥",
            v: "Bác"
        },
        {
            h: "迫",
            v: "Bách"
        },
        {
            h: "百",
            v: "Bách"
        },
        {
            h: "栢",
            v: "Bách"
        },
        {
            h: "佰",
            v: "Bách"
        },
        {
            h: "岶",
            v: "Bách"
        },
        {
            h: "柏",
            v: "Bách/Bá"
        },
        {
            h: "拝",
            v: "Bái"
        },
        {
            h: "排",
            v: "Bái"
        },
        {
            h: "拜",
            v: "Bái"
        },
        {
            h: "旆",
            v: "Bái"
        },
        {
            h: "半",
            v: "Bán"
        },
        {
            h: "絆",
            v: "Bán"
        },
        {
            h: "謗",
            v: "Báng"
        },
        {
            h: "報",
            v: "Báo"
        },
        {
            h: "豹",
            v: "Báo"
        },
        {
            h: "鉢",
            v: "Bát"
        },
        {
            h: "八",
            v: "Bát"
        },
        {
            h: "捌",
            v: "Bát"
        },
        {
            h: "撥",
            v: "Bát"
        },
        {
            h: "癶",
            v: "Bát"
        },
        {
            h: "婆",
            v: "Bà"
        },
        {
            h: "杷",
            v: "Bà"
        },
        {
            h: "琶",
            v: "Bà"
        },
        {
            h: "俳",
            v: "Bài"
        },
        {
            h: "擺",
            v: "Bài"
        },
        {
            h: "牌",
            v: "Bài"
        },
        {
            h: "盤",
            v: "Bàn"
        },
        {
            h: "槃",
            v: "Bàn"
        },
        {
            h: "傍",
            v: "Bàng"
        },
        {
            h: "旁",
            v: "Bàng"
        },
        {
            h: "彷",
            v: "Bàng/Phảng"
        },
        {
            h: "膨",
            v: "Bành"
        },
        {
            h: "彭",
            v: "Bành"
        },
        {
            h: "胞",
            v: "Bào"
        },
        {
            h: "疱",
            v: "Bào"
        },
        {
            h: "咆",
            v: "Bào"
        },
        {
            h: "垉",
            v: "Bào"
        },
        {
            h: "庖",
            v: "Bào"
        },
        {
            h: "把",
            v: "Bả"
        },
        {
            h: "板",
            v: "Bản/Bảng"
        },
        {
            h: "本",
            v: "Bản/Bổn"
        },
        {
            h: "榜",
            v: "Bảng"
        },
        {
            h: "保",
            v: "Bảo"
        },
        {
            h: "宝",
            v: "Bảo"
        },
        {
            h: "褓",
            v: "Bảo"
        },
        {
            h: "堡",
            v: "Bảo"
        },
        {
            h: "寳",
            v: "Bảo"
        },
        {
            h: "寶",
            v: "Bảo"
        },
        {
            h: "罷",
            v: "Bãi"
        },
        {
            h: "飽",
            v: "Bão"
        },
        {
            h: "抱",
            v: "Bão"
        },
        {
            h: "舶",
            v: "Bạc"
        },
        {
            h: "薄",
            v: "Bạc"
        },
        {
            h: "箔",
            v: "Bạc"
        },
        {
            h: "亳",
            v: "Bạc"
        },
        {
            h: "泊",
            v: "Bạc/Phách"
        },
        {
            h: "白",
            v: "Bạch"
        },
        {
            h: "敗",
            v: "Bại"
        },
        {
            h: "憊",
            v: "Bại"
        },
        {
            h: "畔",
            v: "Bạn"
        },
        {
            h: "伴",
            v: "Bạn"
        },
        {
            h: "拌",
            v: "Bạn"
        },
        {
            h: "蚌",
            v: "Bạng"
        },
        {
            h: "暴",
            v: "Bạo/Bộc"
        },
        {
            h: "抜",
            v: "Bạt"
        },
        {
            h: "拔",
            v: "Bạt"
        },
        {
            h: "跋",
            v: "Bạt"
        },
        {
            h: "彬",
            v: "Bân"
        },
        {
            h: "斌",
            v: "Bân"
        },
        {
            h: "不",
            v: "Bất"
        },
        {
            h: "貧",
            v: "Bần"
        },
        {
            h: "稟",
            v: "Bẩm"
        },
        {
            h: "禀",
            v: "Bẩm"
        },
        {
            h: "弼",
            v: "Bật"
        },
        {
            h: "氷",
            v: "Băng"
        },
        {
            h: "崩",
            v: "Băng"
        },
        {
            h: "冫",
            v: "Băng"
        },
        {
            h: "冰",
            v: "Băng"
        },
        {
            h: "北",
            v: "Bắc"
        },
        {
            h: "棚",
            v: "Bằng"
        },
        {
            h: "朋",
            v: "Bằng"
        },
        {
            h: "憑",
            v: "Bằng"
        },
        {
            h: "硼",
            v: "Bằng"
        },
        {
            h: "凭",
            v: "Bằng"
        },
        {
            h: "堋",
            v: "Bằng"
        },
        {
            h: "弸",
            v: "Bằng"
        },
        {
            h: "匐",
            v: "Bặc"
        },
        {
            h: "閉",
            v: "Bế"
        },
        {
            h: "嬖",
            v: "Bế"
        },
        {
            h: "陛",
            v: "Bệ"
        },
        {
            h: "病",
            v: "Bệnh"
        },
        {
            h: "碑",
            v: "Bi"
        },
        {
            h: "悲",
            v: "Bi"
        },
        {
            h: "編",
            v: "Biên"
        },
        {
            h: "辺",
            v: "Biên"
        },
        {
            h: "塀",
            v: "Biên"
        },
        {
            h: "邊",
            v: "Biên"
        },
        {
            h: "邉",
            v: "Biên"
        },
        {
            h: "蝙",
            v: "Biên/Biển"
        },
        {
            h: "貶",
            v: "Biếm"
        },
        {
            h: "変",
            v: "Biến"
        },
        {
            h: "遍",
            v: "Biến"
        },
        {
            h: "變",
            v: "Biến"
        },
        {
            h: "俵",
            v: "Biếu"
        },
        {
            h: "扁",
            v: "Biển"
        },
        {
            h: "表",
            v: "Biểu"
        },
        {
            h: "殍",
            v: "Biễu"
        },
        {
            h: "抃",
            v: "Biện"
        },
        {
            h: "瓣",
            v: "Biện"
        },
        {
            h: "卞",
            v: "Biện"
        },
        {
            h: "辮",
            v: "Biện"
        },
        {
            h: "辯",
            v: "Biện"
        },
        {
            h: "弁",
            v: "Biện/Biền"
        },
        {
            h: "別",
            v: "Biệt"
        },
        {
            h: "兵",
            v: "Binh"
        },
        {
            h: "疲",
            v: "Bí"
        },
        {
            h: "秘",
            v: "Bí"
        },
        {
            h: "轡",
            v: "Bí"
        },
        {
            h: "壁",
            v: "Bích"
        },
        {
            h: "碧",
            v: "Bích"
        },
        {
            h: "辟",
            v: "Bích/Tịch"
        },
        {
            h: "丙",
            v: "Bính"
        },
        {
            h: "柄",
            v: "Bính"
        },
        {
            h: "餅",
            v: "Bính"
        },
        {
            h: "皮",
            v: "Bì"
        },
        {
            h: "瓶",
            v: "Bình"
        },
        {
            h: "平",
            v: "Bình"
        },
        {
            h: "評",
            v: "Bình"
        },
        {
            h: "坪",
            v: "Bình"
        },
        {
            h: "屏",
            v: "Bình/Bính"
        },
        {
            h: "彼",
            v: "Bỉ"
        },
        {
            h: "鄙",
            v: "Bỉ"
        },
        {
            h: "痞",
            v: "Bĩ/Phủ"
        },
        {
            h: "被",
            v: "Bị"
        },
        {
            h: "備",
            v: "Bị"
        },
        {
            h: "哺",
            v: "Bô"
        },
        {
            h: "杯",
            v: "Bôi"
        },
        {
            h: "盃",
            v: "Bôi"
        },
        {
            h: "奔",
            v: "Bôn"
        },
        {
            h: "布",
            v: "Bố"
        },
        {
            h: "怖",
            v: "Bố"
        },
        {
            h: "卜",
            v: "Bốc"
        },
        {
            h: "背",
            v: "Bối"
        },
        {
            h: "貝",
            v: "Bối"
        },
        {
            h: "輩",
            v: "Bối"
        },
        {
            h: "蒲",
            v: "Bồ"
        },
        {
            h: "匍",
            v: "Bồ"
        },
        {
            h: "賠",
            v: "Bồi"
        },
        {
            h: "陪",
            v: "Bồi"
        },
        {
            h: "培",
            v: "Bồi"
        },
        {
            h: "徘",
            v: "Bồi"
        },
        {
            h: "盆",
            v: "Bồn"
        },
        {
            h: "補",
            v: "Bổ"
        },
        {
            h: "畚",
            v: "Bổn"
        },
        {
            h: "夲",
            v: "Bổn"
        },
        {
            h: "俸",
            v: "Bổng"
        },
        {
            h: "棒",
            v: "Bổng"
        },
        {
            h: "捧",
            v: "Bổng"
        },
        {
            h: "簿",
            v: "Bộ"
        },
        {
            h: "部",
            v: "Bộ"
        },
        {
            h: "歩",
            v: "Bộ"
        },
        {
            h: "捗",
            v: "Bộ"
        },
        {
            h: "捕",
            v: "Bộ/Bổ"
        },
        {
            h: "爆",
            v: "Bộc"
        },
        {
            h: "僕",
            v: "Bộc"
        },
        {
            h: "曝",
            v: "Bộc"
        },
        {
            h: "倍",
            v: "Bội"
        },
        {
            h: "悖",
            v: "Bội"
        },
        {
            h: "佩",
            v: "Bội"
        },
        {
            h: "琲",
            v: "Bội"
        },
        {
            h: "唄",
            v: "Bội"
        },
        {
            h: "勃",
            v: "Bột"
        },
        {
            h: "孛",
            v: "Bột"
        },
        {
            h: "筆",
            v: "Bút"
        },
        {
            h: "裴",
            v: "Bùi/Bồi"
        },
        {
            h: "郵",
            v: "Bưu"
        },
        {
            h: "彪",
            v: "Bưu"
        },
        {
            h: "蝠",
            v: "Bức"
        },
        {
            h: "歌",
            v: "Ca"
        },
        {
            h: "哥",
            v: "Ca"
        },
        {
            h: "彁",
            v: "Ca"
        },
        {
            h: "該",
            v: "Cai"
        },
        {
            h: "垓",
            v: "Cai"
        },
        {
            h: "甘",
            v: "Cam"
        },
        {
            h: "柑",
            v: "Cam"
        },
        {
            h: "疳",
            v: "Cam"
        },
        {
            h: "淦",
            v: "Cam"
        },
        {
            h: "坩",
            v: "Cam"
        },
        {
            h: "肝",
            v: "Can"
        },
        {
            h: "干",
            v: "Can"
        },
        {
            h: "栞",
            v: "Can"
        },
        {
            h: "杆",
            v: "Can/Cán"
        },
        {
            h: "乾",
            v: "Can/Càn/Kiền"
        },
        {
            h: "亢",
            v: "Cang"
        },
        {
            h: "耕",
            v: "Canh"
        },
        {
            h: "庚",
            v: "Canh"
        },
        {
            h: "甦",
            v: "Canh"
        },
        {
            h: "更",
            v: "Canh/Cánh"
        },
        {
            h: "高",
            v: "Cao"
        },
        {
            h: "槹",
            v: "Cao"
        },
        {
            h: "嚆",
            v: "Cao"
        },
        {
            h: "塙",
            v: "Cao"
        },
        {
            h: "膏",
            v: "Cao/Cáo"
        },
        {
            h: "箇",
            v: "Cá"
        },
        {
            h: "個",
            v: "Cá"
        },
        {
            h: "个",
            v: "Cá"
        },
        {
            h: "閣",
            v: "Các"
        },
        {
            h: "各",
            v: "Các"
        },
        {
            h: "擱",
            v: "Các"
        },
        {
            h: "咯",
            v: "Các"
        },
        {
            h: "隔",
            v: "Cách"
        },
        {
            h: "革",
            v: "Cách"
        },
        {
            h: "格",
            v: "Cách"
        },
        {
            h: "挌",
            v: "Cách"
        },
        {
            h: "蓋",
            v: "Cái"
        },
        {
            h: "丐",
            v: "Cái"
        },
        {
            h: "紺",
            v: "Cám"
        },
        {
            h: "幹",
            v: "Cán"
        },
        {
            h: "桿",
            v: "Cán"
        },
        {
            h: "哽",
            v: "Cánh/Ngạnh"
        },
        {
            h: "告",
            v: "Cáo"
        },
        {
            h: "蛤",
            v: "Cáp"
        },
        {
            h: "哈",
            v: "Cáp"
        },
        {
            h: "割",
            v: "Cát"
        },
        {
            h: "吉",
            v: "Cát"
        },
        {
            h: "葛",
            v: "Cát"
        },
        {
            h: "佶",
            v: "Cát"
        },
        {
            h: "改",
            v: "Cải"
        },
        {
            h: "感",
            v: "Cảm"
        },
        {
            h: "敢",
            v: "Cảm"
        },
        {
            h: "撼",
            v: "Cảm"
        },
        {
            h: "橄",
            v: "Cảm"
        },
        {
            h: "扞",
            v: "Cản"
        },
        {
            h: "捍",
            v: "Cản/Hãn"
        },
        {
            h: "港",
            v: "Cảng"
        },
        {
            h: "警",
            v: "Cảnh"
        },
        {
            h: "境",
            v: "Cảnh"
        },
        {
            h: "景",
            v: "Cảnh"
        },
        {
            h: "憬",
            v: "Cảnh"
        },
        {
            h: "脛",
            v: "Cảnh"
        },
        {
            h: "稿",
            v: "Cảo"
        },
        {
            h: "杲",
            v: "Cảo"
        },
        {
            h: "槁",
            v: "Cảo"
        },
        {
            h: "藁",
            v: "Cảo"
        },
        {
            h: "競",
            v: "Cạnh"
        },
        {
            h: "筋",
            v: "Cân"
        },
        {
            h: "斤",
            v: "Cân"
        },
        {
            h: "巾",
            v: "Cân"
        },
        {
            h: "溝",
            v: "Câu"
        },
        {
            h: "駒",
            v: "Câu"
        },
        {
            h: "佝",
            v: "Câu"
        },
        {
            h: "倶",
            v: "Câu"
        },
        {
            h: "勾",
            v: "Câu"
        },
        {
            h: "拘",
            v: "Câu/Cù"
        },
        {
            h: "禁",
            v: "Cấm"
        },
        {
            h: "噤",
            v: "Cấm"
        },
        {
            h: "級",
            v: "Cấp"
        },
        {
            h: "給",
            v: "Cấp"
        },
        {
            h: "急",
            v: "Cấp"
        },
        {
            h: "汲",
            v: "Cấp"
        },
        {
            h: "叶",
            v: "Cấp"
        },
        {
            h: "購",
            v: "Cấu"
        },
        {
            h: "構",
            v: "Cấu"
        },
        {
            h: "搆",
            v: "Cấu"
        },
        {
            h: "冓",
            v: "Cấu"
        },
        {
            h: "垢",
            v: "Cấu"
        },
        {
            h: "媾",
            v: "Cấu"
        },
        {
            h: "琴",
            v: "Cầm"
        },
        {
            h: "擒",
            v: "Cầm"
        },
        {
            h: "檎",
            v: "Cầm"
        },
        {
            h: "禽",
            v: "Cầm"
        },
        {
            h: "勤",
            v: "Cần"
        },
        {
            h: "懃",
            v: "Cần"
        },
        {
            h: "球",
            v: "Cầu"
        },
        {
            h: "求",
            v: "Cầu"
        },
        {
            h: "毬",
            v: "Cầu"
        },
        {
            h: "錦",
            v: "Cẩm"
        },
        {
            h: "謹",
            v: "Cẩn"
        },
        {
            h: "僅",
            v: "Cẩn"
        },
        {
            h: "近",
            v: "Cận"
        },
        {
            h: "饉",
            v: "Cận"
        },
        {
            h: "槿",
            v: "Cận"
        },
        {
            h: "及",
            v: "Cập"
        },
        {
            h: "詰",
            v: "Cật"
        },
        {
            h: "劼",
            v: "Cật"
        },
        {
            h: "根",
            v: "Căn"
        },
        {
            h: "兢",
            v: "Căng"
        },
        {
            h: "橙",
            v: "Chanh"
        },
        {
            h: "炙",
            v: "Chá/Chích"
        },
        {
            h: "喙",
            v: "Chác/Dế"
        },
        {
            h: "針",
            v: "Châm"
        },
        {
            h: "斟",
            v: "Châm"
        },
        {
            h: "真",
            v: "Chân"
        },
        {
            h: "眞",
            v: "Chân"
        },
        {
            h: "嗔",
            v: "Chân"
        },
        {
            h: "珠",
            v: "Châu"
        },
        {
            h: "州",
            v: "Châu"
        },
        {
            h: "洲",
            v: "Châu"
        },
        {
            h: "株",
            v: "Châu/Chu"
        },
        {
            h: "震",
            v: "Chấn"
        },
        {
            h: "振",
            v: "Chấn"
        },
        {
            h: "汁",
            v: "Chấp"
        },
        {
            h: "執",
            v: "Chấp"
        },
        {
            h: "質",
            v: "Chất"
        },
        {
            h: "枕",
            v: "Chẩm"
        },
        {
            h: "嶄",
            v: "Chẩm"
        },
        {
            h: "診",
            v: "Chẩn"
        },
        {
            h: "賑",
            v: "Chẩn"
        },
        {
            h: "疹",
            v: "Chẩn"
        },
        {
            h: "製",
            v: "Chế"
        },
        {
            h: "制",
            v: "Chế"
        },
        {
            h: "肢",
            v: "Chi"
        },
        {
            h: "脂",
            v: "Chi"
        },
        {
            h: "芝",
            v: "Chi"
        },
        {
            h: "支",
            v: "Chi"
        },
        {
            h: "枝",
            v: "Chi"
        },
        {
            h: "之",
            v: "Chi"
        },
        {
            h: "梔",
            v: "Chi"
        },
        {
            h: "巵",
            v: "Chi"
        },
        {
            h: "卮",
            v: "Chi"
        },
        {
            h: "旃",
            v: "Chiên"
        },
        {
            h: "栴",
            v: "Chiên"
        },
        {
            h: "氈",
            v: "Chiên"
        },
        {
            h: "招",
            v: "Chiêu"
        },
        {
            h: "昭",
            v: "Chiêu"
        },
        {
            h: "占",
            v: "Chiếm/Chiêm"
        },
        {
            h: "戦",
            v: "Chiến"
        },
        {
            h: "戰",
            v: "Chiến"
        },
        {
            h: "照",
            v: "Chiếu"
        },
        {
            h: "詔",
            v: "Chiếu"
        },
        {
            h: "沼",
            v: "Chiểu"
        },
        {
            h: "征",
            v: "Chinh"
        },
        {
            h: "至",
            v: "Chí"
        },
        {
            h: "誌",
            v: "Chí"
        },
        {
            h: "志",
            v: "Chí"
        },
        {
            h: "摯",
            v: "Chí"
        },
        {
            h: "痣",
            v: "Chí"
        },
        {
            h: "咥",
            v: "Chí"
        },
        {
            h: "垤",
            v: "Chí"
        },
        {
            h: "隻",
            v: "Chích"
        },
        {
            h: "正",
            v: "Chính"
        },
        {
            h: "政",
            v: "Chính/Chánh"
        },
        {
            h: "祉",
            v: "Chỉ"
        },
        {
            h: "紙",
            v: "Chỉ"
        },
        {
            h: "旨",
            v: "Chỉ"
        },
        {
            h: "匁",
            v: "Chỉ"
        },
        {
            h: "指",
            v: "Chỉ"
        },
        {
            h: "止",
            v: "Chỉ"
        },
        {
            h: "只",
            v: "Chỉ"
        },
        {
            h: "鮨",
            v: "Chỉ"
        },
        {
            h: "枳",
            v: "Chỉ"
        },
        {
            h: "沚",
            v: "Chỉ"
        },
        {
            h: "砥",
            v: "Chỉ"
        },
        {
            h: "黹",
            v: "Chỉ"
        },
        {
            h: "咫",
            v: "Chỉ"
        },
        {
            h: "祇",
            v: "Chỉ"
        },
        {
            h: "址",
            v: "Chỉ"
        },
        {
            h: "整",
            v: "Chỉnh"
        },
        {
            h: "咀",
            v: "Chớ"
        },
        {
            h: "週",
            v: "Chu"
        },
        {
            h: "周",
            v: "Chu"
        },
        {
            h: "舟",
            v: "Chu/Châu"
        },
        {
            h: "朱",
            v: "Chu/Châu"
        },
        {
            h: "侏",
            v: "Chu/Châu"
        },
        {
            h: "蛛",
            v: "Chu/Thù"
        },
        {
            h: "准",
            v: "Chuẩn"
        },
        {
            h: "準",
            v: "Chuẩn"
        },
        {
            h: "隼",
            v: "Chuẩn"
        },
        {
            h: "凖",
            v: "Chuẩn"
        },
        {
            h: "終",
            v: "Chung"
        },
        {
            h: "鐘",
            v: "Chung"
        },
        {
            h: "螽",
            v: "Chung"
        },
        {
            h: "専",
            v: "Chuyên"
        },
        {
            h: "椽",
            v: "Chuyên"
        },
        {
            h: "專",
            v: "Chuyên"
        },
        {
            h: "拙",
            v: "Chuyết"
        },
        {
            h: "転",
            v: "Chuyển"
        },
        {
            h: "囀",
            v: "Chuyển"
        },
        {
            h: "注",
            v: "Chú"
        },
        {
            h: "鋳",
            v: "Chú"
        },
        {
            h: "咒",
            v: "Chú"
        },
        {
            h: "呪",
            v: "Chú"
        },
        {
            h: "祝",
            v: "Chúc"
        },
        {
            h: "嘱",
            v: "Chúc"
        },
        {
            h: "囑",
            v: "Chúc"
        },
        {
            h: "粥",
            v: "Chúc"
        },
        {
            h: "衆",
            v: "Chúng"
        },
        {
            h: "惴",
            v: "Chúy"
        },
        {
            h: "槌",
            v: "Chùy"
        },
        {
            h: "主",
            v: "Chủ"
        },
        {
            h: "丶",
            v: "Chủ"
        },
        {
            h: "麈",
            v: "Chủ"
        },
        {
            h: "種",
            v: "Chủng"
        },
        {
            h: "嘴",
            v: "Chủy"
        },
        {
            h: "匙",
            v: "Chủy"
        },
        {
            h: "粃",
            v: "Chủy"
        },
        {
            h: "諸",
            v: "Chư"
        },
        {
            h: "猪",
            v: "Chư/Trư"
        },
        {
            h: "蒸",
            v: "Chưng"
        },
        {
            h: "章",
            v: "Chương"
        },
        {
            h: "彰",
            v: "Chương"
        },
        {
            h: "樟",
            v: "Chương"
        },
        {
            h: "酌",
            v: "Chước"
        },
        {
            h: "勺",
            v: "Chước"
        },
        {
            h: "杓",
            v: "Chước"
        },
        {
            h: "斫",
            v: "Chước/Trác"
        },
        {
            h: "障",
            v: "Chướng"
        },
        {
            h: "瘴",
            v: "Chướng"
        },
        {
            h: "嶂",
            v: "Chướng"
        },
        {
            h: "掌",
            v: "Chưởng"
        },
        {
            h: "織",
            v: "Chức"
        },
        {
            h: "職",
            v: "Chức"
        },
        {
            h: "症",
            v: "Chứng"
        },
        {
            h: "証",
            v: "Chứng"
        },
        {
            h: "墸",
            v: "Chừ"
        },
        {
            h: "煮",
            v: "Chử"
        },
        {
            h: "渚",
            v: "Chử"
        },
        {
            h: "杵",
            v: "Chử"
        },
        {
            h: "楮",
            v: "Chử"
        },
        {
            h: "拯",
            v: "Chửng"
        },
        {
            h: "孤",
            v: "Cô"
        },
        {
            h: "蛄",
            v: "Cô"
        },
        {
            h: "估",
            v: "Cô"
        },
        {
            h: "辜",
            v: "Cô"
        },
        {
            h: "呱",
            v: "Cô"
        },
        {
            h: "姑",
            v: "Cô"
        },
        {
            h: "沽",
            v: "Cô/Cổ"
        },
        {
            h: "昆",
            v: "Côn"
        },
        {
            h: "棍",
            v: "Côn"
        },
        {
            h: "崑",
            v: "Côn"
        },
        {
            h: "公",
            v: "Công"
        },
        {
            h: "工",
            v: "Công"
        },
        {
            h: "功",
            v: "Công"
        },
        {
            h: "攻",
            v: "Công"
        },
        {
            h: "蚣",
            v: "Công"
        },
        {
            h: "顧",
            v: "Cố"
        },
        {
            h: "固",
            v: "Cố"
        },
        {
            h: "雇",
            v: "Cố"
        },
        {
            h: "故",
            v: "Cố"
        },
        {
            h: "痼",
            v: "Cố"
        },
        {
            h: "穀",
            v: "Cốc"
        },
        {
            h: "谷",
            v: "Cốc"
        },
        {
            h: "梏",
            v: "Cốc"
        },
        {
            h: "轂",
            v: "Cốc"
        },
        {
            h: "檜",
            v: "Cối"
        },
        {
            h: "桧",
            v: "Cối"
        },
        {
            h: "貢",
            v: "Cống"
        },
        {
            h: "槓",
            v: "Cống"
        },
        {
            h: "骨",
            v: "Cốt"
        },
        {
            h: "榾",
            v: "Cốt"
        },
        {
            h: "鼓",
            v: "Cổ"
        },
        {
            h: "古",
            v: "Cổ"
        },
        {
            h: "股",
            v: "Cổ"
        },
        {
            h: "瞽",
            v: "Cổ"
        },
        {
            h: "袞",
            v: "Cổn"
        },
        {
            h: "共",
            v: "Cộng"
        },
        {
            h: "肌",
            v: "Cơ"
        },
        {
            h: "飢",
            v: "Cơ"
        },
        {
            h: "基",
            v: "Cơ"
        },
        {
            h: "姫",
            v: "Cơ"
        },
        {
            h: "饑",
            v: "Cơ"
        },
        {
            h: "譏",
            v: "Cơ"
        },
        {
            h: "機",
            v: "Cơ/Ky"
        },
        {
            h: "供",
            v: "Cung"
        },
        {
            h: "宮",
            v: "Cung"
        },
        {
            h: "弓",
            v: "Cung"
        },
        {
            h: "恭",
            v: "Cung"
        },
        {
            h: "躬",
            v: "Cung"
        },
        {
            h: "蛩",
            v: "Cung"
        },
        {
            h: "狂",
            v: "Cuồng"
        },
        {
            h: "桛",
            v: "(Cuộn)"
        },
        {
            h: "句",
            v: "Cú"
        },
        {
            h: "菊",
            v: "Cúc"
        },
        {
            h: "椈",
            v: "Cúc"
        },
        {
            h: "掬",
            v: "Cúc"
        },
        {
            h: "衢",
            v: "Cù"
        },
        {
            h: "樛",
            v: "Cù"
        },
        {
            h: "劬",
            v: "Cù"
        },
        {
            h: "窮",
            v: "Cùng"
        },
        {
            h: "糾",
            v: "Củ"
        },
        {
            h: "赳",
            v: "Củ"
        },
        {
            h: "矩",
            v: "Củ"
        },
        {
            h: "拱",
            v: "Củng"
        },
        {
            h: "廾",
            v: "Củng"
        },
        {
            h: "窶",
            v: "Cũ/Lũ"
        },
        {
            h: "具",
            v: "Cụ"
        },
        {
            h: "惧",
            v: "Cụ"
        },
        {
            h: "懼",
            v: "Cụ"
        },
        {
            h: "局",
            v: "Cục"
        },
        {
            h: "居",
            v: "Cư"
        },
        {
            h: "鋸",
            v: "Cư"
        },
        {
            h: "据",
            v: "Cư/Cứ"
        },
        {
            h: "裾",
            v: "Cư/Cứ"
        },
        {
            h: "綱",
            v: "Cương"
        },
        {
            h: "鋼",
            v: "Cương"
        },
        {
            h: "剛",
            v: "Cương"
        },
        {
            h: "岡",
            v: "Cương"
        },
        {
            h: "棡",
            v: "Cương"
        },
        {
            h: "疆",
            v: "Cương"
        },
        {
            h: "僵",
            v: "Cương"
        },
        {
            h: "崗",
            v: "Cương"
        },
        {
            h: "脚",
            v: "Cước"
        },
        {
            h: "強",
            v: "Cường"
        },
        {
            h: "彊",
            v: "Cường"
        },
        {
            h: "襁",
            v: "Cưỡng"
        },
        {
            h: "鳩",
            v: "Cưu"
        },
        {
            h: "拠",
            v: "Cứ"
        },
        {
            h: "據",
            v: "Cứ"
        },
        {
            h: "倨",
            v: "Cứ"
        },
        {
            h: "亟",
            v: "Cức"
        },
        {
            h: "棘",
            v: "Cức"
        },
        {
            h: "究",
            v: "Cứu"
        },
        {
            h: "救",
            v: "Cứu"
        },
        {
            h: "厩",
            v: "Cứu"
        },
        {
            h: "廐",
            v: "Cứu"
        },
        {
            h: "廏",
            v: "Cứu"
        },
        {
            h: "渠",
            v: "Cừ"
        },
        {
            h: "仇",
            v: "Cừu"
        },
        {
            h: "挙",
            v: "Cử"
        },
        {
            h: "擧",
            v: "Cử"
        },
        {
            h: "枸",
            v: "Cử/Cẩu"
        },
        {
            h: "九",
            v: "Cửu"
        },
        {
            h: "久",
            v: "Cửu"
        },
        {
            h: "疚",
            v: "Cửu"
        },
        {
            h: "柩",
            v: "Cữu"
        },
        {
            h: "臼",
            v: "Cữu"
        },
        {
            h: "咎",
            v: "Cữu"
        },
        {
            h: "距",
            v: "Cự"
        },
        {
            h: "巨",
            v: "Cự"
        },
        {
            h: "拒",
            v: "Cự"
        },
        {
            h: "極",
            v: "Cực"
        },
        {
            h: "旧",
            v: "Cựu"
        },
        {
            h: "名",
            v: "Danh"
        },
        {
            h: "謡",
            v: "Dao"
        },
        {
            h: "揺",
            v: "Dao"
        },
        {
            h: "瑤",
            v: "Dao"
        },
        {
            h: "徭",
            v: "Dao"
        },
        {
            h: "搖",
            v: "Dao/Diêu"
        },
        {
            h: "野",
            v: "Dã"
        },
        {
            h: "也",
            v: "Dã"
        },
        {
            h: "冶",
            v: "Dã"
        },
        {
            h: "埜",
            v: "Dã"
        },
        {
            h: "夜",
            v: "Dạ"
        },
        {
            h: "様",
            v: "Dạng"
        },
        {
            h: "樣",
            v: "Dạng"
        },
        {
            h: "淫",
            v: "Dâm"
        },
        {
            h: "婬",
            v: "Dâm"
        },
        {
            h: "民",
            v: "Dân"
        },
        {
            h: "寅",
            v: "Dần"
        },
        {
            h: "引",
            v: "Dẫn"
        },
        {
            h: "蚓",
            v: "Dẫn"
        },
        {
            h: "廴",
            v: "Dẫn"
        },
        {
            h: "胤",
            v: "Dận"
        },
        {
            h: "逸",
            v: "Dật"
        },
        {
            h: "佚",
            v: "Dật"
        },
        {
            h: "酉",
            v: "Dậu"
        },
        {
            h: "杙",
            v: "Dặc"
        },
        {
            h: "弋",
            v: "Dặc"
        },
        {
            h: "栃",
            v: "(Dẻ)"
        },
        {
            h: "移",
            v: "Di"
        },
        {
            h: "遺",
            v: "Di"
        },
        {
            h: "弥",
            v: "Di"
        },
        {
            h: "怡",
            v: "Di"
        },
        {
            h: "痍",
            v: "Di"
        },
        {
            h: "夷",
            v: "Di"
        },
        {
            h: "姨",
            v: "Di"
        },
        {
            h: "彌",
            v: "Di"
        },
        {
            h: "彜",
            v: "Di"
        },
        {
            h: "彝",
            v: "Di"
        },
        {
            h: "洟",
            v: "Di/Thế"
        },
        {
            h: "葉",
            v: "Diệp"
        },
        {
            h: "塩",
            v: "Diêm"
        },
        {
            h: "檐",
            v: "Diêm"
        },
        {
            h: "延",
            v: "Diên"
        },
        {
            h: "鳶",
            v: "Diên"
        },
        {
            h: "蜒",
            v: "Diên"
        },
        {
            h: "窯",
            v: "Diêu"
        },
        {
            h: "遙",
            v: "Diêu"
        },
        {
            h: "姚",
            v: "Diêu"
        },
        {
            h: "遥",
            v: "Diêu"
        },
        {
            h: "凧",
            v: "(Diều)"
        },
        {
            h: "艶",
            v: "Diễm"
        },
        {
            h: "焔",
            v: "Diễm"
        },
        {
            h: "演",
            v: "Diễn"
        },
        {
            h: "衍",
            v: "Diễn"
        },
        {
            h: "亦",
            v: "Diệc"
        },
        {
            h: "面",
            v: "Diện"
        },
        {
            h: "滅",
            v: "Diệt"
        },
        {
            h: "妙",
            v: "Diệu"
        },
        {
            h: "曜",
            v: "Diệu"
        },
        {
            h: "耀",
            v: "Diệu"
        },
        {
            h: "以",
            v: "Dĩ"
        },
        {
            h: "已",
            v: "Dĩ"
        },
        {
            h: "穎",
            v: "Dĩnh"
        },
        {
            h: "異",
            v: "Dị"
        },
        {
            h: "易",
            v: "Dị/Dịch"
        },
        {
            h: "液",
            v: "Dịch"
        },
        {
            h: "疫",
            v: "Dịch"
        },
        {
            h: "訳",
            v: "Dịch"
        },
        {
            h: "駅",
            v: "Dịch"
        },
        {
            h: "役",
            v: "Dịch"
        },
        {
            h: "懌",
            v: "Dịch"
        },
        {
            h: "掖",
            v: "Dịch"
        },
        {
            h: "剔",
            v: "Dịch"
        },
        {
            h: "蜴",
            v: "Dịch"
        },
        {
            h: "奕",
            v: "Dịch"
        },
        {
            h: "猷",
            v: "Do"
        },
        {
            h: "由",
            v: "Do"
        },
        {
            h: "楢",
            v: "Do"
        },
        {
            h: "猶",
            v: "Do"
        },
        {
            h: "塋",
            v: "Doanh"
        },
        {
            h: "楹",
            v: "Doanh"
        },
        {
            h: "贏",
            v: "Doanh"
        },
        {
            h: "營",
            v: "Doanh"
        },
        {
            h: "営",
            v: "Doanh/Dinh"
        },
        {
            h: "允",
            v: "Doãn/Duẫn"
        },
        {
            h: "尹",
            v: "Doãn/Duẫn"
        },
        {
            h: "油",
            v: "Du"
        },
        {
            h: "遊",
            v: "Du"
        },
        {
            h: "悠",
            v: "Du"
        },
        {
            h: "愉",
            v: "Du"
        },
        {
            h: "揄",
            v: "Du"
        },
        {
            h: "攸",
            v: "Du"
        },
        {
            h: "諛",
            v: "Du"
        },
        {
            h: "楡",
            v: "Du"
        },
        {
            h: "臾",
            v: "Du"
        },
        {
            h: "蚰",
            v: "Du"
        },
        {
            h: "蝣",
            v: "Du"
        },
        {
            h: "蝓",
            v: "Du"
        },
        {
            h: "偸",
            v: "Du"
        },
        {
            h: "兪",
            v: "Du"
        },
        {
            h: "岫",
            v: "Du"
        },
        {
            h: "曵",
            v: "Duệ"
        },
        {
            h: "曳",
            v: "Duệ"
        },
        {
            h: "睿",
            v: "Duệ"
        },
        {
            h: "叡",
            v: "Duệ"
        },
        {
            h: "融",
            v: "Dung"
        },
        {
            h: "庸",
            v: "Dung"
        },
        {
            h: "蓉",
            v: "Dung"
        },
        {
            h: "慵",
            v: "Dung"
        },
        {
            h: "溶",
            v: "Dung/Dong"
        },
        {
            h: "容",
            v: "Dung/Dong"
        },
        {
            h: "榕",
            v: "Dung/Dong"
        },
        {
            h: "維",
            v: "Duy"
        },
        {
            h: "唯",
            v: "Duy"
        },
        {
            h: "惟",
            v: "Duy"
        },
        {
            h: "帷",
            v: "Duy"
        },
        {
            h: "沿",
            v: "Duyên"
        },
        {
            h: "縁",
            v: "Duyên"
        },
        {
            h: "鉛",
            v: "Duyên"
        },
        {
            h: "櫞",
            v: "Duyên"
        },
        {
            h: "掾",
            v: "Duyện"
        },
        {
            h: "吮",
            v: "Duyện"
        },
        {
            h: "閲",
            v: "Duyệt"
        },
        {
            h: "悦",
            v: "Duyệt"
        },
        {
            h: "癒",
            v: "Dũ"
        },
        {
            h: "瘉",
            v: "Dũ"
        },
        {
            h: "愈",
            v: "Dũ"
        },
        {
            h: "躍",
            v: "Dũng"
        },
        {
            h: "勇",
            v: "Dũng"
        },
        {
            h: "慂",
            v: "Dũng"
        },
        {
            h: "桶",
            v: "Dũng"
        },
        {
            h: "涌",
            v: "Dũng"
        },
        {
            h: "蛹",
            v: "Dũng"
        },
        {
            h: "俑",
            v: "Dũng"
        },
        {
            h: "芋",
            v: "Dụ"
        },
        {
            h: "裕",
            v: "Dụ"
        },
        {
            h: "誘",
            v: "Dụ"
        },
        {
            h: "諭",
            v: "Dụ"
        },
        {
            h: "喩",
            v: "Dụ"
        },
        {
            h: "峪",
            v: "Dụ"
        },
        {
            h: "浴",
            v: "Dục"
        },
        {
            h: "育",
            v: "Dục"
        },
        {
            h: "欲",
            v: "Dục"
        },
        {
            h: "毓",
            v: "Dục"
        },
        {
            h: "慾",
            v: "Dục"
        },
        {
            h: "用",
            v: "Dụng"
        },
        {
            h: "傭",
            v: "Dụng"
        },
        {
            h: "余",
            v: "Dư"
        },
        {
            h: "歟",
            v: "Dư"
        },
        {
            h: "輿",
            v: "Dư"
        },
        {
            h: "洋",
            v: "Dương"
        },
        {
            h: "羊",
            v: "Dương"
        },
        {
            h: "陽",
            v: "Dương"
        },
        {
            h: "揚",
            v: "Dương"
        },
        {
            h: "楊",
            v: "Dương"
        },
        {
            h: "昜",
            v: "Dương"
        },
        {
            h: "暘",
            v: "Dương"
        },
        {
            h: "佯",
            v: "Dương"
        },
        {
            h: "瘍",
            v: "Dương"
        },
        {
            h: "養",
            v: "Dưỡng"
        },
        {
            h: "痒",
            v: "Dưỡng"
        },
        {
            h: "癢",
            v: "Dưỡng"
        },
        {
            h: "薬",
            v: "Dược"
        },
        {
            h: "踊",
            v: "Dược"
        },
        {
            h: "龠",
            v: "Dược/Thược"
        },
        {
            h: "鼬",
            v: "Dứu"
        },
        {
            h: "嶼",
            v: "Dữ/Dự"
        },
        {
            h: "柚",
            v: "Dữu/Chục"
        },
        {
            h: "予",
            v: "Dự"
        },
        {
            h: "誉",
            v: "Dự"
        },
        {
            h: "預",
            v: "Dự"
        },
        {
            h: "与",
            v: "Dự/Dữ"
        },
        {
            h: "與",
            v: "Dự/Dữ"
        },
        {
            h: "翌",
            v: "Dực"
        },
        {
            h: "翼",
            v: "Dực"
        },
        {
            h: "孕",
            v: "Dựng"
        },
        {
            h: "多",
            v: "Đa"
        },
        {
            h: "耽",
            v: "Đam"
        },
        {
            h: "單",
            v: "Đan"
        },
        {
            h: "丹",
            v: "Đan/Đơn"
        },
        {
            h: "儻",
            v: "Đang"
        },
        {
            h: "刀",
            v: "Đao"
        },
        {
            h: "戴",
            v: "Đái"
        },
        {
            h: "旦",
            v: "Đán"
        },
        {
            h: "到",
            v: "Đáo"
        },
        {
            h: "答",
            v: "Đáp"
        },
        {
            h: "搭",
            v: "Đáp"
        },
        {
            h: "怛",
            v: "Đát"
        },
        {
            h: "妲",
            v: "Đát"
        },
        {
            h: "駄",
            v: "Đà"
        },
        {
            h: "陀",
            v: "Đà"
        },
        {
            h: "沱",
            v: "Đà"
        },
        {
            h: "佗",
            v: "Đà"
        },
        {
            h: "台",
            v: "Đài"
        },
        {
            h: "抬",
            v: "Đài"
        },
        {
            h: "擡",
            v: "Đài"
        },
        {
            h: "苔",
            v: "Đài"
        },
        {
            h: "臺",
            v: "Đài"
        },
        {
            h: "談",
            v: "Đàm"
        },
        {
            h: "曇",
            v: "Đàm"
        },
        {
            h: "痰",
            v: "Đàm"
        },
        {
            h: "壜",
            v: "Đàm"
        },
        {
            h: "壇",
            v: "Đàn"
        },
        {
            h: "檀",
            v: "Đàn"
        },
        {
            h: "亶",
            v: "Đàn"
        },
        {
            h: "弾",
            v: "Đàn/Đạn"
        },
        {
            h: "殫",
            v: "Đàn/Đạn"
        },
        {
            h: "彈",
            v: "Đàn/Đạn"
        },
        {
            h: "逃",
            v: "Đào"
        },
        {
            h: "陶",
            v: "Đào"
        },
        {
            h: "桃",
            v: "Đào"
        },
        {
            h: "檮",
            v: "Đào"
        },
        {
            h: "掏",
            v: "Đào"
        },
        {
            h: "打",
            v: "Đả"
        },
        {
            h: "柁",
            v: "Đả/Đà"
        },
        {
            h: "胆",
            v: "Đảm"
        },
        {
            h: "担",
            v: "Đảm"
        },
        {
            h: "擔",
            v: "Đảm"
        },
        {
            h: "憺",
            v: "Đảm"
        },
        {
            h: "疸",
            v: "Đảm"
        },
        {
            h: "誕",
            v: "Đản"
        },
        {
            h: "但",
            v: "Đản"
        },
        {
            h: "蜑",
            v: "Đản"
        },
        {
            h: "党",
            v: "Đảng"
        },
        {
            h: "黨",
            v: "Đảng"
        },
        {
            h: "島",
            v: "Đảo"
        },
        {
            h: "倒",
            v: "Đảo"
        },
        {
            h: "搗",
            v: "Đảo"
        },
        {
            h: "擣",
            v: "Đảo"
        },
        {
            h: "嶌",
            v: "Đảo"
        },
        {
            h: "嶋",
            v: "Đảo"
        },
        {
            h: "逮",
            v: "Đãi"
        },
        {
            h: "怠",
            v: "Đãi"
        },
        {
            h: "待",
            v: "Đãi"
        },
        {
            h: "殆",
            v: "Đãi"
        },
        {
            h: "宕",
            v: "Đãng"
        },
        {
            h: "蕩",
            v: "Đãng"
        },
        {
            h: "袋",
            v: "Đại"
        },
        {
            h: "代",
            v: "Đại"
        },
        {
            h: "大",
            v: "Đại"
        },
        {
            h: "黛",
            v: "Đại"
        },
        {
            h: "淡",
            v: "Đạm"
        },
        {
            h: "啗",
            v: "Đạm"
        },
        {
            h: "澹",
            v: "Đạm"
        },
        {
            h: "憚",
            v: "Đạn"
        },
        {
            h: "盗",
            v: "Đạo"
        },
        {
            h: "稲",
            v: "Đạo"
        },
        {
            h: "道",
            v: "Đạo"
        },
        {
            h: "導",
            v: "Đạo"
        },
        {
            h: "踏",
            v: "Đạp"
        },
        {
            h: "沓",
            v: "Đạp"
        },
        {
            h: "達",
            v: "Đạt"
        },
        {
            h: "撻",
            v: "Đạt"
        },
        {
            h: "兜",
            v: "Đâu"
        },
        {
            h: "闘",
            v: "Đấu"
        },
        {
            h: "斗",
            v: "Đấu"
        },
        {
            h: "頭",
            v: "Đầu"
        },
        {
            h: "投",
            v: "Đầu"
        },
        {
            h: "亠",
            v: "Đầu"
        },
        {
            h: "抖",
            v: "Đẩu"
        },
        {
            h: "蚪",
            v: "Đẩu"
        },
        {
            h: "痘",
            v: "Đậu"
        },
        {
            h: "豆",
            v: "Đậu"
        },
        {
            h: "灯",
            v: "Đăng"
        },
        {
            h: "登",
            v: "Đăng"
        },
        {
            h: "燈",
            v: "Đăng"
        },
        {
            h: "嶝",
            v: "Đăng"
        },
        {
            h: "得",
            v: "Đắc"
        },
        {
            h: "謄",
            v: "Đằng"
        },
        {
            h: "騰",
            v: "Đằng"
        },
        {
            h: "藤",
            v: "Đằng"
        },
        {
            h: "等",
            v: "Đẳng"
        },
        {
            h: "特",
            v: "Đặc"
        },
        {
            h: "鄧",
            v: "Đặng"
        },
        {
            h: "峠",
            v: "(Đèo)"
        },
        {
            h: "垰",
            v: "(Đèo)"
        },
        {
            h: "低",
            v: "Đê"
        },
        {
            h: "堤",
            v: "Đê"
        },
        {
            h: "悌",
            v: "Đê"
        },
        {
            h: "締",
            v: "Đế"
        },
        {
            h: "帝",
            v: "Đế"
        },
        {
            h: "柢",
            v: "Đế"
        },
        {
            h: "嚔",
            v: "Đế"
        },
        {
            h: "嚏",
            v: "Đế"
        },
        {
            h: "提",
            v: "Đề"
        },
        {
            h: "題",
            v: "Đề"
        },
        {
            h: "啼",
            v: "Đề"
        },
        {
            h: "邸",
            v: "Để"
        },
        {
            h: "底",
            v: "Để"
        },
        {
            h: "抵",
            v: "Để"
        },
        {
            h: "第",
            v: "Đệ"
        },
        {
            h: "逓",
            v: "Đệ"
        },
        {
            h: "弟",
            v: "Đệ"
        },
        {
            h: "俤",
            v: "(Đệ)"
        },
        {
            h: "癲",
            v: "Điên"
        },
        {
            h: "巓",
            v: "Điên"
        },
        {
            h: "彫",
            v: "Điêu"
        },
        {
            h: "鯛",
            v: "Điêu"
        },
        {
            h: "蜩",
            v: "Điêu"
        },
        {
            h: "佻",
            v: "Điêu"
        },
        {
            h: "凋",
            v: "Điêu"
        },
        {
            h: "店",
            v: "Điếm"
        },
        {
            h: "癜",
            v: "Điến"
        },
        {
            h: "釣",
            v: "Điếu"
        },
        {
            h: "吊",
            v: "Điếu"
        },
        {
            h: "弔",
            v: "Điếu/Đích"
        },
        {
            h: "恬",
            v: "Điềm"
        },
        {
            h: "田",
            v: "Điền"
        },
        {
            h: "鈿",
            v: "Điền"
        },
        {
            h: "佃",
            v: "Điền"
        },
        {
            h: "填",
            v: "Điền"
        },
        {
            h: "調",
            v: "Điều"
        },
        {
            h: "条",
            v: "Điều"
        },
        {
            h: "蔦",
            v: "Điều"
        },
        {
            h: "齠",
            v: "Điều"
        },
        {
            h: "條",
            v: "Điều"
        },
        {
            h: "点",
            v: "Điểm"
        },
        {
            h: "點",
            v: "Điểm"
        },
        {
            h: "典",
            v: "Điển"
        },
        {
            h: "鳥",
            v: "Điểu"
        },
        {
            h: "殄",
            v: "Điễn"
        },
        {
            h: "殿",
            v: "Điện"
        },
        {
            h: "電",
            v: "Điện"
        },
        {
            h: "奠",
            v: "Điện"
        },
        {
            h: "畳",
            v: "Điệp"
        },
        {
            h: "諜",
            v: "Điệp"
        },
        {
            h: "蝶",
            v: "Điệp"
        },
        {
            h: "喋",
            v: "Điệp"
        },
        {
            h: "迭",
            v: "Điệt"
        },
        {
            h: "蛭",
            v: "Điệt"
        },
        {
            h: "姪",
            v: "Điệt"
        },
        {
            h: "悼",
            v: "Điệu"
        },
        {
            h: "掉",
            v: "Điệu/Trạo"
        },
        {
            h: "町",
            v: "Đinh"
        },
        {
            h: "丁",
            v: "Đinh"
        },
        {
            h: "釘",
            v: "Đinh"
        },
        {
            h: "疔",
            v: "Đinh"
        },
        {
            h: "汀",
            v: "Đinh"
        },
        {
            h: "叮",
            v: "Đinh"
        },
        {
            h: "的",
            v: "Đích"
        },
        {
            h: "嫡",
            v: "Đích"
        },
        {
            h: "訂",
            v: "Đính"
        },
        {
            h: "艇",
            v: "Đình"
        },
        {
            h: "亭",
            v: "Đình"
        },
        {
            h: "停",
            v: "Đình"
        },
        {
            h: "庭",
            v: "Đình"
        },
        {
            h: "廷",
            v: "Đình"
        },
        {
            h: "鼎",
            v: "Đỉnh"
        },
        {
            h: "頂",
            v: "Đỉnh/Đinh"
        },
        {
            h: "錠",
            v: "Đĩnh"
        },
        {
            h: "挺",
            v: "Đĩnh"
        },
        {
            h: "梃",
            v: "Đĩnh"
        },
        {
            h: "地",
            v: "Địa"
        },
        {
            h: "笛",
            v: "Địch"
        },
        {
            h: "敵",
            v: "Địch"
        },
        {
            h: "迪",
            v: "Địch"
        },
        {
            h: "廸",
            v: "Địch"
        },
        {
            h: "定",
            v: "Định"
        },
        {
            h: "掟",
            v: "Định"
        },
        {
            h: "端",
            v: "Đoan"
        },
        {
            h: "兌",
            v: "Đoài/Đoái"
        },
        {
            h: "団",
            v: "Đoàn"
        },
        {
            h: "摶",
            v: "Đoàn"
        },
        {
            h: "團",
            v: "Đoàn"
        },
        {
            h: "鍛",
            v: "Đoàn/Đoán"
        },
        {
            h: "短",
            v: "Đoản"
        },
        {
            h: "段",
            v: "Đoạn"
        },
        {
            h: "断",
            v: "Đoạn/Đoán"
        },
        {
            h: "斷",
            v: "Đoạn/Đoán"
        },
        {
            h: "奪",
            v: "Đoạt"
        },
        {
            h: "朶",
            v: "Đóa"
        },
        {
            h: "躱",
            v: "Đóa"
        },
        {
            h: "堕",
            v: "Đọa"
        },
        {
            h: "墮",
            v: "Đọa"
        },
        {
            h: "惰",
            v: "Đọa/Nọa"
        },
        {
            h: "都",
            v: "Đô"
        },
        {
            h: "堆",
            v: "Đôi"
        },
        {
            h: "惇",
            v: "Đôn"
        },
        {
            h: "敦",
            v: "Đôn"
        },
        {
            h: "暾",
            v: "Đôn"
        },
        {
            h: "東",
            v: "Đông"
        },
        {
            h: "凍",
            v: "Đông"
        },
        {
            h: "冬",
            v: "Đông"
        },
        {
            h: "柊",
            v: "Đông"
        },
        {
            h: "疼",
            v: "Đông"
        },
        {
            h: "鼕",
            v: "Đông"
        },
        {
            h: "妬",
            v: "Đố"
        },
        {
            h: "蠧",
            v: "Đố"
        },
        {
            h: "督",
            v: "Đốc"
        },
        {
            h: "篤",
            v: "Đốc"
        },
        {
            h: "対",
            v: "Đối"
        },
        {
            h: "對",
            v: "Đối"
        },
        {
            h: "頓",
            v: "Đốn"
        },
        {
            h: "噸",
            v: "Đốn"
        },
        {
            h: "棟",
            v: "Đống"
        },
        {
            h: "柮",
            v: "Đốt"
        },
        {
            h: "咄",
            v: "Đốt"
        },
        {
            h: "途",
            v: "Đồ"
        },
        {
            h: "図",
            v: "Đồ"
        },
        {
            h: "塗",
            v: "Đồ"
        },
        {
            h: "徒",
            v: "Đồ"
        },
        {
            h: "屠",
            v: "Đồ"
        },
        {
            h: "圖",
            v: "Đồ"
        },
        {
            h: "噂",
            v: "Đồn"
        },
        {
            h: "飩",
            v: "Đồn"
        },
        {
            h: "豚",
            v: "Đồn/Độn"
        },
        {
            h: "屯",
            v: "Đồn/Truân"
        },
        {
            h: "童",
            v: "Đồng"
        },
        {
            h: "筒",
            v: "Đồng"
        },
        {
            h: "銅",
            v: "Đồng"
        },
        {
            h: "同",
            v: "Đồng"
        },
        {
            h: "畠",
            v: "(Đồng)"
        },
        {
            h: "桐",
            v: "Đồng"
        },
        {
            h: "瞳",
            v: "Đồng"
        },
        {
            h: "僮",
            v: "Đồng"
        },
        {
            h: "賭",
            v: "Đổ"
        },
        {
            h: "堵",
            v: "Đổ"
        },
        {
            h: "杜",
            v: "Đỗ"
        },
        {
            h: "胴",
            v: "Đỗng"
        },
        {
            h: "渡",
            v: "Độ"
        },
        {
            h: "度",
            v: "Độ"
        },
        {
            h: "毒",
            v: "Độc"
        },
        {
            h: "独",
            v: "Độc"
        },
        {
            h: "読",
            v: "Độc"
        },
        {
            h: "黷",
            v: "Độc"
        },
        {
            h: "隊",
            v: "Đội"
        },
        {
            h: "鈍",
            v: "Độn"
        },
        {
            h: "遁",
            v: "Độn"
        },
        {
            h: "沌",
            v: "Độn"
        },
        {
            h: "洞",
            v: "Động"
        },
        {
            h: "働",
            v: "Động"
        },
        {
            h: "動",
            v: "Động"
        },
        {
            h: "恫",
            v: "Động"
        },
        {
            h: "慟",
            v: "Động"
        },
        {
            h: "突",
            v: "Đột"
        },
        {
            h: "凸",
            v: "Đột"
        },
        {
            h: "単",
            v: "Đơn"
        },
        {
            h: "帯",
            v: "Đới/Đái"
        },
        {
            h: "帶",
            v: "Đới/Đái"
        },
        {
            h: "当",
            v: "Đương"
        },
        {
            h: "档",
            v: "Đương"
        },
        {
            h: "當",
            v: "Đương"
        },
        {
            h: "糖",
            v: "Đường"
        },
        {
            h: "堂",
            v: "Đường"
        },
        {
            h: "唐",
            v: "Đường"
        },
        {
            h: "棠",
            v: "Đường"
        },
        {
            h: "螳",
            v: "Đường"
        },
        {
            h: "蟷",
            v: "Đường"
        },
        {
            h: "塘",
            v: "Đường"
        },
        {
            h: "徳",
            v: "Đức"
        },
        {
            h: "殪",
            v: "Ế"
        },
        {
            h: "噎",
            v: "Ế"
        },
        {
            h: "翳",
            v: "Ế"
        },
        {
            h: "籾",
            v: "(Gạo)"
        },
        {
            h: "加",
            v: "Gia"
        },
        {
            h: "家",
            v: "Gia"
        },
        {
            h: "耶",
            v: "Gia"
        },
        {
            h: "嘉",
            v: "Gia"
        },
        {
            h: "揶",
            v: "Gia"
        },
        {
            h: "椰",
            v: "Gia"
        },
        {
            h: "爺",
            v: "Gia"
        },
        {
            h: "皆",
            v: "Giai"
        },
        {
            h: "階",
            v: "Giai"
        },
        {
            h: "佳",
            v: "Giai"
        },
        {
            h: "偕",
            v: "Giai"
        },
        {
            h: "諧",
            v: "Giai"
        },
        {
            h: "楷",
            v: "Giai/Khai"
        },
        {
            h: "間",
            v: "Gian"
        },
        {
            h: "姦",
            v: "Gian"
        },
        {
            h: "奸",
            v: "Gian"
        },
        {
            h: "墹",
            v: "Gian"
        },
        {
            h: "江",
            v: "Giang"
        },
        {
            h: "肛",
            v: "Giang"
        },
        {
            h: "扛",
            v: "Giang"
        },
        {
            h: "杠",
            v: "Giang"
        },
        {
            h: "交",
            v: "Giao"
        },
        {
            h: "郊",
            v: "Giao"
        },
        {
            h: "鮫",
            v: "Giao"
        },
        {
            h: "攪",
            v: "Giao"
        },
        {
            h: "蛟",
            v: "Giao"
        },
        {
            h: "稼",
            v: "Giá"
        },
        {
            h: "価",
            v: "Giá"
        },
        {
            h: "嫁",
            v: "Giá"
        },
        {
            h: "架",
            v: "Giá"
        },
        {
            h: "柘",
            v: "Giá"
        },
        {
            h: "駕",
            v: "Giá"
        },
        {
            h: "价",
            v: "Giá"
        },
        {
            h: "價",
            v: "Giá"
        },
        {
            h: "這",
            v: "Giá/Nghiện"
        },
        {
            h: "覚",
            v: "Giác"
        },
        {
            h: "角",
            v: "Giác"
        },
        {
            h: "撹",
            v: "Giác"
        },
        {
            h: "桷",
            v: "Giác"
        },
        {
            h: "埆",
            v: "Giác"
        },
        {
            h: "較",
            v: "Giác/Hiệu"
        },
        {
            h: "監",
            v: "Giám"
        },
        {
            h: "鑑",
            v: "Giám"
        },
        {
            h: "降",
            v: "Giáng/Hàng"
        },
        {
            h: "教",
            v: "Giáo"
        },
        {
            h: "甲",
            v: "Giáp"
        },
        {
            h: "岬",
            v: "Giáp"
        },
        {
            h: "頬",
            v: "Giáp"
        },
        {
            h: "夾",
            v: "Giáp"
        },
        {
            h: "呷",
            v: "Giáp"
        },
        {
            h: "遮",
            v: "Già"
        },
        {
            h: "枷",
            v: "Già"
        },
        {
            h: "痂",
            v: "Già"
        },
        {
            h: "伽",
            v: "Già/Gia"
        },
        {
            h: "者",
            v: "Giả"
        },
        {
            h: "仮",
            v: "Giả"
        },
        {
            h: "假",
            v: "Giả/Giá"
        },
        {
            h: "解",
            v: "Giải"
        },
        {
            h: "蟹",
            v: "Giải"
        },
        {
            h: "懈",
            v: "Giải"
        },
        {
            h: "蠏",
            v: "Giải"
        },
        {
            h: "廨",
            v: "Giải"
        },
        {
            h: "減",
            v: "Giảm"
        },
        {
            h: "啖",
            v: "Giảm/Giãm"
        },
        {
            h: "簡",
            v: "Giản"
        },
        {
            h: "揀",
            v: "Giản"
        },
        {
            h: "柬",
            v: "Giản"
        },
        {
            h: "講",
            v: "Giảng"
        },
        {
            h: "絞",
            v: "Giảo"
        },
        {
            h: "噛",
            v: "Giảo"
        },
        {
            h: "咬",
            v: "Giảo"
        },
        {
            h: "酵",
            v: "Giếu/Diếu"
        },
        {
            h: "界",
            v: "Giới"
        },
        {
            h: "介",
            v: "Giới"
        },
        {
            h: "届",
            v: "Giới"
        },
        {
            h: "戒",
            v: "Giới"
        },
        {
            h: "械",
            v: "Giới"
        },
        {
            h: "疥",
            v: "Giới"
        },
        {
            h: "芥",
            v: "Giới"
        },
        {
            h: "堺",
            v: "Giới"
        },
        {
            h: "呵",
            v: "Ha/Kha"
        },
        {
            h: "蚶",
            v: "Ham"
        },
        {
            h: "亨",
            v: "Hanh/Hưởng"
        },
        {
            h: "耗",
            v: "Hao/Háo"
        },
        {
            h: "罅",
            v: "Há"
        },
        {
            h: "壑",
            v: "Hác"
        },
        {
            h: "嚇",
            v: "Hách"
        },
        {
            h: "憾",
            v: "Hám"
        },
        {
            h: "漢",
            v: "Hán"
        },
        {
            h: "厂",
            v: "Hán"
        },
        {
            h: "喝",
            v: "Hát"
        },
        {
            h: "河",
            v: "Hà"
        },
        {
            h: "荷",
            v: "Hà"
        },
        {
            h: "何",
            v: "Hà"
        },
        {
            h: "瑕",
            v: "Hà"
        },
        {
            h: "霞",
            v: "Hà"
        },
        {
            h: "苛",
            v: "Hà"
        },
        {
            h: "蝦",
            v: "Hà"
        },
        {
            h: "骸",
            v: "Hài"
        },
        {
            h: "孩",
            v: "Hài"
        },
        {
            h: "含",
            v: "Hàm"
        },
        {
            h: "函",
            v: "Hàm"
        },
        {
            h: "銜",
            v: "Hàm"
        },
        {
            h: "凾",
            v: "Hàm"
        },
        {
            h: "咸",
            v: "Hàm"
        },
        {
            h: "啣",
            v: "Hàm"
        },
        {
            h: "寒",
            v: "Hàn"
        },
        {
            h: "韓",
            v: "Hàn"
        },
        {
            h: "翰",
            v: "Hàn"
        },
        {
            h: "航",
            v: "Hàng"
        },
        {
            h: "杭",
            v: "Hàng"
        },
        {
            h: "茎",
            v: "Hành"
        },
        {
            h: "行",
            v: "Hành"
        },
        {
            h: "桁",
            v: "Hành/Hàng"
        },
        {
            h: "衡",
            v: "Hành/Hoàng"
        },
        {
            h: "豪",
            v: "Hào"
        },
        {
            h: "壕",
            v: "Hào"
        },
        {
            h: "濠",
            v: "Hào"
        },
        {
            h: "淆",
            v: "Hào"
        },
        {
            h: "肴",
            v: "Hào"
        },
        {
            h: "毫",
            v: "Hào"
        },
        {
            h: "海",
            v: "Hải"
        },
        {
            h: "喊",
            v: "Hảm"
        },
        {
            h: "好",
            v: "Hảo"
        },
        {
            h: "陥",
            v: "Hãm"
        },
        {
            h: "餡",
            v: "Hãm"
        },
        {
            h: "汗",
            v: "Hãn"
        },
        {
            h: "悍",
            v: "Hãn"
        },
        {
            h: "罕",
            v: "Hãn"
        },
        {
            h: "鼾",
            v: "Hãn/Han"
        },
        {
            h: "賀",
            v: "Hạ"
        },
        {
            h: "夏",
            v: "Hạ"
        },
        {
            h: "下",
            v: "Hạ"
        },
        {
            h: "暇",
            v: "Hạ"
        },
        {
            h: "厦",
            v: "Hạ"
        },
        {
            h: "嗄",
            v: "Hạ"
        },
        {
            h: "廈",
            v: "Hạ"
        },
        {
            h: "鶴",
            v: "Hạc"
        },
        {
            h: "寉",
            v: "Hạc"
        },
        {
            h: "核",
            v: "Hạch"
        },
        {
            h: "害",
            v: "Hại"
        },
        {
            h: "艦",
            v: "Hạm"
        },
        {
            h: "頷",
            v: "Hạm"
        },
        {
            h: "檻",
            v: "Hạm"
        },
        {
            h: "限",
            v: "Hạn"
        },
        {
            h: "旱",
            v: "Hạn"
        },
        {
            h: "項",
            v: "Hạng"
        },
        {
            h: "巷",
            v: "Hạng"
        },
        {
            h: "幸",
            v: "Hạnh"
        },
        {
            h: "杏",
            v: "Hạnh"
        },
        {
            h: "倖",
            v: "Hạnh"
        },
        {
            h: "圉",
            v: "Hạnh"
        },
        {
            h: "浩",
            v: "Hạo"
        },
        {
            h: "皓",
            v: "Hạo"
        },
        {
            h: "昊",
            v: "Hạo"
        },
        {
            h: "峡",
            v: "Hạp"
        },
        {
            h: "盒",
            v: "Hạp"
        },
        {
            h: "匣",
            v: "Hạp"
        },
        {
            h: "轄",
            v: "Hạt"
        },
        {
            h: "蠍",
            v: "Hạt"
        },
        {
            h: "蝎",
            v: "Hạt"
        },
        {
            h: "曷",
            v: "Hạt"
        },
        {
            h: "褐",
            v: "Hạt/Cát"
        },
        {
            h: "欣",
            v: "Hân"
        },
        {
            h: "忻",
            v: "Hân"
        },
        {
            h: "吸",
            v: "Hấp"
        },
        {
            h: "翕",
            v: "Hấp"
        },
        {
            h: "歙",
            v: "Hấp/Thiệp"
        },
        {
            h: "迄",
            v: "Hất"
        },
        {
            h: "侯",
            v: "Hầu"
        },
        {
            h: "喉",
            v: "Hầu"
        },
        {
            h: "很",
            v: "Hẩn"
        },
        {
            h: "缶",
            v: "Hẫu/Phữu"
        },
        {
            h: "恨",
            v: "Hận"
        },
        {
            h: "候",
            v: "Hậu"
        },
        {
            h: "厚",
            v: "Hậu"
        },
        {
            h: "後",
            v: "Hậu"
        },
        {
            h: "后",
            v: "Hậu"
        },
        {
            h: "黒",
            v: "Hắc"
        },
        {
            h: "恒",
            v: "Hằng"
        },
        {
            h: "亙",
            v: "Hằng"
        },
        {
            h: "劾",
            v: "Hặc"
        },
        {
            h: "兮",
            v: "Hề"
        },
        {
            h: "奚",
            v: "Hề"
        },
        {
            h: "係",
            v: "Hệ"
        },
        {
            h: "系",
            v: "Hệ"
        },
        {
            h: "繋",
            v: "Hệ"
        },
        {
            h: "匸",
            v: "Hệ"
        },
        {
            h: "犠",
            v: "Hi"
        },
        {
            h: "曦",
            v: "Hi"
        },
        {
            h: "嬉",
            v: "Hi"
        },
        {
            h: "軒",
            v: "Hiên"
        },
        {
            h: "掀",
            v: "Hiên"
        },
        {
            h: "囂",
            v: "Hiêu"
        },
        {
            h: "献",
            v: "Hiến"
        },
        {
            h: "憲",
            v: "Hiến"
        },
        {
            h: "脅",
            v: "Hiếp"
        },
        {
            h: "脇",
            v: "Hiếp"
        },
        {
            h: "歇",
            v: "Hiết"
        },
        {
            h: "孝",
            v: "Hiếu"
        },
        {
            h: "哮",
            v: "Hiếu"
        },
        {
            h: "嫌",
            v: "Hiềm"
        },
        {
            h: "慊",
            v: "Hiềm"
        },
        {
            h: "賢",
            v: "Hiền"
        },
        {
            h: "険",
            v: "Hiểm"
        },
        {
            h: "嶮",
            v: "Hiểm"
        },
        {
            h: "顕",
            v: "Hiển"
        },
        {
            h: "暁",
            v: "Hiểu"
        },
        {
            h: "曉",
            v: "Hiểu"
        },
        {
            h: "現",
            v: "Hiện"
        },
        {
            h: "蜆",
            v: "Hiện"
        },
        {
            h: "狭",
            v: "Hiệp"
        },
        {
            h: "協",
            v: "Hiệp"
        },
        {
            h: "恊",
            v: "Hiệp"
        },
        {
            h: "挾",
            v: "Hiệp"
        },
        {
            h: "侠",
            v: "Hiệp"
        },
        {
            h: "峽",
            v: "Hiệp"
        },
        {
            h: "洽",
            v: "Hiệp/Hợp"
        },
        {
            h: "挟",
            v: "Hiệp/Tiệp"
        },
        {
            h: "黠",
            v: "Hiệt"
        },
        {
            h: "効",
            v: "Hiệu"
        },
        {
            h: "号",
            v: "Hiệu"
        },
        {
            h: "效",
            v: "Hiệu"
        },
        {
            h: "佼",
            v: "Hiệu"
        },
        {
            h: "傚",
            v: "Hiệu"
        },
        {
            h: "校",
            v: "Hiệu/Giáo"
        },
        {
            h: "馨",
            v: "Hinh"
        },
        {
            h: "戯",
            v: "Hí"
        },
        {
            h: "戲",
            v: "Hí"
        },
        {
            h: "刑",
            v: "Hình"
        },
        {
            h: "型",
            v: "Hình"
        },
        {
            h: "形",
            v: "Hình"
        },
        {
            h: "檄",
            v: "Hịch"
        },
        {
            h: "花",
            v: "Hoa"
        },
        {
            h: "華",
            v: "Hoa"
        },
        {
            h: "崋",
            v: "Hoa"
        },
        {
            h: "樺",
            v: "Hoa"
        },
        {
            h: "嘩",
            v: "Hoa"
        },
        {
            h: "埖",
            v: "Hoa"
        },
        {
            h: "歓",
            v: "Hoan"
        },
        {
            h: "歡",
            v: "Hoan"
        },
        {
            h: "荒",
            v: "Hoang"
        },
        {
            h: "喚",
            v: "Hoán"
        },
        {
            h: "換",
            v: "Hoán"
        },
        {
            h: "奐",
            v: "Hoán"
        },
        {
            h: "浣",
            v: "Hoán/Cán"
        },
        {
            h: "懐",
            v: "Hoài"
        },
        {
            h: "懷",
            v: "Hoài"
        },
        {
            h: "環",
            v: "Hoàn"
        },
        {
            h: "還",
            v: "Hoàn"
        },
        {
            h: "完",
            v: "Hoàn"
        },
        {
            h: "丸",
            v: "Hoàn"
        },
        {
            h: "懽",
            v: "Hoàn"
        },
        {
            h: "桓",
            v: "Hoàn"
        },
        {
            h: "圜",
            v: "Hoàn"
        },
        {
            h: "鬟",
            v: "Hoàn"
        },
        {
            h: "寰",
            v: "Hoàn"
        },
        {
            h: "莞",
            v: "Hoàn/Hoản"
        },
        {
            h: "皇",
            v: "Hoàng"
        },
        {
            h: "徨",
            v: "Hoàng"
        },
        {
            h: "惶",
            v: "Hoàng"
        },
        {
            h: "蝗",
            v: "Hoàng"
        },
        {
            h: "凰",
            v: "Hoàng"
        },
        {
            h: "壙",
            v: "Hoàng"
        },
        {
            h: "黄",
            v: "Hoàng/Huỳnh"
        },
        {
            h: "横",
            v: "Hoành"
        },
        {
            h: "紘",
            v: "Hoành"
        },
        {
            h: "宏",
            v: "Hoành"
        },
        {
            h: "慌",
            v: "Hoảng"
        },
        {
            h: "幌",
            v: "Hoảng"
        },
        {
            h: "晃",
            v: "Hoảng"
        },
        {
            h: "恍",
            v: "Hoảng"
        },
        {
            h: "晄",
            v: "Hoảng"
        },
        {
            h: "緩",
            v: "Hoãn"
        },
        {
            h: "獲",
            v: "Hoạch"
        },
        {
            h: "穫",
            v: "Hoạch"
        },
        {
            h: "劃",
            v: "Hoạch"
        },
        {
            h: "壊",
            v: "Hoại"
        },
        {
            h: "坏",
            v: "Hoại"
        },
        {
            h: "壞",
            v: "Hoại"
        },
        {
            h: "患",
            v: "Hoạn"
        },
        {
            h: "宦",
            v: "Hoạn"
        },
        {
            h: "活",
            v: "Hoạt"
        },
        {
            h: "滑",
            v: "Hoạt"
        },
        {
            h: "癨",
            v: "Hoắc"
        },
        {
            h: "弘",
            v: "Hoằng"
        },
        {
            h: "泓",
            v: "Hoằng"
        },
        {
            h: "惑",
            v: "Hoặc"
        },
        {
            h: "或",
            v: "Hoặc"
        },
        {
            h: "貨",
            v: "Hóa"
        },
        {
            h: "化",
            v: "Hóa"
        },
        {
            h: "囮",
            v: "Hóa"
        },
        {
            h: "和",
            v: "Hòa"
        },
        {
            h: "啝",
            v: "Hòa"
        },
        {
            h: "槐",
            v: "Hòe"
        },
        {
            h: "火",
            v: "Hỏa"
        },
        {
            h: "禍",
            v: "Họa"
        },
        {
            h: "画",
            v: "Họa/Hoạch"
        },
        {
            h: "学",
            v: "Học"
        },
        {
            h: "斈",
            v: "Học"
        },
        {
            h: "學",
            v: "Học"
        },
        {
            h: "呼",
            v: "Hô"
        },
        {
            h: "灰",
            v: "Hôi"
        },
        {
            h: "婚",
            v: "Hôn"
        },
        {
            h: "棔",
            v: "Hôn"
        },
        {
            h: "昏",
            v: "Hôn"
        },
        {
            h: "賄",
            v: "Hối"
        },
        {
            h: "悔",
            v: "Hối"
        },
        {
            h: "匯",
            v: "Hối"
        },
        {
            h: "晦",
            v: "Hối"
        },
        {
            h: "哄",
            v: "Hống"
        },
        {
            h: "汞",
            v: "Hống"
        },
        {
            h: "吼",
            v: "Hống"
        },
        {
            h: "忽",
            v: "Hốt"
        },
        {
            h: "惚",
            v: "Hốt"
        },
        {
            h: "湖",
            v: "Hồ"
        },
        {
            h: "弧",
            v: "Hồ"
        },
        {
            h: "胡",
            v: "Hồ"
        },
        {
            h: "狐",
            v: "Hồ"
        },
        {
            h: "乎",
            v: "Hồ"
        },
        {
            h: "楜",
            v: "Hồ"
        },
        {
            h: "蝴",
            v: "Hồ"
        },
        {
            h: "匏",
            v: "Hồ"
        },
        {
            h: "壷",
            v: "Hồ"
        },
        {
            h: "壺",
            v: "Hồ"
        },
        {
            h: "回",
            v: "Hồi"
        },
        {
            h: "蛔",
            v: "Hồi"
        },
        {
            h: "囘",
            v: "Hồi"
        },
        {
            h: "廻",
            v: "Hồi"
        },
        {
            h: "徊",
            v: "Hồi"
        },
        {
            h: "魂",
            v: "Hồn"
        },
        {
            h: "渾",
            v: "Hồn"
        },
        {
            h: "洪",
            v: "Hồng"
        },
        {
            h: "紅",
            v: "Hồng"
        },
        {
            h: "虹",
            v: "Hồng"
        },
        {
            h: "虎",
            v: "Hổ"
        },
        {
            h: "互",
            v: "Hỗ"
        },
        {
            h: "混",
            v: "Hỗn"
        },
        {
            h: "護",
            v: "Hộ"
        },
        {
            h: "戸",
            v: "Hộ"
        },
        {
            h: "怙",
            v: "Hộ"
        },
        {
            h: "冱",
            v: "Hộ"
        },
        {
            h: "扈",
            v: "Hộ/Hỗ"
        },
        {
            h: "槲",
            v: "Hộc"
        },
        {
            h: "絵",
            v: "Hội"
        },
        {
            h: "会",
            v: "Hội"
        },
        {
            h: "潰",
            v: "Hội"
        },
        {
            h: "會",
            v: "Hội"
        },
        {
            h: "亥",
            v: "Hợi"
        },
        {
            h: "合",
            v: "Hợp/Cáp"
        },
        {
            h: "吁",
            v: "Hu"
        },
        {
            h: "勲",
            v: "Huân"
        },
        {
            h: "薫",
            v: "Huân"
        },
        {
            h: "勳",
            v: "Huân"
        },
        {
            h: "訓",
            v: "Huấn"
        },
        {
            h: "携",
            v: "Huề"
        },
        {
            h: "攜",
            v: "Huề"
        },
        {
            h: "畦",
            v: "Huề"
        },
        {
            h: "恵",
            v: "Huệ"
        },
        {
            h: "惠",
            v: "Huệ"
        },
        {
            h: "胸",
            v: "Hung"
        },
        {
            h: "凶",
            v: "Hung"
        },
        {
            h: "恟",
            v: "Hung"
        },
        {
            h: "洶",
            v: "Hung"
        },
        {
            h: "匈",
            v: "Hung"
        },
        {
            h: "兇",
            v: "Hung"
        },
        {
            h: "況",
            v: "Huống"
        },
        {
            h: "况",
            v: "Huống"
        },
        {
            h: "輝",
            v: "Huy"
        },
        {
            h: "揮",
            v: "Huy"
        },
        {
            h: "徽",
            v: "Huy"
        },
        {
            h: "暉",
            v: "Huy"
        },
        {
            h: "暄",
            v: "Huyên"
        },
        {
            h: "喧",
            v: "Huyên"
        },
        {
            h: "血",
            v: "Huyết"
        },
        {
            h: "玄",
            v: "Huyền"
        },
        {
            h: "弦",
            v: "Huyền"
        },
        {
            h: "懸",
            v: "Huyền"
        },
        {
            h: "絢",
            v: "Huyền"
        },
        {
            h: "痃",
            v: "Huyền"
        },
        {
            h: "絃",
            v: "Huyền"
        },
        {
            h: "呟",
            v: "Huyền"
        },
        {
            h: "眩",
            v: "Huyễn"
        },
        {
            h: "衒",
            v: "Huyễn"
        },
        {
            h: "県",
            v: "Huyện"
        },
        {
            h: "穴",
            v: "Huyệt"
        },
        {
            h: "兄",
            v: "Huynh"
        },
        {
            h: "蛍",
            v: "Huỳnh"
        },
        {
            h: "螢",
            v: "Huỳnh"
        },
        {
            h: "黌",
            v: "Huỳnh"
        },
        {
            h: "旭",
            v: "Húc"
        },
        {
            h: "勗",
            v: "Húc"
        },
        {
            h: "雄",
            v: "Hùng"
        },
        {
            h: "熊",
            v: "Hùng"
        },
        {
            h: "腐",
            v: "Hủ"
        },
        {
            h: "朽",
            v: "Hủ"
        },
        {
            h: "栩",
            v: "Hủ"
        },
        {
            h: "毀",
            v: "Hủy"
        },
        {
            h: "卉",
            v: "Hủy"
        },
        {
            h: "虚",
            v: "Hư"
        },
        {
            h: "歔",
            v: "Hư"
        },
        {
            h: "嘘",
            v: "Hư"
        },
        {
            h: "墟",
            v: "Hư"
        },
        {
            h: "興",
            v: "Hưng"
        },
        {
            h: "郷",
            v: "Hương"
        },
        {
            h: "香",
            v: "Hương"
        },
        {
            h: "向",
            v: "Hướng"
        },
        {
            h: "餉",
            v: "Hướng"
        },
        {
            h: "嚮",
            v: "Hướng"
        },
        {
            h: "享",
            v: "Hưởng"
        },
        {
            h: "響",
            v: "Hưởng"
        },
        {
            h: "休",
            v: "Hưu"
        },
        {
            h: "許",
            v: "Hứa"
        },
        {
            h: "洫",
            v: "Hức"
        },
        {
            h: "有",
            v: "Hữu"
        },
        {
            h: "友",
            v: "Hữu"
        },
        {
            h: "右",
            v: "Hữu"
        },
        {
            h: "祐",
            v: "Hữu"
        },
        {
            h: "佑",
            v: "Hữu"
        },
        {
            h: "囿",
            v: "Hữu"
        },
        {
            h: "又",
            v: "Hựu"
        },
        {
            h: "侑",
            v: "Hựu"
        },
        {
            h: "宥",
            v: "Hựu"
        },
        {
            h: "希",
            v: "Hy"
        },
        {
            h: "欷",
            v: "Hy"
        },
        {
            h: "唏",
            v: "Hy"
        },
        {
            h: "晞",
            v: "Hy/Hi"
        },
        {
            h: "稀",
            v: "Hy/Hi"
        },
        {
            h: "僖",
            v: "Hy/Hi"
        },
        {
            h: "憙",
            v: "Hý/Hí"
        },
        {
            h: "喜",
            v: "Hỷ/Hỉ"
        },
        {
            h: "益",
            v: "Ích"
        },
        {
            h: "々",
            v: "(Kép)"
        },
        {
            h: "鶏",
            v: "Kê"
        },
        {
            h: "稽",
            v: "Kê/Khể"
        },
        {
            h: "継",
            v: "Kế"
        },
        {
            h: "計",
            v: "Kế"
        },
        {
            h: "薊",
            v: "Kế"
        },
        {
            h: "結",
            v: "Kết"
        },
        {
            h: "檠",
            v: "Kềnh"
        },
        {
            h: "偈",
            v: "Kệ"
        },
        {
            h: "柯",
            v: "Kha"
        },
        {
            h: "開",
            v: "Khai"
        },
        {
            h: "堪",
            v: "Kham"
        },
        {
            h: "戡",
            v: "Kham"
        },
        {
            h: "龕",
            v: "Kham/Khám"
        },
        {
            h: "康",
            v: "Khang"
        },
        {
            h: "吭",
            v: "Khang"
        },
        {
            h: "坑",
            v: "Khanh"
        },
        {
            h: "卿",
            v: "Khanh"
        },
        {
            h: "恪",
            v: "Khác"
        },
        {
            h: "客",
            v: "Khách"
        },
        {
            h: "喀",
            v: "Khách"
        },
        {
            h: "慨",
            v: "Khái"
        },
        {
            h: "概",
            v: "Khái"
        },
        {
            h: "愾",
            v: "Khái"
        },
        {
            h: "咳",
            v: "Khái"
        },
        {
            h: "勘",
            v: "Khám"
        },
        {
            h: "看",
            v: "Khán"
        },
        {
            h: "抗",
            v: "Kháng"
        },
        {
            h: "伉",
            v: "Kháng"
        },
        {
            h: "慶",
            v: "Khánh"
        },
        {
            h: "恰",
            v: "Kháp"
        },
        {
            h: "渇",
            v: "Khát"
        },
        {
            h: "尻",
            v: "Khào"
        },
        {
            h: "可",
            v: "Khả"
        },
        {
            h: "啓",
            v: "Khải"
        },
        {
            h: "揩",
            v: "Khải"
        },
        {
            h: "鎧",
            v: "Khải"
        },
        {
            h: "凱",
            v: "Khải"
        },
        {
            h: "剴",
            v: "Khải"
        },
        {
            h: "豈",
            v: "Khải/Khởi"
        },
        {
            h: "坎",
            v: "Khảm"
        },
        {
            h: "凵",
            v: "Khảm"
        },
        {
            h: "嵌",
            v: "Khảm"
        },
        {
            h: "侃",
            v: "Khản"
        },
        {
            h: "慷",
            v: "Khảng"
        },
        {
            h: "考",
            v: "Khảo"
        },
        {
            h: "拷",
            v: "Khảo"
        },
        {
            h: "攷",
            v: "Khảo"
        },
        {
            h: "栲",
            v: "Khảo"
        },
        {
            h: "襟",
            v: "Khâm"
        },
        {
            h: "欽",
            v: "Khâm"
        },
        {
            h: "蚯",
            v: "Khâu"
        },
        {
            h: "丘",
            v: "Khâu/Khưu"
        },
        {
            h: "泣",
            v: "Khấp"
        },
        {
            h: "乞",
            v: "Khất"
        },
        {
            h: "扣",
            v: "Khấu"
        },
        {
            h: "寇",
            v: "Khấu"
        },
        {
            h: "冦",
            v: "Khấu"
        },
        {
            h: "叩",
            v: "Khấu"
        },
        {
            h: "釦",
            v: "Khấu"
        },
        {
            h: "緊",
            v: "Khẩn"
        },
        {
            h: "墾",
            v: "Khẩn"
        },
        {
            h: "懇",
            v: "Khẩn"
        },
        {
            h: "口",
            v: "Khẩu"
        },
        {
            h: "刻",
            v: "Khắc"
        },
        {
            h: "克",
            v: "Khắc"
        },
        {
            h: "剋",
            v: "Khắc"
        },
        {
            h: "尅",
            v: "Khắc"
        },
        {
            h: "肯",
            v: "Khẳng"
        },
        {
            h: "溪",
            v: "Khê"
        },
        {
            h: "渓",
            v: "Khê"
        },
        {
            h: "憩",
            v: "Khế"
        },
        {
            h: "憇",
            v: "Khế"
        },
        {
            h: "契",
            v: "Khế/Khiết"
        },
        {
            h: "欺",
            v: "Khi"
        },
        {
            h: "謙",
            v: "Khiêm"
        },
        {
            h: "愆",
            v: "Khiên"
        },
        {
            h: "搴",
            v: "Khiên"
        },
        {
            h: "牽",
            v: "Khiên"
        },
        {
            h: "跳",
            v: "Khiêu"
        },
        {
            h: "橇",
            v: "Khiêu"
        },
        {
            h: "欠",
            v: "Khiếm"
        },
        {
            h: "塹",
            v: "Khiếm"
        },
        {
            h: "怯",
            v: "Khiếp"
        },
        {
            h: "潔",
            v: "Khiết"
        },
        {
            h: "喫",
            v: "Khiết"
        },
        {
            h: "挈",
            v: "Khiết"
        },
        {
            h: "齧",
            v: "Khiết"
        },
        {
            h: "囓",
            v: "Khiết"
        },
        {
            h: "叫",
            v: "Khiếu"
        },
        {
            h: "嘯",
            v: "Khiếu"
        },
        {
            h: "歉",
            v: "Khiểm"
        },
        {
            h: "遣",
            v: "Khiển"
        },
        {
            h: "軽",
            v: "Khinh"
        },
        {
            h: "気",
            v: "Khí"
        },
        {
            h: "汽",
            v: "Khí"
        },
        {
            h: "棄",
            v: "Khí"
        },
        {
            h: "器",
            v: "Khí"
        },
        {
            h: "氣",
            v: "Khí"
        },
        {
            h: "噐",
            v: "Khí"
        },
        {
            h: "弃",
            v: "Khí"
        },
        {
            h: "气",
            v: "Khí/Khất"
        },
        {
            h: "激",
            v: "Khích/Kích"
        },
        {
            h: "科",
            v: "Khoa"
        },
        {
            h: "誇",
            v: "Khoa"
        },
        {
            h: "蝌",
            v: "Khoa"
        },
        {
            h: "寛",
            v: "Khoan"
        },
        {
            h: "快",
            v: "Khoái"
        },
        {
            h: "券",
            v: "Khoán"
        },
        {
            h: "椦",
            v: "Khoán"
        },
        {
            h: "劵",
            v: "Khoán"
        },
        {
            h: "鉱",
            v: "Khoáng"
        },
        {
            h: "曠",
            v: "Khoáng"
        },
        {
            h: "闊",
            v: "Khoát"
        },
        {
            h: "蛞",
            v: "Khoát"
        },
        {
            h: "款",
            v: "Khoản"
        },
        {
            h: "頃",
            v: "Khoảnh"
        },
        {
            h: "課",
            v: "Khóa"
        },
        {
            h: "裸",
            v: "Khỏa"
        },
        {
            h: "裹",
            v: "Khỏa/Lõa"
        },
        {
            h: "枯",
            v: "Khô"
        },
        {
            h: "桍",
            v: "Khô"
        },
        {
            h: "刳",
            v: "Khô"
        },
        {
            h: "恢",
            v: "Khôi"
        },
        {
            h: "坤",
            v: "Khôn"
        },
        {
            h: "倥",
            v: "Không"
        },
        {
            h: "啌",
            v: "Không"
        },
        {
            h: "空",
            v: "Không/Khống"
        },
        {
            h: "庫",
            v: "Khố"
        },
        {
            h: "袴",
            v: "Khố"
        },
        {
            h: "夸",
            v: "Khố"
        },
        {
            h: "酷",
            v: "Khốc"
        },
        {
            h: "哭",
            v: "Khốc"
        },
        {
            h: "塊",
            v: "Khối"
        },
        {
            h: "傀",
            v: "Khối/Ổi"
        },
        {
            h: "困",
            v: "Khốn"
        },
        {
            h: "悃",
            v: "Khốn"
        },
        {
            h: "控",
            v: "Khống"
        },
        {
            h: "苦",
            v: "Khổ"
        },
        {
            h: "梱",
            v: "Khổn"
        },
        {
            h: "壼",
            v: "Khổn"
        },
        {
            h: "孔",
            v: "Khổng"
        },
        {
            h: "起",
            v: "Khởi"
        },
        {
            h: "杞",
            v: "Khởi"
        },
        {
            h: "駆",
            v: "Khu"
        },
        {
            h: "区",
            v: "Khu"
        },
        {
            h: "區",
            v: "Khu"
        },
        {
            h: "嶇",
            v: "Khu"
        },
        {
            h: "屈",
            v: "Khuất/Quật"
        },
        {
            h: "菌",
            v: "Khuẩn"
        },
        {
            h: "圭",
            v: "Khuê"
        },
        {
            h: "奎",
            v: "Khuê"
        },
        {
            h: "硅",
            v: "Khuê"
        },
        {
            h: "珪",
            v: "Khuê"
        },
        {
            h: "拡",
            v: "Khuếch"
        },
        {
            h: "擴",
            v: "Khuếch"
        },
        {
            h: "廓",
            v: "Khuếch"
        },
        {
            h: "恚",
            v: "Khuể"
        },
        {
            h: "枠",
            v: "(Khung)"
        },
        {
            h: "匡",
            v: "Khuông"
        },
        {
            h: "框",
            v: "Khuông"
        },
        {
            h: "虧",
            v: "Khuy"
        },
        {
            h: "勧",
            v: "Khuyến"
        },
        {
            h: "勸",
            v: "Khuyến"
        },
        {
            h: "犬",
            v: "Khuyển"
        },
        {
            h: "傾",
            v: "Khuynh"
        },
        {
            h: "曲",
            v: "Khúc"
        },
        {
            h: "齲",
            v: "Khủ"
        },
        {
            h: "恐",
            v: "Khủng"
        },
        {
            h: "厶",
            v: "Khư/Tư"
        },
        {
            h: "却",
            v: "Khước"
        },
        {
            h: "去",
            v: "Khứ"
        },
        {
            h: "嗅",
            v: "Khứu"
        },
        {
            h: "兼",
            v: "Kiêm"
        },
        {
            h: "堅",
            v: "Kiên"
        },
        {
            h: "肩",
            v: "Kiên"
        },
        {
            h: "慳",
            v: "Kiên"
        },
        {
            h: "梟",
            v: "Kiêu"
        },
        {
            h: "驕",
            v: "Kiêu"
        },
        {
            h: "剣",
            v: "Kiếm"
        },
        {
            h: "劔",
            v: "Kiếm"
        },
        {
            h: "剱",
            v: "Kiếm"
        },
        {
            h: "劍",
            v: "Kiếm"
        },
        {
            h: "劒",
            v: "Kiếm"
        },
        {
            h: "見",
            v: "Kiến"
        },
        {
            h: "建",
            v: "Kiến"
        },
        {
            h: "俔",
            v: "Kiến"
        },
        {
            h: "刧",
            v: "Kiếp"
        },
        {
            h: "劫",
            v: "Kiếp"
        },
        {
            h: "戞",
            v: "Kiết"
        },
        {
            h: "拮",
            v: "Kiết"
        },
        {
            h: "戛",
            v: "Kiết"
        },
        {
            h: "拑",
            v: "Kiềm"
        },
        {
            h: "黔",
            v: "Kiềm"
        },
        {
            h: "橋",
            v: "Kiều"
        },
        {
            h: "僑",
            v: "Kiều"
        },
        {
            h: "喬",
            v: "Kiều"
        },
        {
            h: "蕎",
            v: "Kiều"
        },
        {
            h: "嬌",
            v: "Kiều"
        },
        {
            h: "翹",
            v: "Kiều/Khiêu"
        },
        {
            h: "検",
            v: "Kiểm"
        },
        {
            h: "檢",
            v: "Kiểm"
        },
        {
            h: "繭",
            v: "Kiển"
        },
        {
            h: "蹇",
            v: "Kiển"
        },
        {
            h: "矯",
            v: "Kiểu"
        },
        {
            h: "徼",
            v: "Kiểu/Khiếu"
        },
        {
            h: "倹",
            v: "Kiệm"
        },
        {
            h: "儉",
            v: "Kiệm"
        },
        {
            h: "件",
            v: "Kiện"
        },
        {
            h: "健",
            v: "Kiện"
        },
        {
            h: "鍵",
            v: "Kiện"
        },
        {
            h: "鋏",
            v: "Kiệp"
        },
        {
            h: "傑",
            v: "Kiệt"
        },
        {
            h: "杰",
            v: "Kiệt"
        },
        {
            h: "桀",
            v: "Kiệt"
        },
        {
            h: "今",
            v: "Kim"
        },
        {
            h: "金",
            v: "Kim"
        },
        {
            h: "衾",
            v: "Kim"
        },
        {
            h: "崟",
            v: "Kim"
        },
        {
            h: "経",
            v: "Kinh"
        },
        {
            h: "京",
            v: "Kinh"
        },
        {
            h: "驚",
            v: "Kinh"
        },
        {
            h: "痙",
            v: "Kinh"
        },
        {
            h: "剄",
            v: "Kinh"
        },
        {
            h: "荊",
            v: "Kinh"
        },
        {
            h: "徑",
            v: "Kinh/Kính"
        },
        {
            h: "撃",
            v: "Kích"
        },
        {
            h: "戟",
            v: "Kích"
        },
        {
            h: "鏡",
            v: "Kính"
        },
        {
            h: "径",
            v: "Kính"
        },
        {
            h: "敬",
            v: "Kính"
        },
        {
            h: "鯨",
            v: "Kình"
        },
        {
            h: "黥",
            v: "Kình"
        },
        {
            h: "勁",
            v: "Kình"
        },
        {
            h: "勍",
            v: "Kình"
        },
        {
            h: "騎",
            v: "Kị"
        },
        {
            h: "劇",
            v: "Kịch"
        },
        {
            h: "屐",
            v: "Kịch"
        },
        {
            h: "磯",
            v: "Ky"
        },
        {
            h: "羈",
            v: "Ky/Ki"
        },
        {
            h: "既",
            v: "Ký"
        },
        {
            h: "記",
            v: "Ký"
        },
        {
            h: "彑",
            v: "Ký"
        },
        {
            h: "旡",
            v: "Ký"
        },
        {
            h: "冀",
            v: "Ký"
        },
        {
            h: "碁",
            v: "Kỳ"
        },
        {
            h: "祈",
            v: "Kỳ"
        },
        {
            h: "期",
            v: "Kỳ"
        },
        {
            h: "奇",
            v: "Kỳ"
        },
        {
            h: "寄",
            v: "Kỳ"
        },
        {
            h: "岐",
            v: "Kỳ"
        },
        {
            h: "崎",
            v: "Kỳ"
        },
        {
            h: "旗",
            v: "Kỳ"
        },
        {
            h: "棋",
            v: "Kỳ"
        },
        {
            h: "埼",
            v: "Kỳ"
        },
        {
            h: "畿",
            v: "Kỳ"
        },
        {
            h: "棊",
            v: "Kỳ"
        },
        {
            h: "楳",
            v: "Kỳ"
        },
        {
            h: "鰭",
            v: "Kỳ"
        },
        {
            h: "其",
            v: "Kỳ"
        },
        {
            h: "剞",
            v: "Kỳ"
        },
        {
            h: "圻",
            v: "Kỳ"
        },
        {
            h: "嵜",
            v: "Kỳ"
        },
        {
            h: "紀",
            v: "Kỷ"
        },
        {
            h: "己",
            v: "Kỷ"
        },
        {
            h: "机",
            v: "Kỷ"
        },
        {
            h: "几",
            v: "Kỷ"
        },
        {
            h: "幾",
            v: "Kỷ/Ky"
        },
        {
            h: "椅",
            v: "Kỷ/Ỷ"
        },
        {
            h: "掎",
            v: "Kỷ/Ỷ/Ky"
        },
        {
            h: "技",
            v: "Kỹ"
        },
        {
            h: "伎",
            v: "Kỹ"
        },
        {
            h: "妓",
            v: "Kỹ"
        },
        {
            h: "忌",
            v: "Kỵ"
        },
        {
            h: "曁",
            v: "Kỵ"
        },
        {
            h: "羅",
            v: "La"
        },
        {
            h: "邏",
            v: "La"
        },
        {
            h: "来",
            v: "Lai"
        },
        {
            h: "來",
            v: "Lai"
        },
        {
            h: "徠",
            v: "Lai"
        },
        {
            h: "嵐",
            v: "Lam"
        },
        {
            h: "藍",
            v: "Lam"
        },
        {
            h: "儖",
            v: "Lam"
        },
        {
            h: "婪",
            v: "Lam"
        },
        {
            h: "欄",
            v: "Lan"
        },
        {
            h: "蘭",
            v: "Lan"
        },
        {
            h: "瀾",
            v: "Lan"
        },
        {
            h: "滝",
            v: "Lang"
        },
        {
            h: "郎",
            v: "Lang"
        },
        {
            h: "廊",
            v: "Lang"
        },
        {
            h: "榔",
            v: "Lang"
        },
        {
            h: "螂",
            v: "Lang"
        },
        {
            h: "竓",
            v: "(Lao)"
        },
        {
            h: "撈",
            v: "Lao"
        },
        {
            h: "牢",
            v: "Lao"
        },
        {
            h: "癆",
            v: "Lao"
        },
        {
            h: "労",
            v: "Lao/Lạo"
        },
        {
            h: "勞",
            v: "Lao/Lạo"
        },
        {
            h: "竡",
            v: "(Lách)"
        },
        {
            h: "咾",
            v: "(Láo)"
        },
        {
            h: "覧",
            v: "Lãm"
        },
        {
            h: "攬",
            v: "Lãm"
        },
        {
            h: "欖",
            v: "Lãm"
        },
        {
            h: "嬾",
            v: "Lãn"
        },
        {
            h: "懶",
            v: "Lãn/Lại"
        },
        {
            h: "浪",
            v: "Lãng"
        },
        {
            h: "朗",
            v: "Lãng"
        },
        {
            h: "冷",
            v: "Lãnh"
        },
        {
            h: "囹",
            v: "Lãnh/Linh"
        },
        {
            h: "領",
            v: "Lãnh/Lĩnh"
        },
        {
            h: "老",
            v: "Lão"
        },
        {
            h: "絡",
            v: "Lạc"
        },
        {
            h: "落",
            v: "Lạc"
        },
        {
            h: "酪",
            v: "Lạc"
        },
        {
            h: "擽",
            v: "Lạc"
        },
        {
            h: "樂",
            v: "Lạc"
        },
        {
            h: "洛",
            v: "Lạc"
        },
        {
            h: "楽",
            v: "Lạc/Nhạc"
        },
        {
            h: "瀬",
            v: "Lại"
        },
        {
            h: "頼",
            v: "Lại"
        },
        {
            h: "吏",
            v: "Lại"
        },
        {
            h: "癩",
            v: "Lại"
        },
        {
            h: "濫",
            v: "Lạm"
        },
        {
            h: "燗",
            v: "Lạn"
        },
        {
            h: "爛",
            v: "Lạn"
        },
        {
            h: "粒",
            v: "Lạp"
        },
        {
            h: "拉",
            v: "Lạp"
        },
        {
            h: "剌",
            v: "Lạt"
        },
        {
            h: "辣",
            v: "Lạt"
        },
        {
            h: "喇",
            v: "Lạt"
        },
        {
            h: "臨",
            v: "Lâm"
        },
        {
            h: "林",
            v: "Lâm"
        },
        {
            h: "痳",
            v: "Lâm"
        },
        {
            h: "淋",
            v: "Lâm"
        },
        {
            h: "隣",
            v: "Lân"
        },
        {
            h: "竕",
            v: "(Lân)"
        },
        {
            h: "憐",
            v: "Lân"
        },
        {
            h: "燐",
            v: "Lân"
        },
        {
            h: "楼",
            v: "Lâu"
        },
        {
            h: "樓",
            v: "Lâu"
        },
        {
            h: "瘻",
            v: "Lâu"
        },
        {
            h: "螻",
            v: "Lâu"
        },
        {
            h: "婁",
            v: "Lâu"
        },
        {
            h: "僂",
            v: "Lâu/Lu"
        },
        {
            h: "懍",
            v: "Lẫm"
        },
        {
            h: "凜",
            v: "Lẫm"
        },
        {
            h: "凛",
            v: "Lẫm"
        },
        {
            h: "廩",
            v: "Lẫm"
        },
        {
            h: "悋",
            v: "Lận"
        },
        {
            h: "吝",
            v: "Lận"
        },
        {
            h: "立",
            v: "Lập"
        },
        {
            h: "竍",
            v: "(Lập)"
        },
        {
            h: "栗",
            v: "Lật"
        },
        {
            h: "慄",
            v: "Lật"
        },
        {
            h: "漏",
            v: "Lậu"
        },
        {
            h: "陵",
            v: "Lăng"
        },
        {
            h: "菱",
            v: "Lăng"
        },
        {
            h: "綾",
            v: "Lăng"
        },
        {
            h: "楞",
            v: "Lăng"
        },
        {
            h: "凌",
            v: "Lăng"
        },
        {
            h: "稜",
            v: "Lăng"
        },
        {
            h: "崚",
            v: "Lăng"
        },
        {
            h: "黎",
            v: "Lê"
        },
        {
            h: "梨",
            v: "Lê"
        },
        {
            h: "礼",
            v: "Lễ"
        },
        {
            h: "涙",
            v: "Lệ"
        },
        {
            h: "隷",
            v: "Lệ"
        },
        {
            h: "麗",
            v: "Lệ"
        },
        {
            h: "戻",
            v: "Lệ"
        },
        {
            h: "励",
            v: "Lệ"
        },
        {
            h: "捩",
            v: "Lệ"
        },
        {
            h: "癧",
            v: "Lệ"
        },
        {
            h: "癘",
            v: "Lệ"
        },
        {
            h: "儷",
            v: "Lệ"
        },
        {
            h: "勵",
            v: "Lệ"
        },
        {
            h: "唳",
            v: "Lệ"
        },
        {
            h: "棣",
            v: "Lệ/Đại/Thế"
        },
        {
            h: "令",
            v: "Lệnh"
        },
        {
            h: "廉",
            v: "Liêm"
        },
        {
            h: "鎌",
            v: "Liêm"
        },
        {
            h: "奩",
            v: "Liêm"
        },
        {
            h: "簾",
            v: "Liêm"
        },
        {
            h: "匳",
            v: "Liêm"
        },
        {
            h: "連",
            v: "Liên"
        },
        {
            h: "竏",
            v: "(Liên)"
        },
        {
            h: "蓮",
            v: "Liên"
        },
        {
            h: "聯",
            v: "Liên"
        },
        {
            h: "嗹",
            v: "Liên"
        },
        {
            h: "僚",
            v: "Liêu"
        },
        {
            h: "寮",
            v: "Liêu"
        },
        {
            h: "遼",
            v: "Liêu"
        },
        {
            h: "撩",
            v: "Liêu"
        },
        {
            h: "廖",
            v: "Liêu"
        },
        {
            h: "寥",
            v: "Liêu"
        },
        {
            h: "歛",
            v: "Liễm"
        },
        {
            h: "斂",
            v: "Liễm/Liệm"
        },
        {
            h: "了",
            v: "Liễu"
        },
        {
            h: "柳",
            v: "Liễu"
        },
        {
            h: "猟",
            v: "Liệp"
        },
        {
            h: "烈",
            v: "Liệt"
        },
        {
            h: "裂",
            v: "Liệt"
        },
        {
            h: "例",
            v: "Liệt"
        },
        {
            h: "劣",
            v: "Liệt"
        },
        {
            h: "列",
            v: "Liệt"
        },
        {
            h: "洌",
            v: "Liệt"
        },
        {
            h: "冽",
            v: "Liệt"
        },
        {
            h: "埓",
            v: "Liệt/Lạt"
        },
        {
            h: "埒",
            v: "Liệt/Lạt"
        },
        {
            h: "療",
            v: "Liệu"
        },
        {
            h: "料",
            v: "Liệu"
        },
        {
            h: "鈴",
            v: "Linh"
        },
        {
            h: "零",
            v: "Linh"
        },
        {
            h: "霊",
            v: "Linh"
        },
        {
            h: "齢",
            v: "Linh"
        },
        {
            h: "伶",
            v: "Linh"
        },
        {
            h: "怜",
            v: "Linh"
        },
        {
            h: "玲",
            v: "Linh"
        },
        {
            h: "櫺",
            v: "Linh"
        },
        {
            h: "蛉",
            v: "Linh"
        },
        {
            h: "齡",
            v: "Linh"
        },
        {
            h: "嶺",
            v: "Lĩnh"
        },
        {
            h: "暦",
            v: "Lịch"
        },
        {
            h: "歴",
            v: "Lịch"
        },
        {
            h: "櫟",
            v: "Lịch"
        },
        {
            h: "櫪",
            v: "Lịch"
        },
        {
            h: "轢",
            v: "Lịch"
        },
        {
            h: "礫",
            v: "Lịch"
        },
        {
            h: "螺",
            v: "Loa"
        },
        {
            h: "瘰",
            v: "Loa"
        },
        {
            h: "湾",
            v: "Loan"
        },
        {
            h: "攣",
            v: "Loan"
        },
        {
            h: "欒",
            v: "Loan"
        },
        {
            h: "鸞",
            v: "Loan"
        },
        {
            h: "灣",
            v: "Loan"
        },
        {
            h: "巒",
            v: "Loan"
        },
        {
            h: "弯",
            v: "Loan"
        },
        {
            h: "彎",
            v: "Loan"
        },
        {
            h: "刷",
            v: "Loát"
        },
        {
            h: "類",
            v: "Loại"
        },
        {
            h: "乱",
            v: "Loạn"
        },
        {
            h: "亂",
            v: "Loạn"
        },
        {
            h: "隆",
            v: "Long"
        },
        {
            h: "竜",
            v: "Long"
        },
        {
            h: "嶐",
            v: "Long"
        },
        {
            h: "龍",
            v: "Long/Sủng"
        },
        {
            h: "夥",
            v: "Lõa"
        },
        {
            h: "炉",
            v: "Lô"
        },
        {
            h: "櫨",
            v: "Lô"
        },
        {
            h: "蘆",
            v: "Lô"
        },
        {
            h: "瀘",
            v: "Lô"
        },
        {
            h: "鑢",
            v: "Lô"
        },
        {
            h: "雷",
            v: "Lôi"
        },
        {
            h: "擂",
            v: "Lôi"
        },
        {
            h: "虜",
            v: "Lỗ"
        },
        {
            h: "櫓",
            v: "Lỗ"
        },
        {
            h: "鹵",
            v: "Lỗ"
        },
        {
            h: "儡",
            v: "Lỗi"
        },
        {
            h: "路",
            v: "Lộ"
        },
        {
            h: "露",
            v: "Lộ"
        },
        {
            h: "蕗",
            v: "Lộ"
        },
        {
            h: "鷺",
            v: "Lộ"
        },
        {
            h: "禄",
            v: "Lộc"
        },
        {
            h: "鹿",
            v: "Lộc"
        },
        {
            h: "麓",
            v: "Lộc"
        },
        {
            h: "哢",
            v: "Lộng"
        },
        {
            h: "弄",
            v: "Lộng"
        },
        {
            h: "利",
            v: "Lợi"
        },
        {
            h: "悧",
            v: "Lợi"
        },
        {
            h: "俐",
            v: "Lợi"
        },
        {
            h: "輪",
            v: "Luân"
        },
        {
            h: "倫",
            v: "Luân"
        },
        {
            h: "侖",
            v: "Luân"
        },
        {
            h: "崘",
            v: "Luân"
        },
        {
            h: "崙",
            v: "Luân"
        },
        {
            h: "論",
            v: "Luận"
        },
        {
            h: "律",
            v: "Luật"
        },
        {
            h: "瓏",
            v: "Lung"
        },
        {
            h: "聾",
            v: "Lung"
        },
        {
            h: "籠",
            v: "Lung"
        },
        {
            h: "羸",
            v: "Luy"
        },
        {
            h: "恋",
            v: "Luyến"
        },
        {
            h: "戀",
            v: "Luyến"
        },
        {
            h: "練",
            v: "Luyện"
        },
        {
            h: "錬",
            v: "Luyện"
        },
        {
            h: "楝",
            v: "Luyện"
        },
        {
            h: "煉",
            v: "Luyện"
        },
        {
            h: "屡",
            v: "Lũ"
        },
        {
            h: "壟",
            v: "Lũng"
        },
        {
            h: "累",
            v: "Lũy"
        },
        {
            h: "塁",
            v: "Lũy"
        },
        {
            h: "六",
            v: "Lục"
        },
        {
            h: "緑",
            v: "Lục"
        },
        {
            h: "録",
            v: "Lục"
        },
        {
            h: "陸",
            v: "Lục"
        },
        {
            h: "戮",
            v: "Lục"
        },
        {
            h: "勠",
            v: "Lục"
        },
        {
            h: "枦",
            v: "Lư"
        },
        {
            h: "櫚",
            v: "Lư"
        },
        {
            h: "驢",
            v: "Lư"
        },
        {
            h: "顱",
            v: "Lư"
        },
        {
            h: "廬",
            v: "Lư"
        },
        {
            h: "涼",
            v: "Lương"
        },
        {
            h: "良",
            v: "Lương"
        },
        {
            h: "梁",
            v: "Lương"
        },
        {
            h: "凉",
            v: "Lương"
        },
        {
            h: "倆",
            v: "Lưỡng"
        },
        {
            h: "両",
            v: "Lưỡng/Lượng"
        },
        {
            h: "兩",
            v: "Lưỡng/Lượng"
        },
        {
            h: "略",
            v: "Lược"
        },
        {
            h: "掠",
            v: "Lược"
        },
        {
            h: "糧",
            v: "Lượng"
        },
        {
            h: "量",
            v: "Lượng"
        },
        {
            h: "諒",
            v: "Lượng"
        },
        {
            h: "亮",
            v: "Lượng"
        },
        {
            h: "魎",
            v: "Lượng"
        },
        {
            h: "喨",
            v: "Lượng"
        },
        {
            h: "流",
            v: "Lưu"
        },
        {
            h: "留",
            v: "Lưu"
        },
        {
            h: "硫",
            v: "Lưu"
        },
        {
            h: "劉",
            v: "Lưu"
        },
        {
            h: "瑠",
            v: "Lưu"
        },
        {
            h: "旒",
            v: "Lưu"
        },
        {
            h: "琉",
            v: "Lưu"
        },
        {
            h: "嚠",
            v: "Lưu"
        },
        {
            h: "旅",
            v: "Lữ"
        },
        {
            h: "呂",
            v: "Lữ"
        },
        {
            h: "梠",
            v: "Lữ"
        },
        {
            h: "侶",
            v: "Lữ"
        },
        {
            h: "慮",
            v: "Lự"
        },
        {
            h: "濾",
            v: "Lự"
        },
        {
            h: "力",
            v: "Lực"
        },
        {
            h: "溜",
            v: "Lựu"
        },
        {
            h: "榴",
            v: "Lựu"
        },
        {
            h: "瘤",
            v: "Lựu"
        },
        {
            h: "離",
            v: "Ly"
        },
        {
            h: "竰",
            v: "(Ly)"
        },
        {
            h: "璃",
            v: "Ly"
        },
        {
            h: "罹",
            v: "Ly"
        },
        {
            h: "狸",
            v: "Ly"
        },
        {
            h: "釐",
            v: "Ly/Hy"
        },
        {
            h: "厘",
            v: "Ly/Li"
        },
        {
            h: "籬",
            v: "Ly/Li"
        },
        {
            h: "漓",
            v: "Ly/Li"
        },
        {
            h: "理",
            v: "Lý"
        },
        {
            h: "裏",
            v: "Lý"
        },
        {
            h: "里",
            v: "Lý"
        },
        {
            h: "履",
            v: "Lý"
        },
        {
            h: "鯉",
            v: "Lý"
        },
        {
            h: "李",
            v: "Lý"
        },
        {
            h: "俚",
            v: "Lý"
        },
        {
            h: "哩",
            v: "Lý"
        },
        {
            h: "裡",
            v: "Lý"
        },
        {
            h: "浬",
            v: "Lý/Lí"
        },
        {
            h: "痢",
            v: "Lỵ"
        },
        {
            h: "莉",
            v: "Lỵ"
        },
        {
            h: "蜊",
            v: "Lỵ/Lị"
        },
        {
            h: "鯏",
            v: "Lỵ/Lị"
        },
        {
            h: "詈",
            v: "Lỵ/Lị"
        },
        {
            h: "麻",
            v: "Ma"
        },
        {
            h: "摩",
            v: "Ma"
        },
        {
            h: "磨",
            v: "Ma"
        },
        {
            h: "魔",
            v: "Ma"
        },
        {
            h: "麿",
            v: "Ma"
        },
        {
            h: "痲",
            v: "Ma"
        },
        {
            h: "嘛",
            v: "Ma"
        },
        {
            h: "埋",
            v: "Mai"
        },
        {
            h: "枚",
            v: "Mai"
        },
        {
            h: "梅",
            v: "Mai"
        },
        {
            h: "蛮",
            v: "Man"
        },
        {
            h: "曼",
            v: "Man"
        },
        {
            h: "鰻",
            v: "Man"
        },
        {
            h: "忙",
            v: "Mang"
        },
        {
            h: "茫",
            v: "Mang"
        },
        {
            h: "厖",
            v: "Mang"
        },
        {
            h: "尨",
            v: "Mang/Mông"
        },
        {
            h: "盲",
            v: "Manh"
        },
        {
            h: "萌",
            v: "Manh"
        },
        {
            h: "氓",
            v: "Manh"
        },
        {
            h: "毛",
            v: "Mao"
        },
        {
            h: "粍",
            v: "(Mao)"
        },
        {
            h: "旄",
            v: "Mao"
        },
        {
            h: "茅",
            v: "Mao"
        },
        {
            h: "媽",
            v: "Má"
        },
        {
            h: "粨",
            v: "(Mách)"
        },
        {
            h: "馬",
            v: "Mã"
        },
        {
            h: "買",
            v: "Mãi"
        },
        {
            h: "満",
            v: "Mãn"
        },
        {
            h: "蟒",
            v: "Mãng"
        },
        {
            h: "猛",
            v: "Mãnh"
        },
        {
            h: "皿",
            v: "Mãnh"
        },
        {
            h: "黽",
            v: "Mãnh/Mẫn"
        },
        {
            h: "卯",
            v: "Mão"
        },
        {
            h: "昴",
            v: "Mão"
        },
        {
            h: "夘",
            v: "Mão"
        },
        {
            h: "罵",
            v: "Mạ"
        },
        {
            h: "漠",
            v: "Mạc"
        },
        {
            h: "幕",
            v: "Mạc"
        },
        {
            h: "寞",
            v: "Mạc"
        },
        {
            h: "脈",
            v: "Mạch"
        },
        {
            h: "麦",
            v: "Mạch"
        },
        {
            h: "売",
            v: "Mại"
        },
        {
            h: "邁",
            v: "Mại"
        },
        {
            h: "賣",
            v: "Mại"
        },
        {
            h: "慢",
            v: "Mạn"
        },
        {
            h: "蔓",
            v: "Mạn"
        },
        {
            h: "幔",
            v: "Mạn"
        },
        {
            h: "漫",
            v: "Mạn/Man"
        },
        {
            h: "孟",
            v: "Mạnh"
        },
        {
            h: "帽",
            v: "Mạo"
        },
        {
            h: "貌",
            v: "Mạo"
        },
        {
            h: "耄",
            v: "Mạo"
        },
        {
            h: "冒",
            v: "Mạo/Mặc"
        },
        {
            h: "抹",
            v: "Mạt"
        },
        {
            h: "末",
            v: "Mạt"
        },
        {
            h: "茉",
            v: "Mạt"
        },
        {
            h: "沫",
            v: "Mạt"
        },
        {
            h: "岷",
            v: "Mân"
        },
        {
            h: "矛",
            v: "Mâu"
        },
        {
            h: "眸",
            v: "Mâu"
        },
        {
            h: "牟",
            v: "Mâu"
        },
        {
            h: "敏",
            v: "Mẫn"
        },
        {
            h: "旻",
            v: "Mẫn"
        },
        {
            h: "愍",
            v: "Mẫn"
        },
        {
            h: "憫",
            v: "Mẫn"
        },
        {
            h: "泯",
            v: "Mẫn/Dân/Miến"
        },
        {
            h: "母",
            v: "Mẫu"
        },
        {
            h: "畝",
            v: "Mẫu"
        },
        {
            h: "牡",
            v: "Mẫu"
        },
        {
            h: "拇",
            v: "Mẫu"
        },
        {
            h: "姆",
            v: "Mẫu"
        },
        {
            h: "籵",
            v: "(Mập)"
        },
        {
            h: "密",
            v: "Mật"
        },
        {
            h: "蜜",
            v: "Mật"
        },
        {
            h: "茂",
            v: "Mậu"
        },
        {
            h: "貿",
            v: "Mậu"
        },
        {
            h: "戊",
            v: "Mậu"
        },
        {
            h: "懋",
            v: "Mậu"
        },
        {
            h: "袤",
            v: "Mậu"
        },
        {
            h: "楙",
            v: "Mậu"
        },
        {
            h: "黙",
            v: "Mặc"
        },
        {
            h: "墨",
            v: "Mặc"
        },
        {
            h: "默",
            v: "Mặc"
        },
        {
            h: "迷",
            v: "Mê"
        },
        {
            h: "謎",
            v: "Mê"
        },
        {
            h: "〆",
            v: "(Mê)"
        },
        {
            h: "米",
            v: "Mễ"
        },
        {
            h: "命",
            v: "Mệnh"
        },
        {
            h: "眉",
            v: "Mi"
        },
        {
            h: "嵋",
            v: "Mi"
        },
        {
            h: "麼",
            v: "Mi"
        },
        {
            h: "麋",
            v: "Mi"
        },
        {
            h: "眠",
            v: "Miên"
        },
        {
            h: "綿",
            v: "Miên"
        },
        {
            h: "粁",
            v: "(Miên)"
        },
        {
            h: "棉",
            v: "Miên"
        },
        {
            h: "宀",
            v: "Miên"
        },
        {
            h: "猫",
            v: "Miêu"
        },
        {
            h: "苗",
            v: "Miêu"
        },
        {
            h: "描",
            v: "Miêu"
        },
        {
            h: "錨",
            v: "Miêu"
        },
        {
            h: "麺",
            v: "Miến"
        },
        {
            h: "緬",
            v: "Miến"
        },
        {
            h: "鼈",
            v: "Miết"
        },
        {
            h: "廟",
            v: "Miếu"
        },
        {
            h: "秒",
            v: "Miểu"
        },
        {
            h: "杪",
            v: "Miểu"
        },
        {
            h: "勉",
            v: "Miễn"
        },
        {
            h: "免",
            v: "Miễn"
        },
        {
            h: "俛",
            v: "Miễn"
        },
        {
            h: "娩",
            v: "Miễn"
        },
        {
            h: "冕",
            v: "Miện"
        },
        {
            h: "盟",
            v: "Minh"
        },
        {
            h: "銘",
            v: "Minh"
        },
        {
            h: "鳴",
            v: "Minh"
        },
        {
            h: "明",
            v: "Minh"
        },
        {
            h: "暝",
            v: "Minh"
        },
        {
            h: "螟",
            v: "Minh"
        },
        {
            h: "冥",
            v: "Minh"
        },
        {
            h: "魅",
            v: "Mị"
        },
        {
            h: "黴",
            v: "Mị"
        },
        {
            h: "靡",
            v: "Mị"
        },
        {
            h: "媚",
            v: "Mị"
        },
        {
            h: "寐",
            v: "Mị"
        },
        {
            h: "糸",
            v: "Mịch"
        },
        {
            h: "冖",
            v: "Mịch"
        },
        {
            h: "冪",
            v: "Mịch"
        },
        {
            h: "汨",
            v: "Mịch/Cốt"
        },
        {
            h: "膜",
            v: "Mô"
        },
        {
            h: "模",
            v: "Mô"
        },
        {
            h: "蟇",
            v: "Mô"
        },
        {
            h: "蟆",
            v: "Mô"
        },
        {
            h: "摸",
            v: "Mô"
        },
        {
            h: "媒",
            v: "Môi"
        },
        {
            h: "門",
            v: "Môn"
        },
        {
            h: "捫",
            v: "Môn"
        },
        {
            h: "們",
            v: "Môn"
        },
        {
            h: "曚",
            v: "Mông"
        },
        {
            h: "蒙",
            v: "Mông"
        },
        {
            h: "檬",
            v: "Mông"
        },
        {
            h: "某",
            v: "Mỗ"
        },
        {
            h: "毎",
            v: "Mỗi"
        },
        {
            h: "募",
            v: "Mộ"
        },
        {
            h: "墓",
            v: "Mộ"
        },
        {
            h: "慕",
            v: "Mộ"
        },
        {
            h: "暮",
            v: "Mộ"
        },
        {
            h: "木",
            v: "Mộc"
        },
        {
            h: "杢",
            v: "Mộc"
        },
        {
            h: "沐",
            v: "Mộc"
        },
        {
            h: "夢",
            v: "Mộng"
        },
        {
            h: "梦",
            v: "Mộng"
        },
        {
            h: "儚",
            v: "Mộng"
        },
        {
            h: "没",
            v: "Một"
        },
        {
            h: "歿",
            v: "Một"
        },
        {
            h: "沒",
            v: "Một"
        },
        {
            h: "妹",
            v: "Muội"
        },
        {
            h: "昧",
            v: "Muội"
        },
        {
            h: "悶",
            v: "Muộn"
        },
        {
            h: "懣",
            v: "Muộn"
        },
        {
            h: "匂",
            v: "(Mùi)"
        },
        {
            h: "姥",
            v: "Mụ"
        },
        {
            h: "牧",
            v: "Mục"
        },
        {
            h: "目",
            v: "Mục"
        },
        {
            h: "睦",
            v: "Mục"
        },
        {
            h: "謀",
            v: "Mưu"
        },
        {
            h: "美",
            v: "Mỹ"
        },
        {
            h: "那",
            v: "Na"
        },
        {
            h: "梛",
            v: "Na"
        },
        {
            h: "儺",
            v: "Na"
        },
        {
            h: "娜",
            v: "Na"
        },
        {
            h: "男",
            v: "Nam"
        },
        {
            h: "南",
            v: "Nam"
        },
        {
            h: "喃",
            v: "Nam"
        },
        {
            h: "楠",
            v: "Nam"
        },
        {
            h: "娚",
            v: "Nam"
        },
        {
            h: "嚢",
            v: "Nang"
        },
        {
            h: "呶",
            v: "Nao"
        },
        {
            h: "捏",
            v: "Nát"
        },
        {
            h: "拏",
            v: "Nã"
        },
        {
            h: "拿",
            v: "Nã"
        },
        {
            h: "廼",
            v: "Nãi"
        },
        {
            h: "迺",
            v: "Nãi"
        },
        {
            h: "乃",
            v: "Nãi/Ái"
        },
        {
            h: "脳",
            v: "Não"
        },
        {
            h: "悩",
            v: "Não"
        },
        {
            h: "惱",
            v: "Não"
        },
        {
            h: "耐",
            v: "Nại"
        },
        {
            h: "奈",
            v: "Nại"
        },
        {
            h: "捺",
            v: "Nại"
        },
        {
            h: "難",
            v: "Nạn/Nan"
        },
        {
            h: "撓",
            v: "Nạo"
        },
        {
            h: "納",
            v: "Nạp"
        },
        {
            h: "能",
            v: "Năng"
        },
        {
            h: "曩",
            v: "Nẵng"
        },
        {
            h: "諾",
            v: "Nặc"
        },
        {
            h: "匿",
            v: "Nặc"
        },
        {
            h: "慝",
            v: "Nặc"
        },
        {
            h: "昵",
            v: "Nặc"
        },
        {
            h: "泥",
            v: "Nê"
        },
        {
            h: "嶬",
            v: "Nga"
        },
        {
            h: "俄",
            v: "Nga"
        },
        {
            h: "哦",
            v: "Nga"
        },
        {
            h: "娥",
            v: "Nga"
        },
        {
            h: "峩",
            v: "Nga"
        },
        {
            h: "峨",
            v: "Nga"
        },
        {
            h: "蛾",
            v: "Nga/Nghĩ"
        },
        {
            h: "昮",
            v: "Ngang"
        },
        {
            h: "昂",
            v: "Ngang"
        },
        {
            h: "瓱",
            v: "(Ngao)"
        },
        {
            h: "鼇",
            v: "Ngao"
        },
        {
            h: "螯",
            v: "Ngao"
        },
        {
            h: "嗷",
            v: "Ngao"
        },
        {
            h: "敖",
            v: "Ngao/Ngạo"
        },
        {
            h: "瓸",
            v: "(Ngách)"
        },
        {
            h: "冴",
            v: "Ngà"
        },
        {
            h: "刈",
            v: "Ngải"
        },
        {
            h: "我",
            v: "Ngã"
        },
        {
            h: "餓",
            v: "Ngạ"
        },
        {
            h: "愕",
            v: "Ngạc"
        },
        {
            h: "鰐",
            v: "Ngạc"
        },
        {
            h: "顎",
            v: "Ngạc"
        },
        {
            h: "齶",
            v: "Ngạc"
        },
        {
            h: "諤",
            v: "Ngạc"
        },
        {
            h: "咢",
            v: "Ngạc"
        },
        {
            h: "額",
            v: "Ngạch"
        },
        {
            h: "岸",
            v: "Ngạn"
        },
        {
            h: "諺",
            v: "Ngạn"
        },
        {
            h: "彦",
            v: "Ngạn"
        },
        {
            h: "偐",
            v: "Ngạn"
        },
        {
            h: "硬",
            v: "Ngạnh"
        },
        {
            h: "梗",
            v: "Ngạnh"
        },
        {
            h: "傲",
            v: "Ngạo"
        },
        {
            h: "歹",
            v: "Ngạt/Đãi"
        },
        {
            h: "吟",
            v: "Ngâm"
        },
        {
            h: "銀",
            v: "Ngân"
        },
        {
            h: "瓰",
            v: "(Ngân)"
        },
        {
            h: "痕",
            v: "Ngân"
        },
        {
            h: "齦",
            v: "Ngân/Khẩn"
        },
        {
            h: "垠",
            v: "Ngần"
        },
        {
            h: "偶",
            v: "Ngẫu"
        },
        {
            h: "憖",
            v: "Ngận"
        },
        {
            h: "瓧",
            v: "(Ngập)"
        },
        {
            h: "岌",
            v: "Ngập"
        },
        {
            h: "屹",
            v: "Ngật"
        },
        {
            h: "吃",
            v: "Ngật/Cật"
        },
        {
            h: "猊",
            v: "Nghê"
        },
        {
            h: "倪",
            v: "Nghê"
        },
        {
            h: "迎",
            v: "Nghênh/Nghinh"
        },
        {
            h: "芸",
            v: "Nghệ"
        },
        {
            h: "乂",
            v: "Nghệ"
        },
        {
            h: "囈",
            v: "Nghệ"
        },
        {
            h: "詣",
            v: "Nghệ"
        },
        {
            h: "儀",
            v: "Nghi"
        },
        {
            h: "疑",
            v: "Nghi"
        },
        {
            h: "宜",
            v: "Nghi"
        },
        {
            h: "嶷",
            v: "Nghi"
        },
        {
            h: "沂",
            v: "Nghi/Ngân"
        },
        {
            h: "厳",
            v: "Nghiêm"
        },
        {
            h: "嚴",
            v: "Nghiêm"
        },
        {
            h: "研",
            v: "Nghiên"
        },
        {
            h: "瓩",
            v: "(Nghiên)"
        },
        {
            h: "妍",
            v: "Nghiên"
        },
        {
            h: "尭",
            v: "Nghiêu"
        },
        {
            h: "僥",
            v: "Nghiêu"
        },
        {
            h: "堯",
            v: "Nghiêu"
        },
        {
            h: "嶢",
            v: "Nghiêu"
        },
        {
            h: "儼",
            v: "Nghiễm"
        },
        {
            h: "广",
            v: "Nghiễm"
        },
        {
            h: "験",
            v: "Nghiệm"
        },
        {
            h: "業",
            v: "Nghiệp"
        },
        {
            h: "擬",
            v: "Nghĩ"
        },
        {
            h: "義",
            v: "Nghĩa"
        },
        {
            h: "議",
            v: "Nghị"
        },
        {
            h: "誼",
            v: "Nghị"
        },
        {
            h: "毅",
            v: "Nghị"
        },
        {
            h: "蟻",
            v: "Nghị"
        },
        {
            h: "逆",
            v: "Nghịch"
        },
        {
            h: "靴",
            v: "Ngoa"
        },
        {
            h: "頑",
            v: "Ngoan"
        },
        {
            h: "外",
            v: "Ngoại"
        },
        {
            h: "玩",
            v: "Ngoạn"
        },
        {
            h: "甅",
            v: "(Ngoi)"
        },
        {
            h: "吽",
            v: "(Ngỏ)"
        },
        {
            h: "瓦",
            v: "Ngõa"
        },
        {
            h: "午",
            v: "Ngọ"
        },
        {
            h: "臥",
            v: "Ngọa"
        },
        {
            h: "玉",
            v: "Ngọc"
        },
        {
            h: "呉",
            v: "Ngô"
        },
        {
            h: "吾",
            v: "Ngô"
        },
        {
            h: "梧",
            v: "Ngô"
        },
        {
            h: "蜈",
            v: "Ngô"
        },
        {
            h: "麌",
            v: "Ngô"
        },
        {
            h: "鮠",
            v: "Ngôi/Nguy"
        },
        {
            h: "嵬",
            v: "Ngôi/Nguy"
        },
        {
            h: "言",
            v: "Ngôn"
        },
        {
            h: "禿",
            v: "Ngốc"
        },
        {
            h: "呆",
            v: "Ngốc/Ngai"
        },
        {
            h: "忤",
            v: "Ngỗ"
        },
        {
            h: "誤",
            v: "Ngộ"
        },
        {
            h: "遇",
            v: "Ngộ"
        },
        {
            h: "悟",
            v: "Ngộ"
        },
        {
            h: "晤",
            v: "Ngộ"
        },
        {
            h: "唔",
            v: "Ngộ"
        },
        {
            h: "寤",
            v: "Ngộ"
        },
        {
            h: "兀",
            v: "Ngột"
        },
        {
            h: "虞",
            v: "Ngu"
        },
        {
            h: "娯",
            v: "Ngu"
        },
        {
            h: "愚",
            v: "Ngu"
        },
        {
            h: "嵎",
            v: "Ngung/Ngu"
        },
        {
            h: "危",
            v: "Nguy"
        },
        {
            h: "巍",
            v: "Nguy"
        },
        {
            h: "源",
            v: "Nguyên"
        },
        {
            h: "元",
            v: "Nguyên"
        },
        {
            h: "原",
            v: "Nguyên"
        },
        {
            h: "阮",
            v: "Nguyễn"
        },
        {
            h: "願",
            v: "Nguyện"
        },
        {
            h: "愿",
            v: "Nguyện"
        },
        {
            h: "月",
            v: "Nguyệt"
        },
        {
            h: "五",
            v: "Ngũ"
        },
        {
            h: "伍",
            v: "Ngũ"
        },
        {
            h: "寓",
            v: "Ngụ"
        },
        {
            h: "獄",
            v: "Ngục"
        },
        {
            h: "偽",
            v: "Ngụy"
        },
        {
            h: "魏",
            v: "Ngụy"
        },
        {
            h: "僞",
            v: "Ngụy"
        },
        {
            h: "詭",
            v: "Ngụy"
        },
        {
            h: "漁",
            v: "Ngư"
        },
        {
            h: "魚",
            v: "Ngư"
        },
        {
            h: "凝",
            v: "Ngưng"
        },
        {
            h: "仰",
            v: "Ngưỡng"
        },
        {
            h: "虐",
            v: "Ngược"
        },
        {
            h: "瘧",
            v: "Ngược"
        },
        {
            h: "牛",
            v: "Ngưu"
        },
        {
            h: "語",
            v: "Ngữ"
        },
        {
            h: "齬",
            v: "Ngữ"
        },
        {
            h: "圄",
            v: "Ngữ"
        },
        {
            h: "御",
            v: "Ngự"
        },
        {
            h: "芽",
            v: "Nha"
        },
        {
            h: "衙",
            v: "Nha"
        },
        {
            h: "椏",
            v: "Nha"
        },
        {
            h: "牙",
            v: "Nha"
        },
        {
            h: "呀",
            v: "Nha"
        },
        {
            h: "涯",
            v: "Nhai"
        },
        {
            h: "街",
            v: "Nhai"
        },
        {
            h: "啀",
            v: "Nhai"
        },
        {
            h: "崖",
            v: "Nhai"
        },
        {
            h: "崕",
            v: "Nhai"
        },
        {
            h: "岩",
            v: "Nham"
        },
        {
            h: "巌",
            v: "Nham"
        },
        {
            h: "癌",
            v: "Nham"
        },
        {
            h: "嵒",
            v: "Nham"
        },
        {
            h: "巖",
            v: "Nham"
        },
        {
            h: "顔",
            v: "Nhan"
        },
        {
            h: "閑",
            v: "Nhàn"
        },
        {
            h: "癇",
            v: "Nhàn"
        },
        {
            h: "嫻",
            v: "Nhàn"
        },
        {
            h: "嫺",
            v: "Nhàn"
        },
        {
            h: "雅",
            v: "Nhã"
        },
        {
            h: "眼",
            v: "Nhãn"
        },
        {
            h: "岳",
            v: "Nhạc"
        },
        {
            h: "嶽",
            v: "Nhạc"
        },
        {
            h: "鴈",
            v: "Nhạn"
        },
        {
            h: "贋",
            v: "Nhạn"
        },
        {
            h: "雁",
            v: "Nhạn"
        },
        {
            h: "妊",
            v: "Nhâm"
        },
        {
            h: "壬",
            v: "Nhâm"
        },
        {
            h: "姙",
            v: "Nhâm"
        },
        {
            h: "人",
            v: "Nhân"
        },
        {
            h: "仁",
            v: "Nhân"
        },
        {
            h: "因",
            v: "Nhân"
        },
        {
            h: "姻",
            v: "Nhân"
        },
        {
            h: "氤",
            v: "Nhân"
        },
        {
            h: "儿",
            v: "Nhân"
        },
        {
            h: "一",
            v: "Nhất"
        },
        {
            h: "壱",
            v: "Nhất"
        },
        {
            h: "壹",
            v: "Nhất"
        },
        {
            h: "弌",
            v: "Nhất"
        },
        {
            h: "賃",
            v: "Nhẫm"
        },
        {
            h: "稔",
            v: "Nhẫm"
        },
        {
            h: "忍",
            v: "Nhẫn"
        },
        {
            h: "恁",
            v: "Nhậm"
        },
        {
            h: "認",
            v: "Nhận"
        },
        {
            h: "刃",
            v: "Nhận"
        },
        {
            h: "仞",
            v: "Nhận"
        },
        {
            h: "仭",
            v: "Nhận"
        },
        {
            h: "刄",
            v: "Nhận"
        },
        {
            h: "込",
            v: "(Nhập)"
        },
        {
            h: "入",
            v: "Nhập"
        },
        {
            h: "圦",
            v: "(Nhập)"
        },
        {
            h: "日",
            v: "Nhật"
        },
        {
            h: "喰",
            v: "(Nhậu)"
        },
        {
            h: "児",
            v: "Nhi"
        },
        {
            h: "然",
            v: "Nhiên"
        },
        {
            h: "燃",
            v: "Nhiên"
        },
        {
            h: "撚",
            v: "Nhiên"
        },
        {
            h: "橈",
            v: "Nhiêu"
        },
        {
            h: "摂",
            v: "Nhiếp"
        },
        {
            h: "慴",
            v: "Nhiếp"
        },
        {
            h: "懾",
            v: "Nhiếp"
        },
        {
            h: "攝",
            v: "Nhiếp"
        },
        {
            h: "囁",
            v: "Nhiếp"
        },
        {
            h: "咽",
            v: "Nhiết/Yến/Yết"
        },
        {
            h: "染",
            v: "Nhiễm"
        },
        {
            h: "冉",
            v: "Nhiễm"
        },
        {
            h: "擾",
            v: "Nhiễu"
        },
        {
            h: "任",
            v: "Nhiệm"
        },
        {
            h: "熱",
            v: "Nhiệt"
        },
        {
            h: "耳",
            v: "Nhĩ"
        },
        {
            h: "爾",
            v: "Nhĩ"
        },
        {
            h: "尓",
            v: "Nhĩ"
        },
        {
            h: "二",
            v: "Nhị"
        },
        {
            h: "弐",
            v: "Nhị"
        },
        {
            h: "蕊",
            v: "Nhị"
        },
        {
            h: "蘂",
            v: "Nhị"
        },
        {
            h: "弍",
            v: "Nhị"
        },
        {
            h: "貳",
            v: "Nhị"
        },
        {
            h: "弭",
            v: "Nhị"
        },
        {
            h: "柔",
            v: "Nhu"
        },
        {
            h: "需",
            v: "Nhu"
        },
        {
            h: "儒",
            v: "Nhu"
        },
        {
            h: "懦",
            v: "Nhu"
        },
        {
            h: "揉",
            v: "Nhu"
        },
        {
            h: "濡",
            v: "Nhu"
        },
        {
            h: "嬬",
            v: "Nhu"
        },
        {
            h: "潤",
            v: "Nhuận"
        },
        {
            h: "閏",
            v: "Nhuận"
        },
        {
            h: "蚋",
            v: "Nhuế"
        },
        {
            h: "鋭",
            v: "Nhuệ/Duệ"
        },
        {
            h: "戎",
            v: "Nhung"
        },
        {
            h: "軟",
            v: "Nhuyễn"
        },
        {
            h: "乳",
            v: "Nhũ"
        },
        {
            h: "冗",
            v: "Nhũng"
        },
        {
            h: "孺",
            v: "Nhụ"
        },
        {
            h: "肉",
            v: "Nhục"
        },
        {
            h: "辱",
            v: "Nhục"
        },
        {
            h: "褥",
            v: "Nhục"
        },
        {
            h: "宍",
            v: "Nhục"
        },
        {
            h: "如",
            v: "Như"
        },
        {
            h: "洳",
            v: "Như"
        },
        {
            h: "仍",
            v: "Nhưng"
        },
        {
            h: "穣",
            v: "Nhương"
        },
        {
            h: "醸",
            v: "Nhưỡng"
        },
        {
            h: "壌",
            v: "Nhưỡng"
        },
        {
            h: "攘",
            v: "Nhưỡng"
        },
        {
            h: "壤",
            v: "Nhưỡng"
        },
        {
            h: "若",
            v: "Nhược"
        },
        {
            h: "弱",
            v: "Nhược"
        },
        {
            h: "嫋",
            v: "Nhược"
        },
        {
            h: "搦",
            v: "Nhược"
        },
        {
            h: "譲",
            v: "Nhượng"
        },
        {
            h: "汝",
            v: "Nhữ"
        },
        {
            h: "尼",
            v: "Ni"
        },
        {
            h: "粘",
            v: "Niêm"
        },
        {
            h: "鮎",
            v: "Niêm"
        },
        {
            h: "拈",
            v: "Niêm/Chiêm"
        },
        {
            h: "年",
            v: "Niên"
        },
        {
            h: "涅",
            v: "Niết"
        },
        {
            h: "念",
            v: "Niệm"
        },
        {
            h: "棯",
            v: "Niệm"
        },
        {
            h: "祷",
            v: "Niệm"
        },
        {
            h: "唸",
            v: "Niệm"
        },
        {
            h: "捻",
            v: "Niệm/Niệp"
        },
        {
            h: "尿",
            v: "Niệu"
        },
        {
            h: "寧",
            v: "Ninh"
        },
        {
            h: "檸",
            v: "Ninh"
        },
        {
            h: "嚀",
            v: "Ninh"
        },
        {
            h: "溺",
            v: "Nịch"
        },
        {
            h: "侫",
            v: "Nịnh"
        },
        {
            h: "佞",
            v: "Nịnh"
        },
        {
            h: "孥",
            v: "Noa"
        },
        {
            h: "卵",
            v: "Noãn"
        },
        {
            h: "暖",
            v: "Noãn"
        },
        {
            h: "奴",
            v: "Nô"
        },
        {
            h: "帑",
            v: "Nô"
        },
        {
            h: "農",
            v: "Nông"
        },
        {
            h: "膿",
            v: "Nồng"
        },
        {
            h: "濃",
            v: "Nồng/Nùng"
        },
        {
            h: "努",
            v: "Nỗ"
        },
        {
            h: "弩",
            v: "Nỗ"
        },
        {
            h: "怒",
            v: "Nộ"
        },
        {
            h: "内",
            v: "Nội"
        },
        {
            h: "嫩",
            v: "Nộn"
        },
        {
            h: "吶",
            v: "Nột"
        },
        {
            h: "痿",
            v: "Nuy"
        },
        {
            h: "儂",
            v: "Nùng"
        },
        {
            h: "娘",
            v: "Nương"
        },
        {
            h: "嬢",
            v: "Nương"
        },
        {
            h: "孃",
            v: "Nương"
        },
        {
            h: "女",
            v: "Nữ"
        },
        {
            h: "紐",
            v: "Nữu"
        },
        {
            h: "忸",
            v: "Nữu"
        },
        {
            h: "怩",
            v: "Ny"
        },
        {
            h: "渦",
            v: "Oa"
        },
        {
            h: "鍋",
            v: "Oa"
        },
        {
            h: "窪",
            v: "Oa"
        },
        {
            h: "蛙",
            v: "Oa"
        },
        {
            h: "蝸",
            v: "Oa"
        },
        {
            h: "哇",
            v: "Oa"
        },
        {
            h: "娃",
            v: "Oa"
        },
        {
            h: "歪",
            v: "Oai"
        },
        {
            h: "寃",
            v: "Oan"
        },
        {
            h: "冤",
            v: "Oan"
        },
        {
            h: "轟",
            v: "Oanh"
        },
        {
            h: "怨",
            v: "Oán"
        },
        {
            h: "斡",
            v: "Oát/Quản"
        },
        {
            h: "倭",
            v: "Oải/Nụy"
        },
        {
            h: "腕",
            v: "Oản"
        },
        {
            h: "椀",
            v: "Oản"
        },
        {
            h: "汚",
            v: "Ô"
        },
        {
            h: "烏",
            v: "Ô"
        },
        {
            h: "嗚",
            v: "Ô"
        },
        {
            h: "隅",
            v: "Ôi"
        },
        {
            h: "温",
            v: "Ôn"
        },
        {
            h: "饂",
            v: "Ôn"
        },
        {
            h: "慍",
            v: "Ôn"
        },
        {
            h: "瘟",
            v: "Ôn"
        },
        {
            h: "翁",
            v: "Ông"
        },
        {
            h: "屋",
            v: "Ốc"
        },
        {
            h: "沃",
            v: "Ốc"
        },
        {
            h: "幄",
            v: "Ốc"
        },
        {
            h: "榲",
            v: "Ốt"
        },
        {
            h: "塢",
            v: "Ổ"
        },
        {
            h: "猥",
            v: "Ổi"
        },
        {
            h: "穏",
            v: "Ổn"
        },
        {
            h: "玻",
            v: "Pha"
        },
        {
            h: "坡",
            v: "Pha"
        },
        {
            h: "潘",
            v: "Phan"
        },
        {
            h: "攀",
            v: "Phan"
        },
        {
            h: "怦",
            v: "Phanh"
        },
        {
            h: "烹",
            v: "Phanh"
        },
        {
            h: "枅",
            v: "Phanh/Bình"
        },
        {
            h: "泡",
            v: "Phao/Bào"
        },
        {
            h: "破",
            v: "Phá"
        },
        {
            h: "朴",
            v: "Phác"
        },
        {
            h: "樸",
            v: "Phác"
        },
        {
            h: "撲",
            v: "Phác/Bạc"
        },
        {
            h: "拍",
            v: "Phách"
        },
        {
            h: "擘",
            v: "Phách"
        },
        {
            h: "襞",
            v: "Phách"
        },
        {
            h: "劈",
            v: "Phách"
        },
        {
            h: "派",
            v: "Phái"
        },
        {
            h: "沛",
            v: "Phái/Bái"
        },
        {
            h: "判",
            v: "Phán"
        },
        {
            h: "砲",
            v: "Pháo"
        },
        {
            h: "法",
            v: "Pháp"
        },
        {
            h: "発",
            v: "Phát"
        },
        {
            h: "髪",
            v: "Phát"
        },
        {
            h: "凡",
            v: "Phàm"
        },
        {
            h: "帆",
            v: "Phàm"
        },
        {
            h: "樊",
            v: "Phàn"
        },
        {
            h: "版",
            v: "Phản"
        },
        {
            h: "返",
            v: "Phản"
        },
        {
            h: "反",
            v: "Phản"
        },
        {
            h: "坂",
            v: "Phản"
        },
        {
            h: "阪",
            v: "Phản"
        },
        {
            h: "叛",
            v: "Phản"
        },
        {
            h: "怕",
            v: "Phạ"
        },
        {
            h: "犯",
            v: "Phạm"
        },
        {
            h: "範",
            v: "Phạm"
        },
        {
            h: "范",
            v: "Phạm"
        },
        {
            h: "飯",
            v: "Phạn"
        },
        {
            h: "梵",
            v: "Phạn"
        },
        {
            h: "乏",
            v: "Phạp"
        },
        {
            h: "罰",
            v: "Phạt"
        },
        {
            h: "伐",
            v: "Phạt"
        },
        {
            h: "紛",
            v: "Phân"
        },
        {
            h: "雰",
            v: "Phân"
        },
        {
            h: "分",
            v: "Phân"
        },
        {
            h: "氛",
            v: "Phân"
        },
        {
            h: "吩",
            v: "Phân"
        },
        {
            h: "粉",
            v: "Phấn"
        },
        {
            h: "奮",
            v: "Phấn"
        },
        {
            h: "払",
            v: "Phất"
        },
        {
            h: "弗",
            v: "Phất"
        },
        {
            h: "怫",
            v: "Phất"
        },
        {
            h: "拂",
            v: "Phất"
        },
        {
            h: "黻",
            v: "Phất"
        },
        {
            h: "彿",
            v: "Phất"
        },
        {
            h: "墳",
            v: "Phần"
        },
        {
            h: "枌",
            v: "Phần"
        },
        {
            h: "汾",
            v: "Phần"
        },
        {
            h: "抔",
            v: "Phầu"
        },
        {
            h: "品",
            v: "Phẩm"
        },
        {
            h: "糞",
            v: "Phẩn"
        },
        {
            h: "憤",
            v: "Phẫn"
        },
        {
            h: "忿",
            v: "Phẫn"
        },
        {
            h: "扮",
            v: "Phẫn/Ban/Bán"
        },
        {
            h: "剖",
            v: "Phẫu"
        },
        {
            h: "仏",
            v: "Phật"
        },
        {
            h: "佛",
            v: "Phật"
        },
        {
            h: "批",
            v: "Phê"
        },
        {
            h: "砒",
            v: "Phê/Tỳ"
        },
        {
            h: "肺",
            v: "Phế"
        },
        {
            h: "廃",
            v: "Phế"
        },
        {
            h: "癈",
            v: "Phế"
        },
        {
            h: "廢",
            v: "Phế"
        },
        {
            h: "吠",
            v: "Phệ"
        },
        {
            h: "噬",
            v: "Phệ"
        },
        {
            h: "非",
            v: "Phi"
        },
        {
            h: "飛",
            v: "Phi"
        },
        {
            h: "妃",
            v: "Phi"
        },
        {
            h: "扉",
            v: "Phi"
        },
        {
            h: "披",
            v: "Phi"
        },
        {
            h: "緋",
            v: "Phi"
        },
        {
            h: "丕",
            v: "Phi"
        },
        {
            h: "翻",
            v: "Phiên"
        },
        {
            h: "藩",
            v: "Phiên"
        },
        {
            h: "番",
            v: "Phiên"
        },
        {
            h: "幡",
            v: "Phiên"
        },
        {
            h: "翩",
            v: "Phiên"
        },
        {
            h: "漂",
            v: "Phiêu"
        },
        {
            h: "慓",
            v: "Phiêu"
        },
        {
            h: "剽",
            v: "Phiêu"
        },
        {
            h: "嫖",
            v: "Phiêu"
        },
        {
            h: "汎",
            v: "Phiếm"
        },
        {
            h: "泛",
            v: "Phiếm"
        },
        {
            h: "氾",
            v: "Phiếm"
        },
        {
            h: "片",
            v: "Phiến"
        },
        {
            h: "販",
            v: "Phiến"
        },
        {
            h: "扇",
            v: "Phiến"
        },
        {
            h: "旙",
            v: "Phiến"
        },
        {
            h: "旛",
            v: "Phiến"
        },
        {
            h: "標",
            v: "Phiếu"
        },
        {
            h: "票",
            v: "Phiếu/Tiêu/Phiêu"
        },
        {
            h: "煩",
            v: "Phiền"
        },
        {
            h: "蕃",
            v: "Phiền"
        },
        {
            h: "閥",
            v: "Phiệt"
        },
        {
            h: "丿",
            v: "Phiệt"
        },
        {
            h: "娉",
            v: "Phinh"
        },
        {
            h: "費",
            v: "Phí"
        },
        {
            h: "沸",
            v: "Phí/Phất"
        },
        {
            h: "癖",
            v: "Phích"
        },
        {
            h: "肥",
            v: "Phì"
        },
        {
            h: "斐",
            v: "Phỉ"
        },
        {
            h: "榧",
            v: "Phỉ"
        },
        {
            h: "翡",
            v: "Phỉ"
        },
        {
            h: "匪",
            v: "Phỉ"
        },
        {
            h: "誹",
            v: "Phỉ"
        },
        {
            h: "豊",
            v: "Phong"
        },
        {
            h: "風",
            v: "Phong"
        },
        {
            h: "封",
            v: "Phong"
        },
        {
            h: "峰",
            v: "Phong"
        },
        {
            h: "楓",
            v: "Phong"
        },
        {
            h: "蜂",
            v: "Phong"
        },
        {
            h: "瘋",
            v: "Phong"
        },
        {
            h: "峯",
            v: "Phong"
        },
        {
            h: "赴",
            v: "Phó"
        },
        {
            h: "付",
            v: "Phó"
        },
        {
            h: "副",
            v: "Phó"
        },
        {
            h: "傅",
            v: "Phó"
        },
        {
            h: "咐",
            v: "Phó"
        },
        {
            h: "仆",
            v: "Phó/Bộc"
        },
        {
            h: "放",
            v: "Phóng"
        },
        {
            h: "抛",
            v: "Phóng"
        },
        {
            h: "防",
            v: "Phòng"
        },
        {
            h: "房",
            v: "Phòng/Bàng"
        },
        {
            h: "訪",
            v: "Phỏng/Phóng"
        },
        {
            h: "倣",
            v: "Phỏng/Phóng"
        },
        {
            h: "舗",
            v: "Phố"
        },
        {
            h: "圃",
            v: "Phố"
        },
        {
            h: "埔",
            v: "Phố"
        },
        {
            h: "配",
            v: "Phối"
        },
        {
            h: "繁",
            v: "Phồn"
        },
        {
            h: "浦",
            v: "Phổ"
        },
        {
            h: "譜",
            v: "Phổ"
        },
        {
            h: "普",
            v: "Phổ"
        },
        {
            h: "攵",
            v: "Phộc"
        },
        {
            h: "攴",
            v: "Phộc"
        },
        {
            h: "膚",
            v: "Phu"
        },
        {
            h: "夫",
            v: "Phu"
        },
        {
            h: "敷",
            v: "Phu"
        },
        {
            h: "麩",
            v: "Phu"
        },
        {
            h: "孵",
            v: "Phu"
        },
        {
            h: "孚",
            v: "Phu"
        },
        {
            h: "枹",
            v: "Phu/Phù/Bao"
        },
        {
            h: "賦",
            v: "Phú"
        },
        {
            h: "富",
            v: "Phú"
        },
        {
            h: "冨",
            v: "Phú"
        },
        {
            h: "福",
            v: "Phúc"
        },
        {
            h: "覆",
            v: "Phúc"
        },
        {
            h: "幅",
            v: "Phúc"
        },
        {
            h: "蝮",
            v: "Phúc"
        },
        {
            h: "腹",
            v: "Phúc/Phục"
        },
        {
            h: "噴",
            v: "Phún"
        },
        {
            h: "諷",
            v: "Phúng"
        },
        {
            h: "浮",
            v: "Phù"
        },
        {
            h: "符",
            v: "Phù"
        },
        {
            h: "扶",
            v: "Phù"
        },
        {
            h: "芙",
            v: "Phù"
        },
        {
            h: "桴",
            v: "Phù"
        },
        {
            h: "榑",
            v: "Phù"
        },
        {
            h: "蜉",
            v: "Phù"
        },
        {
            h: "俘",
            v: "Phù"
        },
        {
            h: "縫",
            v: "Phùng"
        },
        {
            h: "逢",
            v: "Phùng"
        },
        {
            h: "否",
            v: "Phủ"
        },
        {
            h: "府",
            v: "Phủ"
        },
        {
            h: "釜",
            v: "Phủ"
        },
        {
            h: "甫",
            v: "Phủ"
        },
        {
            h: "拊",
            v: "Phủ"
        },
        {
            h: "柎",
            v: "Phủ"
        },
        {
            h: "黼",
            v: "Phủ"
        },
        {
            h: "腑",
            v: "Phủ"
        },
        {
            h: "俯",
            v: "Phủ"
        },
        {
            h: "斧",
            v: "Phủ"
        },
        {
            h: "撫",
            v: "Phủ"
        },
        {
            h: "父",
            v: "Phụ"
        },
        {
            h: "負",
            v: "Phụ"
        },
        {
            h: "附",
            v: "Phụ"
        },
        {
            h: "婦",
            v: "Phụ"
        },
        {
            h: "埠",
            v: "Phụ"
        },
        {
            h: "輔",
            v: "Phụ"
        },
        {
            h: "阜",
            v: "Phụ"
        },
        {
            h: "坿",
            v: "Phụ"
        },
        {
            h: "服",
            v: "Phục"
        },
        {
            h: "伏",
            v: "Phục"
        },
        {
            h: "復",
            v: "Phục"
        },
        {
            h: "奉",
            v: "Phụng"
        },
        {
            h: "鳳",
            v: "Phụng"
        },
        {
            h: "肪",
            v: "Phương"
        },
        {
            h: "芳",
            v: "Phương"
        },
        {
            h: "妨",
            v: "Phương"
        },
        {
            h: "方",
            v: "Phương"
        },
        {
            h: "枋",
            v: "Phương"
        },
        {
            h: "匚",
            v: "Phương"
        },
        {
            h: "坊",
            v: "Phường"
        },
        {
            h: "紡",
            v: "Phưởng"
        },
        {
            h: "縛",
            v: "Phược/Phọc"
        },
        {
            h: "複",
            v: "Phức"
        },
        {
            h: "愎",
            v: "Phức"
        },
        {
            h: "馥",
            v: "Phức/Phốc"
        },
        {
            h: "戈",
            v: "Qua"
        },
        {
            h: "柧",
            v: "Qua"
        },
        {
            h: "瓜",
            v: "Qua"
        },
        {
            h: "咼",
            v: "Qua"
        },
        {
            h: "堝",
            v: "Qua"
        },
        {
            h: "乖",
            v: "Quai"
        },
        {
            h: "観",
            v: "Quan"
        },
        {
            h: "関",
            v: "Quan"
        },
        {
            h: "官",
            v: "Quan"
        },
        {
            h: "棺",
            v: "Quan"
        },
        {
            h: "冠",
            v: "Quan/Quán"
        },
        {
            h: "光",
            v: "Quang"
        },
        {
            h: "洸",
            v: "Quang"
        },
        {
            h: "昿",
            v: "Quang"
        },
        {
            h: "過",
            v: "Quá"
        },
        {
            h: "郭",
            v: "Quách"
        },
        {
            h: "槨",
            v: "Quách"
        },
        {
            h: "椁",
            v: "Quách"
        },
        {
            h: "怪",
            v: "Quái"
        },
        {
            h: "卦",
            v: "Quái"
        },
        {
            h: "恠",
            v: "Quái"
        },
        {
            h: "夬",
            v: "Quái"
        },
        {
            h: "貫",
            v: "Quán"
        },
        {
            h: "館",
            v: "Quán"
        },
        {
            h: "慣",
            v: "Quán"
        },
        {
            h: "丱",
            v: "Quán"
        },
        {
            h: "舘",
            v: "Quán"
        },
        {
            h: "串",
            v: "Quán/Xuyến"
        },
        {
            h: "括",
            v: "Quát"
        },
        {
            h: "菓",
            v: "Quả"
        },
        {
            h: "果",
            v: "Quả"
        },
        {
            h: "寡",
            v: "Quả"
        },
        {
            h: "拐",
            v: "Quải"
        },
        {
            h: "掛",
            v: "Quải"
        },
        {
            h: "挂",
            v: "Quải"
        },
        {
            h: "枴",
            v: "Quải"
        },
        {
            h: "罫",
            v: "Quải/Quái"
        },
        {
            h: "管",
            v: "Quản"
        },
        {
            h: "広",
            v: "Quảng"
        },
        {
            h: "廣",
            v: "Quảng"
        },
        {
            h: "軍",
            v: "Quân"
        },
        {
            h: "君",
            v: "Quân"
        },
        {
            h: "均",
            v: "Quân"
        },
        {
            h: "桾",
            v: "Quân"
        },
        {
            h: "皸",
            v: "Quân"
        },
        {
            h: "皹",
            v: "Quân"
        },
        {
            h: "橘",
            v: "Quất"
        },
        {
            h: "桔",
            v: "Quất/Cát"
        },
        {
            h: "群",
            v: "Quần"
        },
        {
            h: "麕",
            v: "Quần"
        },
        {
            h: "郡",
            v: "Quận"
        },
        {
            h: "堀",
            v: "Quật"
        },
        {
            h: "掘",
            v: "Quật"
        },
        {
            h: "倔",
            v: "Quật"
        },
        {
            h: "窟",
            v: "Quật"
        },
        {
            h: "崛",
            v: "Quật"
        },
        {
            h: "肱",
            v: "Quăng"
        },
        {
            h: "掴",
            v: "Quắc"
        },
        {
            h: "攫",
            v: "Quắc"
        },
        {
            h: "矍",
            v: "Quắc"
        },
        {
            h: "幗",
            v: "Quắc"
        },
        {
            h: "桂",
            v: "Quế"
        },
        {
            h: "国",
            v: "Quốc"
        },
        {
            h: "國",
            v: "Quốc"
        },
        {
            h: "圀",
            v: "Quốc"
        },
        {
            h: "規",
            v: "Quy/Qui"
        },
        {
            h: "帰",
            v: "Quy/Qui"
        },
        {
            h: "亀",
            v: "Quy/Qui"
        },
        {
            h: "歸",
            v: "Quy/Qui"
        },
        {
            h: "龜",
            v: "Quy/Qui/Cưu/Quân"
        },
        {
            h: "絹",
            v: "Quyên"
        },
        {
            h: "悁",
            v: "Quyên"
        },
        {
            h: "捐",
            v: "Quyên"
        },
        {
            h: "涓",
            v: "Quyên"
        },
        {
            h: "娟",
            v: "Quyên"
        },
        {
            h: "決",
            v: "Quyết"
        },
        {
            h: "抉",
            v: "Quyết"
        },
        {
            h: "亅",
            v: "Quyết"
        },
        {
            h: "孑",
            v: "Quyết"
        },
        {
            h: "决",
            v: "Quyết"
        },
        {
            h: "刔",
            v: "Quyết"
        },
        {
            h: "厥",
            v: "Quyết"
        },
        {
            h: "圏",
            v: "Quyền"
        },
        {
            h: "権",
            v: "Quyền"
        },
        {
            h: "拳",
            v: "Quyền"
        },
        {
            h: "權",
            v: "Quyền"
        },
        {
            h: "惓",
            v: "Quyền"
        },
        {
            h: "蜷",
            v: "Quyền"
        },
        {
            h: "圈",
            v: "Quyền"
        },
        {
            h: "捲",
            v: "Quyển"
        },
        {
            h: "卷",
            v: "Quyển"
        },
        {
            h: "巻",
            v: "Quyển/Quyền"
        },
        {
            h: "倦",
            v: "Quyện"
        },
        {
            h: "冂",
            v: "Quynh"
        },
        {
            h: "夐",
            v: "Quynh"
        },
        {
            h: "貴",
            v: "Quý/Quí"
        },
        {
            h: "癸",
            v: "Quý/Quí"
        },
        {
            h: "悸",
            v: "Quý/Quí"
        },
        {
            h: "葵",
            v: "Quỳ/Quì"
        },
        {
            h: "鬼",
            v: "Quỷ/Quỉ"
        },
        {
            h: "愧",
            v: "Quỷ/Quỉ"
        },
        {
            h: "饋",
            v: "Quỹ"
        },
        {
            h: "軌",
            v: "Quỹ/Quĩ"
        },
        {
            h: "揆",
            v: "Quỹ/Quĩ"
        },
        {
            h: "櫃",
            v: "Quỹ/Quĩ"
        },
        {
            h: "匱",
            v: "Quỹ/Quĩ"
        },
        {
            h: "砂",
            v: "Sa"
        },
        {
            h: "紗",
            v: "Sa"
        },
        {
            h: "沙",
            v: "Sa"
        },
        {
            h: "娑",
            v: "Sa"
        },
        {
            h: "差",
            v: "Sai"
        },
        {
            h: "搓",
            v: "Sai"
        },
        {
            h: "嵯",
            v: "Sai"
        },
        {
            h: "嵳",
            v: "Sai"
        },
        {
            h: "彡",
            v: "Sam"
        },
        {
            h: "杉",
            v: "Sam/Soan"
        },
        {
            h: "刊",
            v: "San"
        },
        {
            h: "餐",
            v: "San"
        },
        {
            h: "刋",
            v: "San"
        },
        {
            h: "刪",
            v: "San"
        },
        {
            h: "瘡",
            v: "Sang"
        },
        {
            h: "搶",
            v: "Sang/Thương"
        },
        {
            h: "抄",
            v: "Sao"
        },
        {
            h: "蛸",
            v: "Sao"
        },
        {
            h: "梢",
            v: "Sao/Tiêu"
        },
        {
            h: "侘",
            v: "Sá"
        },
        {
            h: "策",
            v: "Sách"
        },
        {
            h: "冊",
            v: "Sách"
        },
        {
            h: "拆",
            v: "Sách"
        },
        {
            h: "柵",
            v: "Sách"
        },
        {
            h: "册",
            v: "Sách"
        },
        {
            h: "彳",
            v: "Sách"
        },
        {
            h: "索",
            v: "Sách/Tác"
        },
        {
            h: "懴",
            v: "Sám"
        },
        {
            h: "懺",
            v: "Sám"
        },
        {
            h: "疝",
            v: "Sán"
        },
        {
            h: "汕",
            v: "Sán"
        },
        {
            h: "創",
            v: "Sáng"
        },
        {
            h: "套",
            v: "Sáo"
        },
        {
            h: "渋",
            v: "Sáp"
        },
        {
            h: "歃",
            v: "Sáp"
        },
        {
            h: "插",
            v: "Sáp/Tháp"
        },
        {
            h: "察",
            v: "Sát"
        },
        {
            h: "擦",
            v: "Sát"
        },
        {
            h: "殺",
            v: "Sát"
        },
        {
            h: "刹",
            v: "Sát"
        },
        {
            h: "柴",
            v: "Sài"
        },
        {
            h: "巉",
            v: "Sàm"
        },
        {
            h: "讒",
            v: "Sàm"
        },
        {
            h: "孱",
            v: "Sàn"
        },
        {
            h: "床",
            v: "Sàng"
        },
        {
            h: "牀",
            v: "Sàng"
        },
        {
            h: "巣",
            v: "Sào"
        },
        {
            h: "捨",
            v: "Sả"
        },
        {
            h: "産",
            v: "Sản"
        },
        {
            h: "爽",
            v: "Sảng"
        },
        {
            h: "庁",
            v: "Sảnh"
        },
        {
            h: "廰",
            v: "Sảnh/Thinh"
        },
        {
            h: "廳",
            v: "Sảnh/Thinh"
        },
        {
            h: "乍",
            v: "Sạ/Tác"
        },
        {
            h: "桟",
            v: "Sạn"
        },
        {
            h: "棧",
            v: "Sạn"
        },
        {
            h: "森",
            v: "Sâm"
        },
        {
            h: "槙",
            v: "Sân"
        },
        {
            h: "齔",
            v: "Sấn"
        },
        {
            h: "叱",
            v: "Sất"
        },
        {
            h: "痩",
            v: "Sấu"
        },
        {
            h: "嗽",
            v: "Sấu"
        },
        {
            h: "岑",
            v: "Sầm"
        },
        {
            h: "愁",
            v: "Sầu"
        },
        {
            h: "笹",
            v: "(Sậy)"
        },
        {
            h: "色",
            v: "Sắc"
        },
        {
            h: "勅",
            v: "Sắc"
        },
        {
            h: "敕",
            v: "Sắc"
        },
        {
            h: "嗇",
            v: "Sắc"
        },
        {
            h: "虱",
            v: "Sắt"
        },
        {
            h: "蝨",
            v: "Sắt"
        },
        {
            h: "痴",
            v: "Si"
        },
        {
            h: "癡",
            v: "Si"
        },
        {
            h: "魑",
            v: "Si"
        },
        {
            h: "嗤",
            v: "Si"
        },
        {
            h: "徙",
            v: "Si/Tỷ"
        },
        {
            h: "超",
            v: "Siêu"
        },
        {
            h: "牲",
            v: "Sinh"
        },
        {
            h: "生",
            v: "Sinh"
        },
        {
            h: "翅",
            v: "Sí"
        },
        {
            h: "廁",
            v: "Sí"
        },
        {
            h: "恥",
            v: "Sỉ"
        },
        {
            h: "仕",
            v: "Sĩ"
        },
        {
            h: "士",
            v: "Sĩ"
        },
        {
            h: "俟",
            v: "Sĩ"
        },
        {
            h: "蓑",
            v: "Soa/Thoa"
        },
        {
            h: "簒",
            v: "Soán"
        },
        {
            h: "撰",
            v: "Soạn"
        },
        {
            h: "窓",
            v: "Song"
        },
        {
            h: "双",
            v: "Song"
        },
        {
            h: "雙",
            v: "Song"
        },
        {
            h: "槊",
            v: "Sóc/Sáo"
        },
        {
            h: "皺",
            v: "Sô"
        },
        {
            h: "芻",
            v: "Sô"
        },
        {
            h: "数",
            v: "Số"
        },
        {
            h: "數",
            v: "Số"
        },
        {
            h: "雛",
            v: "Sồ"
        },
        {
            h: "疎",
            v: "Sơ"
        },
        {
            h: "初",
            v: "Sơ"
        },
        {
            h: "梳",
            v: "Sơ"
        },
        {
            h: "山",
            v: "Sơn/San"
        },
        {
            h: "礎",
            v: "Sở"
        },
        {
            h: "所",
            v: "Sở"
        },
        {
            h: "楚",
            v: "Sở"
        },
        {
            h: "充",
            v: "Sung"
        },
        {
            h: "迚",
            v: "(Sung)"
        },
        {
            h: "憧",
            v: "Sung"
        },
        {
            h: "衰",
            v: "Suy"
        },
        {
            h: "榱",
            v: "Suy"
        },
        {
            h: "推",
            v: "Suy/Thôi"
        },
        {
            h: "喘",
            v: "Suyễn"
        },
        {
            h: "畜",
            v: "Súc"
        },
        {
            h: "縮",
            v: "Súc"
        },
        {
            h: "蓄",
            v: "Súc"
        },
        {
            h: "矗",
            v: "Súc"
        },
        {
            h: "銃",
            v: "Súng"
        },
        {
            h: "帥",
            v: "Súy/Soái/Suất"
        },
        {
            h: "崇",
            v: "Sùng"
        },
        {
            h: "寵",
            v: "Sủng"
        },
        {
            h: "揣",
            v: "Sủy"
        },
        {
            h: "師",
            v: "Sư"
        },
        {
            h: "獅",
            v: "Sư"
        },
        {
            h: "霜",
            v: "Sương"
        },
        {
            h: "孀",
            v: "Sương"
        },
        {
            h: "廂",
            v: "Sương"
        },
        {
            h: "暢",
            v: "Sướng"
        },
        {
            h: "昶",
            v: "Sưởng"
        },
        {
            h: "敞",
            v: "Sưởng"
        },
        {
            h: "捜",
            v: "Sưu"
        },
        {
            h: "搜",
            v: "Sưu"
        },
        {
            h: "飾",
            v: "Sức"
        },
        {
            h: "鋤",
            v: "Sừ"
        },
        {
            h: "史",
            v: "Sử"
        },
        {
            h: "使",
            v: "Sử/Sứ"
        },
        {
            h: "丑",
            v: "Sửu"
        },
        {
            h: "事",
            v: "Sự"
        },
        {
            h: "些",
            v: "Ta"
        },
        {
            h: "嗟",
            v: "Ta"
        },
        {
            h: "災",
            v: "Tai"
        },
        {
            h: "哉",
            v: "Tai"
        },
        {
            h: "三",
            v: "Tam"
        },
        {
            h: "桑",
            v: "Tang"
        },
        {
            h: "喪",
            v: "Tang/Táng"
        },
        {
            h: "遭",
            v: "Tao"
        },
        {
            h: "騒",
            v: "Tao"
        },
        {
            h: "掻",
            v: "Tao"
        },
        {
            h: "繰",
            v: "Tao/Tào"
        },
        {
            h: "佐",
            v: "Tá"
        },
        {
            h: "借",
            v: "Tá"
        },
        {
            h: "卸",
            v: "Tá"
        },
        {
            h: "作",
            v: "Tác"
        },
        {
            h: "再",
            v: "Tái"
        },
        {
            h: "賽",
            v: "Tái"
        },
        {
            h: "賛",
            v: "Tán"
        },
        {
            h: "散",
            v: "Tán"
        },
        {
            h: "攅",
            v: "Tán"
        },
        {
            h: "葬",
            v: "Táng"
        },
        {
            h: "蔵",
            v: "Táng"
        },
        {
            h: "燥",
            v: "Táo"
        },
        {
            h: "躁",
            v: "Táo"
        },
        {
            h: "噪",
            v: "Táo"
        },
        {
            h: "匝",
            v: "Táp"
        },
        {
            h: "撒",
            v: "Tát"
        },
        {
            h: "邪",
            v: "Tà"
        },
        {
            h: "斜",
            v: "Tà"
        },
        {
            h: "才",
            v: "Tài"
        },
        {
            h: "財",
            v: "Tài"
        },
        {
            h: "裁",
            v: "Tài"
        },
        {
            h: "材",
            v: "Tài"
        },
        {
            h: "截",
            v: "Tài"
        },
        {
            h: "栽",
            v: "Tài/Tải"
        },
        {
            h: "戝",
            v: "Tài/Tặc"
        },
        {
            h: "慚",
            v: "Tàm"
        },
        {
            h: "慙",
            v: "Tàm"
        },
        {
            h: "蠶",
            v: "Tàm"
        },
        {
            h: "残",
            v: "Tàn"
        },
        {
            h: "殘",
            v: "Tàn"
        },
        {
            h: "曹",
            v: "Tào"
        },
        {
            h: "槽",
            v: "Tào"
        },
        {
            h: "写",
            v: "Tả"
        },
        {
            h: "左",
            v: "Tả"
        },
        {
            h: "冩",
            v: "Tả"
        },
        {
            h: "寫",
            v: "Tả"
        },
        {
            h: "載",
            v: "Tải/Tái"
        },
        {
            h: "傘",
            v: "Tản"
        },
        {
            h: "霰",
            v: "Tản"
        },
        {
            h: "藻",
            v: "Tảo"
        },
        {
            h: "掃",
            v: "Tảo"
        },
        {
            h: "早",
            v: "Tảo"
        },
        {
            h: "棗",
            v: "Tảo"
        },
        {
            h: "蚤",
            v: "Tảo"
        },
        {
            h: "漕",
            v: "Tảo"
        },
        {
            h: "謝",
            v: "Tạ"
        },
        {
            h: "酢",
            v: "Tạc"
        },
        {
            h: "昨",
            v: "Tạc"
        },
        {
            h: "炸",
            v: "Tạc"
        },
        {
            h: "柞",
            v: "Tạc/Trách"
        },
        {
            h: "在",
            v: "Tại"
        },
        {
            h: "暫",
            v: "Tạm"
        },
        {
            h: "槧",
            v: "Tạm/Thiễm"
        },
        {
            h: "臓",
            v: "Tạng"
        },
        {
            h: "臟",
            v: "Tạng"
        },
        {
            h: "造",
            v: "Tạo/Tháo"
        },
        {
            h: "雑",
            v: "Tạp"
        },
        {
            h: "囃",
            v: "Tạp"
        },
        {
            h: "卅",
            v: "Tạp/Nẫm"
        },
        {
            h: "拶",
            v: "Tạt/Tán"
        },
        {
            h: "心",
            v: "Tâm"
        },
        {
            h: "津",
            v: "Tân"
        },
        {
            h: "薪",
            v: "Tân"
        },
        {
            h: "辛",
            v: "Tân"
        },
        {
            h: "賓",
            v: "Tân"
        },
        {
            h: "新",
            v: "Tân"
        },
        {
            h: "檳",
            v: "Tân"
        },
        {
            h: "梹",
            v: "Tân"
        },
        {
            h: "浜",
            v: "Tân/Banh"
        },
        {
            h: "西",
            v: "Tây"
        },
        {
            h: "迅",
            v: "Tấn"
        },
        {
            h: "晋",
            v: "Tấn"
        },
        {
            h: "擯",
            v: "Tấn"
        },
        {
            h: "晉",
            v: "Tấn"
        },
        {
            h: "殯",
            v: "Tấn/Thấn"
        },
        {
            h: "漆",
            v: "Tất"
        },
        {
            h: "必",
            v: "Tất"
        },
        {
            h: "膝",
            v: "Tất"
        },
        {
            h: "蟋",
            v: "Tất"
        },
        {
            h: "奏",
            v: "Tấu"
        },
        {
            h: "尋",
            v: "Tầm"
        },
        {
            h: "蕁",
            v: "Tầm"
        },
        {
            h: "頻",
            v: "Tần"
        },
        {
            h: "秦",
            v: "Tần"
        },
        {
            h: "顰",
            v: "Tần"
        },
        {
            h: "瀕",
            v: "Tần"
        },
        {
            h: "嬪",
            v: "Tần"
        },
        {
            h: "層",
            v: "Tầng/Tằng"
        },
        {
            h: "浸",
            v: "Tẩm"
        },
        {
            h: "寝",
            v: "Tẩm"
        },
        {
            h: "寢",
            v: "Tẩm"
        },
        {
            h: "走",
            v: "Tẩu"
        },
        {
            h: "薮",
            v: "Tẩu"
        },
        {
            h: "叟",
            v: "Tẩu"
        },
        {
            h: "嗾",
            v: "Tẩu"
        },
        {
            h: "嫂",
            v: "Tẩu"
        },
        {
            h: "洗",
            v: "Tẩy"
        },
        {
            h: "晒",
            v: "Tẩy"
        },
        {
            h: "洒",
            v: "Tẩy"
        },
        {
            h: "牝",
            v: "Tẫn"
        },
        {
            h: "尽",
            v: "Tận"
        },
        {
            h: "儘",
            v: "Tận"
        },
        {
            h: "侭",
            v: "Tận"
        },
        {
            h: "習",
            v: "Tập"
        },
        {
            h: "集",
            v: "Tập"
        },
        {
            h: "襲",
            v: "Tập"
        },
        {
            h: "葺",
            v: "Tập"
        },
        {
            h: "疾",
            v: "Tật"
        },
        {
            h: "嫉",
            v: "Tật"
        },
        {
            h: "僧",
            v: "Tăng"
        },
        {
            h: "増",
            v: "Tăng"
        },
        {
            h: "憎",
            v: "Tăng"
        },
        {
            h: "囎",
            v: "Tăng"
        },
        {
            h: "則",
            v: "Tắc"
        },
        {
            h: "塞",
            v: "Tắc/Tái"
        },
        {
            h: "蚕",
            v: "Tằm"
        },
        {
            h: "曽",
            v: "Tằng"
        },
        {
            h: "曾",
            v: "Tằng"
        },
        {
            h: "噌",
            v: "Tằng"
        },
        {
            h: "賊",
            v: "Tặc"
        },
        {
            h: "贈",
            v: "Tặng"
        },
        {
            h: "痺",
            v: "Tê"
        },
        {
            h: "齎",
            v: "Tê"
        },
        {
            h: "厮",
            v: "Tê"
        },
        {
            h: "嘶",
            v: "Tê"
        },
        {
            h: "犀",
            v: "Tê"
        },
        {
            h: "撕",
            v: "Tê/Ty"
        },
        {
            h: "済",
            v: "Tế"
        },
        {
            h: "祭",
            v: "Tế"
        },
        {
            h: "細",
            v: "Tế"
        },
        {
            h: "際",
            v: "Tế"
        },
        {
            h: "婿",
            v: "Tế"
        },
        {
            h: "蔽",
            v: "Tế"
        },
        {
            h: "壻",
            v: "Tế"
        },
        {
            h: "斉",
            v: "Tề"
        },
        {
            h: "儕",
            v: "Tề"
        },
        {
            h: "宰",
            v: "Tể"
        },
        {
            h: "仔",
            v: "Tể"
        },
        {
            h: "擠",
            v: "Tể/Tê"
        },
        {
            h: "剤",
            v: "Tễ"
        },
        {
            h: "劑",
            v: "Tễ"
        },
        {
            h: "幣",
            v: "Tệ"
        },
        {
            h: "弊",
            v: "Tệ"
        },
        {
            h: "敝",
            v: "Tệ"
        },
        {
            h: "斃",
            v: "Tệ"
        },
        {
            h: "幤",
            v: "Tệ"
        },
        {
            h: "他",
            v: "Tha"
        },
        {
            h: "它",
            v: "Tha"
        },
        {
            h: "胎",
            v: "Thai"
        },
        {
            h: "貪",
            v: "Tham"
        },
        {
            h: "参",
            v: "Tham/Sâm"
        },
        {
            h: "參",
            v: "Tham/Sâm"
        },
        {
            h: "攤",
            v: "Than"
        },
        {
            h: "湯",
            v: "Thang"
        },
        {
            h: "清",
            v: "Thanh"
        },
        {
            h: "青",
            v: "Thanh"
        },
        {
            h: "声",
            v: "Thanh"
        },
        {
            h: "懆",
            v: "Thao"
        },
        {
            h: "叨",
            v: "Thao"
        },
        {
            h: "操",
            v: "Thao/Tháo"
        },
        {
            h: "託",
            v: "Thác"
        },
        {
            h: "錯",
            v: "Thác"
        },
        {
            h: "拓",
            v: "Thác"
        },
        {
            h: "托",
            v: "Thác"
        },
        {
            h: "柝",
            v: "Thác"
        },
        {
            h: "泰",
            v: "Thái"
        },
        {
            h: "菜",
            v: "Thái"
        },
        {
            h: "太",
            v: "Thái"
        },
        {
            h: "態",
            v: "Thái"
        },
        {
            h: "彩",
            v: "Thái/Thải"
        },
        {
            h: "汰",
            v: "Thái/Thải"
        },
        {
            h: "探",
            v: "Thám"
        },
        {
            h: "嘆",
            v: "Thán"
        },
        {
            h: "炭",
            v: "Thán"
        },
        {
            h: "歎",
            v: "Thán"
        },
        {
            h: "聖",
            v: "Thánh"
        },
        {
            h: "慥",
            v: "Tháo"
        },
        {
            h: "塔",
            v: "Tháp"
        },
        {
            h: "挿",
            v: "Tháp"
        },
        {
            h: "搨",
            v: "Tháp"
        },
        {
            h: "榻",
            v: "Tháp"
        },
        {
            h: "誠",
            v: "Thành"
        },
        {
            h: "城",
            v: "Thành"
        },
        {
            h: "成",
            v: "Thành"
        },
        {
            h: "晟",
            v: "Thành"
        },
        {
            h: "且",
            v: "Thả"
        },
        {
            h: "貸",
            v: "Thải"
        },
        {
            h: "岱",
            v: "Thải"
        },
        {
            h: "採",
            v: "Thải/Thái"
        },
        {
            h: "采",
            v: "Thải/Thái"
        },
        {
            h: "惨",
            v: "Thảm"
        },
        {
            h: "慘",
            v: "Thảm"
        },
        {
            h: "毯",
            v: "Thảm"
        },
        {
            h: "坦",
            v: "Thản"
        },
        {
            h: "草",
            v: "Thảo"
        },
        {
            h: "討",
            v: "Thảo"
        },
        {
            h: "石",
            v: "Thạch"
        },
        {
            h: "深",
            v: "Thâm"
        },
        {
            h: "紳",
            v: "Thân"
        },
        {
            h: "親",
            v: "Thân"
        },
        {
            h: "身",
            v: "Thân"
        },
        {
            h: "伸",
            v: "Thân"
        },
        {
            h: "申",
            v: "Thân"
        },
        {
            h: "抻",
            v: "Thân"
        },
        {
            h: "呻",
            v: "Thân"
        },
        {
            h: "輸",
            v: "Thâu"
        },
        {
            h: "沁",
            v: "Thấm/Sấm"
        },
        {
            h: "湿",
            v: "Thấp"
        },
        {
            h: "七",
            v: "Thất"
        },
        {
            h: "匹",
            v: "Thất"
        },
        {
            h: "室",
            v: "Thất"
        },
        {
            h: "失",
            v: "Thất"
        },
        {
            h: "透",
            v: "Thấu"
        },
        {
            h: "忱",
            v: "Thầm"
        },
        {
            h: "椹",
            v: "Thầm"
        },
        {
            h: "神",
            v: "Thần"
        },
        {
            h: "臣",
            v: "Thần"
        },
        {
            h: "唇",
            v: "Thần"
        },
        {
            h: "娠",
            v: "Thần"
        },
        {
            h: "榊",
            v: "(Thần)"
        },
        {
            h: "晨",
            v: "Thần"
        },
        {
            h: "宸",
            v: "Thần"
        },
        {
            h: "審",
            v: "Thẩm"
        },
        {
            h: "哂",
            v: "Thẩn"
        },
        {
            h: "甚",
            v: "Thậm"
        },
        {
            h: "慎",
            v: "Thận"
        },
        {
            h: "愼",
            v: "Thận"
        },
        {
            h: "腎",
            v: "Thận"
        },
        {
            h: "十",
            v: "Thập"
        },
        {
            h: "拾",
            v: "Thập"
        },
        {
            h: "什",
            v: "Thập"
        },
        {
            h: "升",
            v: "Thăng"
        },
        {
            h: "昇",
            v: "Thăng"
        },
        {
            h: "勝",
            v: "Thắng"
        },
        {
            h: "縄",
            v: "Thằng"
        },
        {
            h: "剰",
            v: "Thặng"
        },
        {
            h: "剩",
            v: "Thặng"
        },
        {
            h: "妻",
            v: "Thê"
        },
        {
            h: "悽",
            v: "Thê"
        },
        {
            h: "棲",
            v: "Thê"
        },
        {
            h: "栖",
            v: "Thê"
        },
        {
            h: "梯",
            v: "Thê"
        },
        {
            h: "凄",
            v: "Thê"
        },
        {
            h: "淒",
            v: "Thê"
        },
        {
            h: "勢",
            v: "Thế"
        },
        {
            h: "世",
            v: "Thế"
        },
        {
            h: "替",
            v: "Thế"
        },
        {
            h: "涕",
            v: "Thế"
        },
        {
            h: "体",
            v: "Thể"
        },
        {
            h: "躰",
            v: "Thể"
        },
        {
            h: "誓",
            v: "Thệ"
        },
        {
            h: "逝",
            v: "Thệ"
        },
        {
            h: "詩",
            v: "Thi"
        },
        {
            h: "屍",
            v: "Thi"
        },
        {
            h: "施",
            v: "Thi/Thí"
        },
        {
            h: "添",
            v: "Thiêm"
        },
        {
            h: "籤",
            v: "Thiêm"
        },
        {
            h: "僉",
            v: "Thiêm"
        },
        {
            h: "孅",
            v: "Thiêm"
        },
        {
            h: "遷",
            v: "Thiên"
        },
        {
            h: "偏",
            v: "Thiên"
        },
        {
            h: "千",
            v: "Thiên"
        },
        {
            h: "天",
            v: "Thiên"
        },
        {
            h: "篇",
            v: "Thiên"
        },
        {
            h: "仟",
            v: "Thiên"
        },
        {
            h: "焼",
            v: "Thiêu"
        },
        {
            h: "挑",
            v: "Thiêu/Thao"
        },
        {
            h: "茜",
            v: "Thiến"
        },
        {
            h: "倩",
            v: "Thiến"
        },
        {
            h: "妾",
            v: "Thiếp"
        },
        {
            h: "帖",
            v: "Thiếp"
        },
        {
            h: "窃",
            v: "Thiết"
        },
        {
            h: "設",
            v: "Thiết"
        },
        {
            h: "鉄",
            v: "Thiết"
        },
        {
            h: "切",
            v: "Thiết"
        },
        {
            h: "眺",
            v: "Thiếu"
        },
        {
            h: "少",
            v: "Thiếu/Thiểu"
        },
        {
            h: "蟾",
            v: "Thiềm"
        },
        {
            h: "禅",
            v: "Thiền"
        },
        {
            h: "忝",
            v: "Thiểm"
        },
        {
            h: "浅",
            v: "Thiển"
        },
        {
            h: "愀",
            v: "Thiểu"
        },
        {
            h: "繕",
            v: "Thiện"
        },
        {
            h: "善",
            v: "Thiện"
        },
        {
            h: "擅",
            v: "Thiện"
        },
        {
            h: "膳",
            v: "Thiện"
        },
        {
            h: "渉",
            v: "Thiệp"
        },
        {
            h: "舌",
            v: "Thiệt"
        },
        {
            h: "紹",
            v: "Thiệu"
        },
        {
            h: "劭",
            v: "Thiệu"
        },
        {
            h: "試",
            v: "Thí"
        },
        {
            h: "譬",
            v: "Thí"
        },
        {
            h: "啻",
            v: "Thí"
        },
        {
            h: "剃",
            v: "Thí/Thế"
        },
        {
            h: "弑",
            v: "Thí/Thích"
        },
        {
            h: "適",
            v: "Thích"
        },
        {
            h: "釈",
            v: "Thích"
        },
        {
            h: "刺",
            v: "Thích"
        },
        {
            h: "戚",
            v: "Thích"
        },
        {
            h: "朿",
            v: "Thích"
        },
        {
            h: "螫",
            v: "Thích"
        },
        {
            h: "聴",
            v: "Thính"
        },
        {
            h: "听",
            v: "Thính"
        },
        {
            h: "塒",
            v: "Thì"
        },
        {
            h: "辰",
            v: "Thìn/Thần"
        },
        {
            h: "矢",
            v: "Thỉ"
        },
        {
            h: "舐",
            v: "Thỉ"
        },
        {
            h: "屎",
            v: "Thỉ"
        },
        {
            h: "弛",
            v: "Thỉ"
        },
        {
            h: "請",
            v: "Thỉnh"
        },
        {
            h: "氏",
            v: "Thị"
        },
        {
            h: "示",
            v: "Thị"
        },
        {
            h: "視",
            v: "Thị"
        },
        {
            h: "市",
            v: "Thị"
        },
        {
            h: "侍",
            v: "Thị"
        },
        {
            h: "是",
            v: "Thị"
        },
        {
            h: "恃",
            v: "Thị"
        },
        {
            h: "柿",
            v: "Thị"
        },
        {
            h: "嗜",
            v: "Thị"
        },
        {
            h: "帋",
            v: "Thị"
        },
        {
            h: "杮",
            v: "Thị/Sĩ"
        },
        {
            h: "盛",
            v: "Thịnh"
        },
        {
            h: "萩",
            v: "Tho"
        },
        {
            h: "梭",
            v: "Thoa"
        },
        {
            h: "悛",
            v: "Thoan"
        },
        {
            h: "逡",
            v: "Thoái"
        },
        {
            h: "退",
            v: "Thoái/Thối"
        },
        {
            h: "彖",
            v: "Thoán"
        },
        {
            h: "脱",
            v: "Thoát"
        },
        {
            h: "話",
            v: "Thoại"
        },
        {
            h: "唾",
            v: "Thóa"
        },
        {
            h: "妥",
            v: "Thỏa"
        },
        {
            h: "橢",
            v: "Thỏa"
        },
        {
            h: "寿",
            v: "Thọ"
        },
        {
            h: "儔",
            v: "Thọ"
        },
        {
            h: "壽",
            v: "Thọ"
        },
        {
            h: "粗",
            v: "Thô"
        },
        {
            h: "催",
            v: "Thôi"
        },
        {
            h: "崔",
            v: "Thôi"
        },
        {
            h: "村",
            v: "Thôn"
        },
        {
            h: "呑",
            v: "Thôn"
        },
        {
            h: "通",
            v: "Thông"
        },
        {
            h: "聡",
            v: "Thông"
        },
        {
            h: "愡",
            v: "Thông"
        },
        {
            h: "葱",
            v: "Thông"
        },
        {
            h: "匆",
            v: "Thông"
        },
        {
            h: "措",
            v: "Thố"
        },
        {
            h: "醋",
            v: "Thố"
        },
        {
            h: "兎",
            v: "Thố"
        },
        {
            h: "兔",
            v: "Thố"
        },
        {
            h: "伜",
            v: "Thối/Tốt"
        },
        {
            h: "倅",
            v: "Thối/Tốt"
        },
        {
            h: "寸",
            v: "Thốn"
        },
        {
            h: "褪",
            v: "Thốn"
        },
        {
            h: "吋",
            v: "Thốn"
        },
        {
            h: "痛",
            v: "Thống"
        },
        {
            h: "統",
            v: "Thống"
        },
        {
            h: "偬",
            v: "Thống"
        },
        {
            h: "吐",
            v: "Thổ"
        },
        {
            h: "土",
            v: "Thổ"
        },
        {
            h: "忖",
            v: "Thổn"
        },
        {
            h: "時",
            v: "Thời/Thì"
        },
        {
            h: "秋",
            v: "Thu"
        },
        {
            h: "收",
            v: "Thu"
        },
        {
            h: "楸",
            v: "Thu"
        },
        {
            h: "啾",
            v: "Thu"
        },
        {
            h: "収",
            v: "Thu/Thâu"
        },
        {
            h: "瞬",
            v: "Thuấn"
        },
        {
            h: "純",
            v: "Thuần"
        },
        {
            h: "淳",
            v: "Thuần"
        },
        {
            h: "鶉",
            v: "Thuần"
        },
        {
            h: "馴",
            v: "Thuần"
        },
        {
            h: "醇",
            v: "Thuần"
        },
        {
            h: "盾",
            v: "Thuẫn"
        },
        {
            h: "楯",
            v: "Thuẫn"
        },
        {
            h: "順",
            v: "Thuận"
        },
        {
            h: "述",
            v: "Thuật"
        },
        {
            h: "術",
            v: "Thuật"
        },
        {
            h: "朮",
            v: "Thuật/Truật"
        },
        {
            h: "税",
            v: "Thuế"
        },
        {
            h: "毳",
            v: "Thuế/Thúy"
        },
        {
            h: "属",
            v: "Thuộc"
        },
        {
            h: "屬",
            v: "Thuộc"
        },
        {
            h: "痊",
            v: "Thuyên"
        },
        {
            h: "銓",
            v: "Thuyên"
        },
        {
            h: "説",
            v: "Thuyết"
        },
        {
            h: "船",
            v: "Thuyền"
        },
        {
            h: "嬋",
            v: "Thuyền/Thiền"
        },
        {
            h: "狩",
            v: "Thú"
        },
        {
            h: "獣",
            v: "Thú"
        },
        {
            h: "趣",
            v: "Thú"
        },
        {
            h: "戍",
            v: "Thú"
        },
        {
            h: "娵",
            v: "Thú"
        },
        {
            h: "娶",
            v: "Thú"
        },
        {
            h: "束",
            v: "Thúc"
        },
        {
            h: "叔",
            v: "Thúc"
        },
        {
            h: "翠",
            v: "Thúy"
        },
        {
            h: "酬",
            v: "Thù"
        },
        {
            h: "殊",
            v: "Thù"
        },
        {
            h: "殳",
            v: "Thù"
        },
        {
            h: "讎",
            v: "Thù"
        },
        {
            h: "讐",
            v: "Thù"
        },
        {
            h: "洙",
            v: "Thù/Chu"
        },
        {
            h: "垂",
            v: "Thùy"
        },
        {
            h: "誰",
            v: "Thùy"
        },
        {
            h: "捶",
            v: "Thùy"
        },
        {
            h: "埀",
            v: "Thùy"
        },
        {
            h: "取",
            v: "Thủ"
        },
        {
            h: "首",
            v: "Thủ"
        },
        {
            h: "守",
            v: "Thủ"
        },
        {
            h: "手",
            v: "Thủ"
        },
        {
            h: "水",
            v: "Thủy"
        },
        {
            h: "始",
            v: "Thủy"
        },
        {
            h: "腫",
            v: "Thũng"
        },
        {
            h: "樹",
            v: "Thụ"
        },
        {
            h: "綬",
            v: "Thụ"
        },
        {
            h: "售",
            v: "Thụ"
        },
        {
            h: "廚",
            v: "Thụ"
        },
        {
            h: "受",
            v: "Thụ/Thọ"
        },
        {
            h: "授",
            v: "Thụ/Thọ"
        },
        {
            h: "淑",
            v: "Thục"
        },
        {
            h: "熟",
            v: "Thục"
        },
        {
            h: "塾",
            v: "Thục"
        },
        {
            h: "蜀",
            v: "Thục"
        },
        {
            h: "贖",
            v: "Thục"
        },
        {
            h: "孰",
            v: "Thục"
        },
        {
            h: "俶",
            v: "Thục"
        },
        {
            h: "睡",
            v: "Thụy"
        },
        {
            h: "瑞",
            v: "Thụy"
        },
        {
            h: "書",
            v: "Thư"
        },
        {
            h: "雌",
            v: "Thư"
        },
        {
            h: "狙",
            v: "Thư"
        },
        {
            h: "恕",
            v: "Thư"
        },
        {
            h: "蛆",
            v: "Thư"
        },
        {
            h: "疽",
            v: "Thư"
        },
        {
            h: "姐",
            v: "Thư"
        },
        {
            h: "商",
            v: "Thương"
        },
        {
            h: "倉",
            v: "Thương"
        },
        {
            h: "傷",
            v: "Thương"
        },
        {
            h: "愴",
            v: "Thương"
        },
        {
            h: "慯",
            v: "Thương"
        },
        {
            h: "蒼",
            v: "Thương"
        },
        {
            h: "槍",
            v: "Thương"
        },
        {
            h: "殤",
            v: "Thương"
        },
        {
            h: "鑠",
            v: "Thước"
        },
        {
            h: "常",
            v: "Thường"
        },
        {
            h: "裳",
            v: "Thường"
        },
        {
            h: "嫦",
            v: "Thường"
        },
        {
            h: "嘗",
            v: "Thường/Thưởng"
        },
        {
            h: "償",
            v: "Thưởng"
        },
        {
            h: "賞",
            v: "Thưởng"
        },
        {
            h: "上",
            v: "Thượng"
        },
        {
            h: "尚",
            v: "Thượng"
        },
        {
            h: "次",
            v: "Thứ"
        },
        {
            h: "庶",
            v: "Thứ"
        },
        {
            h: "咨",
            v: "Thứ"
        },
        {
            h: "識",
            v: "Thức"
        },
        {
            h: "式",
            v: "Thức"
        },
        {
            h: "拭",
            v: "Thức"
        },
        {
            h: "鷲",
            v: "Thứu"
        },
        {
            h: "蜍",
            v: "Thừ"
        },
        {
            h: "承",
            v: "Thừa"
        },
        {
            h: "乗",
            v: "Thừa"
        },
        {
            h: "丞",
            v: "Thừa"
        },
        {
            h: "乘",
            v: "Thừa"
        },
        {
            h: "暑",
            v: "Thử"
        },
        {
            h: "黍",
            v: "Thử"
        },
        {
            h: "此",
            v: "Thử"
        },
        {
            h: "鼠",
            v: "Thử"
        },
        {
            h: "署",
            v: "Thự"
        },
        {
            h: "曙",
            v: "Thự"
        },
        {
            h: "墅",
            v: "Thự"
        },
        {
            h: "食",
            v: "Thực"
        },
        {
            h: "実",
            v: "Thực"
        },
        {
            h: "植",
            v: "Thực"
        },
        {
            h: "殖",
            v: "Thực"
        },
        {
            h: "蝕",
            v: "Thực"
        },
        {
            h: "寔",
            v: "Thực"
        },
        {
            h: "實",
            v: "Thực"
        },
        {
            h: "殱",
            v: "Tiêm"
        },
        {
            h: "殲",
            v: "Tiêm"
        },
        {
            h: "尖",
            v: "Tiêm"
        },
        {
            h: "仙",
            v: "Tiên"
        },
        {
            h: "鮮",
            v: "Tiên"
        },
        {
            h: "先",
            v: "Tiên"
        },
        {
            h: "戔",
            v: "Tiên"
        },
        {
            h: "僊",
            v: "Tiên"
        },
        {
            h: "涎",
            v: "Tiên/Diện/Duyên"
        },
        {
            h: "煎",
            v: "Tiên/Tiễn"
        },
        {
            h: "消",
            v: "Tiêu"
        },
        {
            h: "硝",
            v: "Tiêu"
        },
        {
            h: "焦",
            v: "Tiêu"
        },
        {
            h: "宵",
            v: "Tiêu"
        },
        {
            h: "肖",
            v: "Tiêu"
        },
        {
            h: "標",
            v: "Tiêu"
        },
        {
            h: "悄",
            v: "Tiêu"
        },
        {
            h: "椒",
            v: "Tiêu"
        },
        {
            h: "銷",
            v: "Tiêu"
        },
        {
            h: "鮹",
            v: "Tiêu"
        },
        {
            h: "哨",
            v: "Tiêu"
        },
        {
            h: "霄",
            v: "Tiêu"
        },
        {
            h: "逍",
            v: "Tiêu"
        },
        {
            h: "僣",
            v: "Tiếm"
        },
        {
            h: "僭",
            v: "Tiếm"
        },
        {
            h: "薦",
            v: "Tiến"
        },
        {
            h: "進",
            v: "Tiến/Tấn"
        },
        {
            h: "接",
            v: "Tiếp"
        },
        {
            h: "楫",
            v: "Tiếp"
        },
        {
            h: "椄",
            v: "Tiếp"
        },
        {
            h: "浹",
            v: "Tiếp"
        },
        {
            h: "季",
            v: "Tiết"
        },
        {
            h: "節",
            v: "Tiết"
        },
        {
            h: "楔",
            v: "Tiết"
        },
        {
            h: "褻",
            v: "Tiết"
        },
        {
            h: "卩",
            v: "Tiết"
        },
        {
            h: "洩",
            v: "Tiết"
        },
        {
            h: "屑",
            v: "Tiết"
        },
        {
            h: "泌",
            v: "Tiết/Bí"
        },
        {
            h: "泄",
            v: "Tiết/Duệ"
        },
        {
            h: "笑",
            v: "Tiếu"
        },
        {
            h: "咲",
            v: "Tiếu"
        },
        {
            h: "峭",
            v: "Tiếu/Tiễu"
        },
        {
            h: "潜",
            v: "Tiềm"
        },
        {
            h: "銭",
            v: "Tiền"
        },
        {
            h: "前",
            v: "Tiền"
        },
        {
            h: "礁",
            v: "Tiều"
        },
        {
            h: "憔",
            v: "Tiều"
        },
        {
            h: "樵",
            v: "Tiều"
        },
        {
            h: "晁",
            v: "Tiều"
        },
        {
            h: "銑",
            v: "Tiển"
        },
        {
            h: "癬",
            v: "Tiển"
        },
        {
            h: "蘚",
            v: "Tiển"
        },
        {
            h: "小",
            v: "Tiểu"
        },
        {
            h: "践",
            v: "Tiễn"
        },
        {
            h: "揃",
            v: "Tiễn"
        },
        {
            h: "擶",
            v: "Tiễn"
        },
        {
            h: "翦",
            v: "Tiễn"
        },
        {
            h: "剿",
            v: "Tiễu"
        },
        {
            h: "勦",
            v: "Tiễu"
        },
        {
            h: "繊",
            v: "Tiệm"
        },
        {
            h: "漸",
            v: "Tiệm/Tiêm"
        },
        {
            h: "便",
            v: "Tiện"
        },
        {
            h: "剪",
            v: "Tiện"
        },
        {
            h: "捷",
            v: "Tiệp"
        },
        {
            h: "精",
            v: "Tinh"
        },
        {
            h: "星",
            v: "Tinh"
        },
        {
            h: "晶",
            v: "Tinh"
        },
        {
            h: "惺",
            v: "Tinh"
        },
        {
            h: "旌",
            v: "Tinh"
        },
        {
            h: "蜻",
            v: "Tinh"
        },
        {
            h: "潟",
            v: "Tích"
        },
        {
            h: "積",
            v: "Tích"
        },
        {
            h: "績",
            v: "Tích"
        },
        {
            h: "跡",
            v: "Tích"
        },
        {
            h: "惜",
            v: "Tích"
        },
        {
            h: "昔",
            v: "Tích"
        },
        {
            h: "析",
            v: "Tích"
        },
        {
            h: "錫",
            v: "Tích"
        },
        {
            h: "晰",
            v: "Tích"
        },
        {
            h: "癪",
            v: "Tích"
        },
        {
            h: "瘠",
            v: "Tích"
        },
        {
            h: "蜥",
            v: "Tích"
        },
        {
            h: "勣",
            v: "Tích"
        },
        {
            h: "信",
            v: "Tín"
        },
        {
            h: "併",
            v: "Tính"
        },
        {
            h: "并",
            v: "Tính"
        },
        {
            h: "姓",
            v: "Tính/Tánh"
        },
        {
            h: "性",
            v: "Tính/Tánh"
        },
        {
            h: "情",
            v: "Tình"
        },
        {
            h: "晴",
            v: "Tình"
        },
        {
            h: "睛",
            v: "Tình"
        },
        {
            h: "省",
            v: "Tỉnh"
        },
        {
            h: "井",
            v: "Tỉnh"
        },
        {
            h: "静",
            v: "Tĩnh"
        },
        {
            h: "靖",
            v: "Tĩnh"
        },
        {
            h: "籍",
            v: "Tịch"
        },
        {
            h: "夕",
            v: "Tịch"
        },
        {
            h: "寂",
            v: "Tịch"
        },
        {
            h: "席",
            v: "Tịch"
        },
        {
            h: "汐",
            v: "Tịch"
        },
        {
            h: "僻",
            v: "Tịch"
        },
        {
            h: "浄",
            v: "Tịnh"
        },
        {
            h: "並",
            v: "Tịnh"
        },
        {
            h: "唆",
            v: "Toa"
        },
        {
            h: "酸",
            v: "Toan"
        },
        {
            h: "砕",
            v: "Toái"
        },
        {
            h: "算",
            v: "Toán"
        },
        {
            h: "撮",
            v: "Toát"
        },
        {
            h: "全",
            v: "Toàn"
        },
        {
            h: "旋",
            v: "Toàn"
        },
        {
            h: "遂",
            v: "Toại"
        },
        {
            h: "鎖",
            v: "Tỏa"
        },
        {
            h: "挫",
            v: "Tỏa"
        },
        {
            h: "座",
            v: "Tọa"
        },
        {
            h: "坐",
            v: "Tọa"
        },
        {
            h: "租",
            v: "Tô"
        },
        {
            h: "蘇",
            v: "Tô"
        },
        {
            h: "尊",
            v: "Tôn"
        },
        {
            h: "孫",
            v: "Tôn"
        },
        {
            h: "宗",
            v: "Tôn"
        },
        {
            h: "樽",
            v: "Tôn"
        },
        {
            h: "棕",
            v: "Tông"
        },
        {
            h: "椶",
            v: "Tông"
        },
        {
            h: "素",
            v: "Tố"
        },
        {
            h: "訴",
            v: "Tố"
        },
        {
            h: "塑",
            v: "Tố"
        },
        {
            h: "愬",
            v: "Tố"
        },
        {
            h: "泝",
            v: "Tố"
        },
        {
            h: "溯",
            v: "Tố"
        },
        {
            h: "遡",
            v: "Tố"
        },
        {
            h: "做",
            v: "Tố"
        },
        {
            h: "速",
            v: "Tốc"
        },
        {
            h: "最",
            v: "Tối"
        },
        {
            h: "巽",
            v: "Tốn"
        },
        {
            h: "遜",
            v: "Tốn"
        },
        {
            h: "送",
            v: "Tống"
        },
        {
            h: "宋",
            v: "Tống"
        },
        {
            h: "卒",
            v: "Tốt"
        },
        {
            h: "埣",
            v: "Tốt"
        },
        {
            h: "徂",
            v: "Tồ"
        },
        {
            h: "摧",
            v: "Tồi"
        },
        {
            h: "存",
            v: "Tồn"
        },
        {
            h: "拵",
            v: "Tồn"
        },
        {
            h: "祖",
            v: "Tổ"
        },
        {
            h: "組",
            v: "Tổ"
        },
        {
            h: "俎",
            v: "Tổ"
        },
        {
            h: "岨",
            v: "Tổ"
        },
        {
            h: "損",
            v: "Tổn"
        },
        {
            h: "総",
            v: "Tổng"
        },
        {
            h: "族",
            v: "Tộc"
        },
        {
            h: "罪",
            v: "Tội"
        },
        {
            h: "査",
            v: "Tra"
        },
        {
            h: "槎",
            v: "Tra"
        },
        {
            h: "斎",
            v: "Trai"
        },
        {
            h: "粧",
            v: "Trang"
        },
        {
            h: "装",
            v: "Trang"
        },
        {
            h: "庄",
            v: "Trang"
        },
        {
            h: "奘",
            v: "Trang"
        },
        {
            h: "妝",
            v: "Trang"
        },
        {
            h: "荘",
            v: "Tranh"
        },
        {
            h: "争",
            v: "Tranh"
        },
        {
            h: "崢",
            v: "Tranh"
        },
        {
            h: "詐",
            v: "Trá"
        },
        {
            h: "搾",
            v: "Trá"
        },
        {
            h: "咋",
            v: "Trá"
        },
        {
            h: "咤",
            v: "Trá"
        },
        {
            h: "卓",
            v: "Trác"
        },
        {
            h: "倬",
            v: "Trác"
        },
        {
            h: "啅",
            v: "Trác"
        },
        {
            h: "啄",
            v: "Trác"
        },
        {
            h: "琢",
            v: "Trác/Chác"
        },
        {
            h: "責",
            v: "Trách"
        },
        {
            h: "窄",
            v: "Trách"
        },
        {
            h: "嘖",
            v: "Trách"
        },
        {
            h: "債",
            v: "Trái"
        },
        {
            h: "壮",
            v: "Tráng"
        },
        {
            h: "壯",
            v: "Tráng"
        },
        {
            h: "弉",
            v: "Tráng"
        },
        {
            h: "扱",
            v: "Tráp"
        },
        {
            h: "札",
            v: "Trát"
        },
        {
            h: "扎",
            v: "Trát"
        },
        {
            h: "茶",
            v: "Trà"
        },
        {
            h: "撞",
            v: "Tràng"
        },
        {
            h: "幢",
            v: "Tràng"
        },
        {
            h: "嘲",
            v: "Trào"
        },
        {
            h: "盞",
            v: "Trản"
        },
        {
            h: "找",
            v: "Trảo"
        },
        {
            h: "抓",
            v: "Trảo"
        },
        {
            h: "爪",
            v: "Trảo"
        },
        {
            h: "濯",
            v: "Trạc"
        },
        {
            h: "擢",
            v: "Trạc"
        },
        {
            h: "沢",
            v: "Trạch"
        },
        {
            h: "宅",
            v: "Trạch"
        },
        {
            h: "択",
            v: "Trạch"
        },
        {
            h: "擇",
            v: "Trạch"
        },
        {
            h: "砦",
            v: "Trại"
        },
        {
            h: "寨",
            v: "Trại"
        },
        {
            h: "状",
            v: "Trạng"
        },
        {
            h: "棹",
            v: "Trạo"
        },
        {
            h: "櫂",
            v: "Trạo/Trạc"
        },
        {
            h: "珍",
            v: "Trân"
        },
        {
            h: "鎮",
            v: "Trấn"
        },
        {
            h: "廿",
            v: "Trấp/Niệm"
        },
        {
            h: "窒",
            v: "Trất"
        },
        {
            h: "桎",
            v: "Trất"
        },
        {
            h: "櫛",
            v: "Trất"
        },
        {
            h: "沈",
            v: "Trầm"
        },
        {
            h: "陳",
            v: "Trần"
        },
        {
            h: "塵",
            v: "Trần"
        },
        {
            h: "怎",
            v: "Trẩm/Chẫm"
        },
        {
            h: "朕",
            v: "Trẫm"
        },
        {
            h: "陣",
            v: "Trận"
        },
        {
            h: "秩",
            v: "Trật"
        },
        {
            h: "帙",
            v: "Trật"
        },
        {
            h: "榛",
            v: "Trăn"
        },
        {
            h: "測",
            v: "Trắc"
        },
        {
            h: "側",
            v: "Trắc"
        },
        {
            h: "仄",
            v: "Trắc"
        },
        {
            h: "惻",
            v: "Trắc"
        },
        {
            h: "昃",
            v: "Trắc"
        },
        {
            h: "滞",
            v: "Trệ"
        },
        {
            h: "知",
            v: "Tri"
        },
        {
            h: "蜘",
            v: "Tri"
        },
        {
            h: "沾",
            v: "Triêm/Điếp"
        },
        {
            h: "哲",
            v: "Triết"
        },
        {
            h: "折",
            v: "Triết"
        },
        {
            h: "浙",
            v: "Triết"
        },
        {
            h: "纏",
            v: "Triền"
        },
        {
            h: "壥",
            v: "Triền"
        },
        {
            h: "廛",
            v: "Triền"
        },
        {
            h: "潮",
            v: "Triều/Trào"
        },
        {
            h: "朝",
            v: "Triều/Triêu"
        },
        {
            h: "展",
            v: "Triển"
        },
        {
            h: "篆",
            v: "Triện"
        },
        {
            h: "摺",
            v: "Triệp"
        },
        {
            h: "徹",
            v: "Triệt"
        },
        {
            h: "撤",
            v: "Triệt"
        },
        {
            h: "屮",
            v: "Triệt"
        },
        {
            h: "兆",
            v: "Triệu"
        },
        {
            h: "召",
            v: "Triệu"
        },
        {
            h: "趙",
            v: "Triệu"
        },
        {
            h: "肇",
            v: "Triệu"
        },
        {
            h: "偵",
            v: "Trinh"
        },
        {
            h: "貞",
            v: "Trinh"
        },
        {
            h: "禎",
            v: "Trinh"
        },
        {
            h: "幀",
            v: "Trinh"
        },
        {
            h: "置",
            v: "Trí"
        },
        {
            h: "致",
            v: "Trí"
        },
        {
            h: "智",
            v: "Trí"
        },
        {
            h: "摘",
            v: "Trích"
        },
        {
            h: "滴",
            v: "Trích/Đích"
        },
        {
            h: "池",
            v: "Trì"
        },
        {
            h: "遅",
            v: "Trì"
        },
        {
            h: "持",
            v: "Trì"
        },
        {
            h: "程",
            v: "Trình"
        },
        {
            h: "呈",
            v: "Trình"
        },
        {
            h: "稚",
            v: "Trĩ"
        },
        {
            h: "痔",
            v: "Trĩ"
        },
        {
            h: "峙",
            v: "Trĩ"
        },
        {
            h: "治",
            v: "Trị"
        },
        {
            h: "値",
            v: "Trị"
        },
        {
            h: "擲",
            v: "Trịch"
        },
        {
            h: "濁",
            v: "Trọc"
        },
        {
            h: "仲",
            v: "Trọng"
        },
        {
            h: "重",
            v: "Trọng/Trùng"
        },
        {
            h: "戳",
            v: "Trốc"
        },
        {
            h: "阻",
            v: "Trở"
        },
        {
            h: "齟",
            v: "Trở"
        },
        {
            h: "助",
            v: "Trợ"
        },
        {
            h: "黜",
            v: "Truất"
        },
        {
            h: "中",
            v: "Trung"
        },
        {
            h: "衷",
            v: "Trung"
        },
        {
            h: "忠",
            v: "Trung"
        },
        {
            h: "追",
            v: "Truy"
        },
        {
            h: "椎",
            v: "Truy"
        },
        {
            h: "夊",
            v: "Truy"
        },
        {
            h: "夂",
            v: "Truy"
        },
        {
            h: "錘",
            v: "Truy/Trúy"
        },
        {
            h: "伝",
            v: "Truyền"
        },
        {
            h: "傳",
            v: "Truyền/Truyện"
        },
        {
            h: "駐",
            v: "Trú"
        },
        {
            h: "昼",
            v: "Trú"
        },
        {
            h: "晝",
            v: "Trú"
        },
        {
            h: "住",
            v: "Trú/Trụ"
        },
        {
            h: "竹",
            v: "Trúc"
        },
        {
            h: "築",
            v: "Trúc"
        },
        {
            h: "竺",
            v: "Trúc/Đốc"
        },
        {
            h: "厨",
            v: "Trù"
        },
        {
            h: "惆",
            v: "Trù"
        },
        {
            h: "躊",
            v: "Trù"
        },
        {
            h: "虫",
            v: "Trùng"
        },
        {
            h: "塚",
            v: "Trủng"
        },
        {
            h: "冢",
            v: "Trủng"
        },
        {
            h: "匕",
            v: "Trủy/Chủy"
        },
        {
            h: "宙",
            v: "Trụ"
        },
        {
            h: "柱",
            v: "Trụ"
        },
        {
            h: "軸",
            v: "Trục"
        },
        {
            h: "逐",
            v: "Trục"
        },
        {
            h: "墜",
            v: "Trụy"
        },
        {
            h: "徴",
            v: "Trưng"
        },
        {
            h: "張",
            v: "Trương"
        },
        {
            h: "帳",
            v: "Trương/Trướng"
        },
        {
            h: "着",
            v: "Trước"
        },
        {
            h: "著",
            v: "Trước"
        },
        {
            h: "脹",
            v: "Trướng"
        },
        {
            h: "悵",
            v: "Trướng"
        },
        {
            h: "長",
            v: "Trường"
        },
        {
            h: "場",
            v: "Trường"
        },
        {
            h: "塲",
            v: "Trường"
        },
        {
            h: "腸",
            v: "Trường/Tràng"
        },
        {
            h: "丈",
            v: "Trượng"
        },
        {
            h: "杖",
            v: "Trượng"
        },
        {
            h: "仗",
            v: "Trượng"
        },
        {
            h: "辷",
            v: "(Trượt)"
        },
        {
            h: "除",
            v: "Trừ"
        },
        {
            h: "躇",
            v: "Trừ"
        },
        {
            h: "儲",
            v: "Trừ/Trữ"
        },
        {
            h: "澄",
            v: "Trừng"
        },
        {
            h: "懲",
            v: "Trừng"
        },
        {
            h: "抽",
            v: "Trừu"
        },
        {
            h: "箒",
            v: "Trửu"
        },
        {
            h: "帚",
            v: "Trửu"
        },
        {
            h: "貯",
            v: "Trữ"
        },
        {
            h: "抒",
            v: "Trữ"
        },
        {
            h: "杼",
            v: "Trữ"
        },
        {
            h: "佇",
            v: "Trữ"
        },
        {
            h: "直",
            v: "Trực"
        },
        {
            h: "埴",
            v: "Trực"
        },
        {
            h: "修",
            v: "Tu"
        },
        {
            h: "脩",
            v: "Tu"
        },
        {
            h: "須",
            v: "Tu"
        },
        {
            h: "羞",
            v: "Tu"
        },
        {
            h: "蓚",
            v: "Tu"
        },
        {
            h: "遵",
            v: "Tuân"
        },
        {
            h: "洵",
            v: "Tuân"
        },
        {
            h: "恂",
            v: "Tuân"
        },
        {
            h: "徇",
            v: "Tuân"
        },
        {
            h: "俊",
            v: "Tuấn"
        },
        {
            h: "駿",
            v: "Tuấn"
        },
        {
            h: "峻",
            v: "Tuấn"
        },
        {
            h: "儁",
            v: "Tuấn"
        },
        {
            h: "浚",
            v: "Tuấn"
        },
        {
            h: "戌",
            v: "Tuất"
        },
        {
            h: "恤",
            v: "Tuất"
        },
        {
            h: "巡",
            v: "Tuần"
        },
        {
            h: "旬",
            v: "Tuần"
        },
        {
            h: "循",
            v: "Tuần"
        },
        {
            h: "殉",
            v: "Tuẫn"
        },
        {
            h: "歳",
            v: "Tuế"
        },
        {
            h: "穂",
            v: "Tuệ"
        },
        {
            h: "慧",
            v: "Tuệ"
        },
        {
            h: "彗",
            v: "Tuệ"
        },
        {
            h: "縦",
            v: "Tung"
        },
        {
            h: "嵩",
            v: "Tung"
        },
        {
            h: "樅",
            v: "Tung"
        },
        {
            h: "宣",
            v: "Tuyên"
        },
        {
            h: "亘",
            v: "Tuyên"
        },
        {
            h: "線",
            v: "Tuyến"
        },
        {
            h: "腺",
            v: "Tuyến"
        },
        {
            h: "雪",
            v: "Tuyết"
        },
        {
            h: "鱈",
            v: "Tuyết"
        },
        {
            h: "泉",
            v: "Tuyền"
        },
        {
            h: "選",
            v: "Tuyển"
        },
        {
            h: "絶",
            v: "Tuyệt"
        },
        {
            h: "秀",
            v: "Tú"
        },
        {
            h: "足",
            v: "Túc"
        },
        {
            h: "粛",
            v: "Túc"
        },
        {
            h: "捉",
            v: "Túc"
        },
        {
            h: "粟",
            v: "Túc"
        },
        {
            h: "肅",
            v: "Túc"
        },
        {
            h: "夙",
            v: "Túc"
        },
        {
            h: "槭",
            v: "Túc/Sắc"
        },
        {
            h: "宿",
            v: "Túc/Tú"
        },
        {
            h: "蹙",
            v: "Túc/Xúc"
        },
        {
            h: "粋",
            v: "Túy"
        },
        {
            h: "酔",
            v: "Túy"
        },
        {
            h: "囚",
            v: "Tù"
        },
        {
            h: "泅",
            v: "Tù"
        },
        {
            h: "酋",
            v: "Tù"
        },
        {
            h: "松",
            v: "Tùng"
        },
        {
            h: "枩",
            v: "Tùng"
        },
        {
            h: "従",
            v: "Tùng/Tòng"
        },
        {
            h: "從",
            v: "Tùng/Tòng"
        },
        {
            h: "叢",
            v: "Tùng/Tòng"
        },
        {
            h: "从",
            v: "Tùng/Tòng"
        },
        {
            h: "随",
            v: "Tùy"
        },
        {
            h: "隋",
            v: "Tùy/Đọa"
        },
        {
            h: "悚",
            v: "Tủng"
        },
        {
            h: "慫",
            v: "Tủng"
        },
        {
            h: "髄",
            v: "Tủy"
        },
        {
            h: "袖",
            v: "Tụ"
        },
        {
            h: "聚",
            v: "Tụ"
        },
        {
            h: "続",
            v: "Tục"
        },
        {
            h: "俗",
            v: "Tục"
        },
        {
            h: "訟",
            v: "Tụng"
        },
        {
            h: "頌",
            v: "Tụng"
        },
        {
            h: "誦",
            v: "Tụng"
        },
        {
            h: "膵",
            v: "Tụy"
        },
        {
            h: "悴",
            v: "Tụy"
        },
        {
            h: "瘁",
            v: "Tụy"
        },
        {
            h: "滋",
            v: "Tư"
        },
        {
            h: "思",
            v: "Tư"
        },
        {
            h: "私",
            v: "Tư"
        },
        {
            h: "資",
            v: "Tư"
        },
        {
            h: "姿",
            v: "Tư"
        },
        {
            h: "恣",
            v: "Tư"
        },
        {
            h: "斯",
            v: "Tư"
        },
        {
            h: "髭",
            v: "Tư"
        },
        {
            h: "廝",
            v: "Tư"
        },
        {
            h: "偲",
            v: "Tư"
        },
        {
            h: "孜",
            v: "Tư"
        },
        {
            h: "司",
            v: "Tư/Ty"
        },
        {
            h: "醬",
            v: "Tương"
        },
        {
            h: "竦",
            v: "Tương"
        },
        {
            h: "漿",
            v: "Tương"
        },
        {
            h: "箱",
            v: "Tương/Sương"
        },
        {
            h: "相",
            v: "Tương/Tướng"
        },
        {
            h: "將",
            v: "Tương/Tướng"
        },
        {
            h: "爵",
            v: "Tước"
        },
        {
            h: "削",
            v: "Tước"
        },
        {
            h: "雀",
            v: "Tước"
        },
        {
            h: "嚼",
            v: "Tước"
        },
        {
            h: "将",
            v: "Tướng/Tương"
        },
        {
            h: "祥",
            v: "Tường"
        },
        {
            h: "詳",
            v: "Tường"
        },
        {
            h: "翔",
            v: "Tường"
        },
        {
            h: "檣",
            v: "Tường"
        },
        {
            h: "墻",
            v: "Tường"
        },
        {
            h: "庠",
            v: "Tường"
        },
        {
            h: "薔",
            v: "Tường/Sắc"
        },
        {
            h: "奨",
            v: "Tưởng"
        },
        {
            h: "想",
            v: "Tưởng"
        },
        {
            h: "奬",
            v: "Tưởng"
        },
        {
            h: "象",
            v: "Tượng"
        },
        {
            h: "像",
            v: "Tượng"
        },
        {
            h: "匠",
            v: "Tượng"
        },
        {
            h: "橡",
            v: "Tượng"
        },
        {
            h: "掫",
            v: "Tưu"
        },
        {
            h: "賜",
            v: "Tứ"
        },
        {
            h: "四",
            v: "Tứ"
        },
        {
            h: "泗",
            v: "Tứ"
        },
        {
            h: "息",
            v: "Tức"
        },
        {
            h: "即",
            v: "Tức"
        },
        {
            h: "喞",
            v: "Tức"
        },
        {
            h: "磁",
            v: "Từ"
        },
        {
            h: "辞",
            v: "Từ"
        },
        {
            h: "詞",
            v: "Từ"
        },
        {
            h: "慈",
            v: "Từ"
        },
        {
            h: "徐",
            v: "Từ"
        },
        {
            h: "孳",
            v: "Từ"
        },
        {
            h: "祠",
            v: "Từ"
        },
        {
            h: "紫",
            v: "Tử"
        },
        {
            h: "死",
            v: "Tử"
        },
        {
            h: "辻",
            v: "Tử"
        },
        {
            h: "梓",
            v: "Tử"
        },
        {
            h: "子",
            v: "Tử/Tý"
        },
        {
            h: "酒",
            v: "Tửu"
        },
        {
            h: "緒",
            v: "Tự"
        },
        {
            h: "自",
            v: "Tự"
        },
        {
            h: "似",
            v: "Tự"
        },
        {
            h: "飼",
            v: "Tự"
        },
        {
            h: "叙",
            v: "Tự"
        },
        {
            h: "嗣",
            v: "Tự"
        },
        {
            h: "寺",
            v: "Tự"
        },
        {
            h: "字",
            v: "Tự"
        },
        {
            h: "序",
            v: "Tự"
        },
        {
            h: "敘",
            v: "Tự"
        },
        {
            h: "敍",
            v: "Tự"
        },
        {
            h: "沮",
            v: "Tự/Trở/Thư"
        },
        {
            h: "就",
            v: "Tựu"
        },
        {
            h: "諮",
            v: "Ty"
        },
        {
            h: "呰",
            v: "Ty/Ta"
        },
        {
            h: "卑",
            v: "Ty/Ti"
        },
        {
            h: "漬",
            v: "Tý"
        },
        {
            h: "庇",
            v: "Tý"
        },
        {
            h: "茨",
            v: "Tỳ/Tì"
        },
        {
            h: "枇",
            v: "Tỳ/Tì"
        },
        {
            h: "疵",
            v: "Tỳ/Tì"
        },
        {
            h: "脾",
            v: "Tỳ/Tì"
        },
        {
            h: "琵",
            v: "Tỳ/Tì"
        },
        {
            h: "婢",
            v: "Tỳ/Tì"
        },
        {
            h: "璽",
            v: "Tỷ"
        },
        {
            h: "妣",
            v: "Tỷ"
        },
        {
            h: "姉",
            v: "Tỷ/Tỉ"
        },
        {
            h: "俾",
            v: "Tỷ/Tỉ"
        },
        {
            h: "比",
            v: "Tỷ/Tỉ/Bỉ"
        },
        {
            h: "伺",
            v: "Tỷ/Tứ"
        },
        {
            h: "避",
            v: "Tỵ"
        },
        {
            h: "鼻",
            v: "Tỵ"
        },
        {
            h: "巳",
            v: "Tỵ"
        },
        {
            h: "嚊",
            v: "Tỵ"
        },
        {
            h: "幽",
            v: "U"
        },
        {
            h: "欝",
            v: "Uất"
        },
        {
            h: "鬱",
            v: "Uất"
        },
        {
            h: "壅",
            v: "Ung"
        },
        {
            h: "癰",
            v: "Ung"
        },
        {
            h: "廱",
            v: "Ung"
        },
        {
            h: "汪",
            v: "Uông"
        },
        {
            h: "枉",
            v: "Uổng"
        },
        {
            h: "威",
            v: "Uy"
        },
        {
            h: "淵",
            v: "Uyên"
        },
        {
            h: "宛",
            v: "Uyển"
        },
        {
            h: "苑",
            v: "Uyển"
        },
        {
            h: "蜿",
            v: "Uyển"
        },
        {
            h: "婉",
            v: "Uyển"
        },
        {
            h: "尉",
            v: "Uý"
        },
        {
            h: "慰",
            v: "Uý"
        },
        {
            h: "郁",
            v: "Úc"
        },
        {
            h: "甕",
            v: "Úng"
        },
        {
            h: "萎",
            v: "Ùy"
        },
        {
            h: "傴",
            v: "Ủ"
        },
        {
            h: "擁",
            v: "Ủng"
        },
        {
            h: "委",
            v: "Ủy"
        },
        {
            h: "於",
            v: "Ư"
        },
        {
            h: "唹",
            v: "Ư"
        },
        {
            h: "鷹",
            v: "Ưng"
        },
        {
            h: "膺",
            v: "Ưng"
        },
        {
            h: "央",
            v: "Ương"
        },
        {
            h: "殃",
            v: "Ương"
        },
        {
            h: "泱",
            v: "Ương/Áng"
        },
        {
            h: "約",
            v: "Ước"
        },
        {
            h: "妁",
            v: "Ước"
        },
        {
            h: "怏",
            v: "Ưởng"
        },
        {
            h: "優",
            v: "Ưu"
        },
        {
            h: "憂",
            v: "Ưu"
        },
        {
            h: "億",
            v: "Ức"
        },
        {
            h: "憶",
            v: "Ức"
        },
        {
            h: "抑",
            v: "Ức"
        },
        {
            h: "臆",
            v: "Ức"
        },
        {
            h: "応",
            v: "Ứng"
        },
        {
            h: "應",
            v: "Ứng"
        },
        {
            h: "黝",
            v: "Ửu"
        },
        {
            h: "蠑",
            v: "Vanh"
        },
        {
            h: "晩",
            v: "Vãn"
        },
        {
            h: "挽",
            v: "Vãn"
        },
        {
            h: "往",
            v: "Vãng"
        },
        {
            h: "万",
            v: "Vạn"
        },
        {
            h: "卍",
            v: "Vạn"
        },
        {
            h: "雲",
            v: "Vân"
        },
        {
            h: "云",
            v: "Vân"
        },
        {
            h: "問",
            v: "Vấn"
        },
        {
            h: "殞",
            v: "Vẫn"
        },
        {
            h: "刎",
            v: "Vẫn"
        },
        {
            h: "吻",
            v: "Vẫn"
        },
        {
            h: "運",
            v: "Vận"
        },
        {
            h: "韻",
            v: "Vận"
        },
        {
            h: "物",
            v: "Vật"
        },
        {
            h: "惣",
            v: "Vật"
        },
        {
            h: "勿",
            v: "Vật"
        },
        {
            h: "紋",
            v: "Văn"
        },
        {
            h: "蚊",
            v: "Văn"
        },
        {
            h: "聞",
            v: "Văn"
        },
        {
            h: "文",
            v: "Văn"
        },
        {
            h: "紊",
            v: "Vặn"
        },
        {
            h: "衛",
            v: "Vệ"
        },
        {
            h: "衞",
            v: "Vệ"
        },
        {
            h: "違",
            v: "Vi"
        },
        {
            h: "囲",
            v: "Vi"
        },
        {
            h: "為",
            v: "Vi"
        },
        {
            h: "微",
            v: "Vi"
        },
        {
            h: "葦",
            v: "Vi"
        },
        {
            h: "薇",
            v: "Vi"
        },
        {
            h: "囗",
            v: "Vi"
        },
        {
            h: "圍",
            v: "Vi"
        },
        {
            h: "幃",
            v: "Vi"
        },
        {
            h: "炎",
            v: "Viêm"
        },
        {
            h: "猿",
            v: "Viên"
        },
        {
            h: "円",
            v: "Viên"
        },
        {
            h: "員",
            v: "Viên"
        },
        {
            h: "園",
            v: "Viên"
        },
        {
            h: "垣",
            v: "Viên"
        },
        {
            h: "圓",
            v: "Viên"
        },
        {
            h: "袁",
            v: "Viên"
        },
        {
            h: "曰",
            v: "Viết"
        },
        {
            h: "遠",
            v: "Viễn"
        },
        {
            h: "院",
            v: "Viện"
        },
        {
            h: "媛",
            v: "Viện"
        },
        {
            h: "援",
            v: "Viện/Viên"
        },
        {
            h: "越",
            v: "Việt"
        },
        {
            h: "戉",
            v: "Việt"
        },
        {
            h: "粤",
            v: "Việt"
        },
        {
            h: "栄",
            v: "Vinh"
        },
        {
            h: "榮",
            v: "Vinh"
        },
        {
            h: "緯",
            v: "Vĩ"
        },
        {
            h: "偉",
            v: "Vĩ"
        },
        {
            h: "尾",
            v: "Vĩ"
        },
        {
            h: "梶",
            v: "Vĩ"
        },
        {
            h: "永",
            v: "Vĩnh"
        },
        {
            h: "胃",
            v: "Vị"
        },
        {
            h: "位",
            v: "Vị"
        },
        {
            h: "味",
            v: "Vị"
        },
        {
            h: "蝟",
            v: "Vị"
        },
        {
            h: "喟",
            v: "Vị"
        },
        {
            h: "未",
            v: "Vị/Mùi"
        },
        {
            h: "泳",
            v: "Vịnh"
        },
        {
            h: "詠",
            v: "Vịnh"
        },
        {
            h: "咏",
            v: "Vịnh"
        },
        {
            h: "忘",
            v: "Vong"
        },
        {
            h: "亡",
            v: "Vong/Vô"
        },
        {
            h: "網",
            v: "Võng"
        },
        {
            h: "惘",
            v: "Võng"
        },
        {
            h: "网",
            v: "Võng"
        },
        {
            h: "魍",
            v: "Võng"
        },
        {
            h: "罔",
            v: "Võng"
        },
        {
            h: "望",
            v: "Vọng"
        },
        {
            h: "妄",
            v: "Vọng/Võng"
        },
        {
            h: "憮",
            v: "Vô"
        },
        {
            h: "无",
            v: "Vô"
        },
        {
            h: "無",
            v: "Vô/Mô"
        },
        {
            h: "嘸",
            v: "Vô/Mô"
        },
        {
            h: "毋",
            v: "Vô/Mưu"
        },
        {
            h: "于",
            v: "Vu"
        },
        {
            h: "盂",
            v: "Vu"
        },
        {
            h: "迂",
            v: "Vu"
        },
        {
            h: "蕪",
            v: "Vu"
        },
        {
            h: "巫",
            v: "Vu"
        },
        {
            h: "誣",
            v: "Vu"
        },
        {
            h: "羽",
            v: "Vũ"
        },
        {
            h: "舞",
            v: "Vũ"
        },
        {
            h: "宇",
            v: "Vũ"
        },
        {
            h: "廡",
            v: "Vũ"
        },
        {
            h: "武",
            v: "Vũ/Võ"
        },
        {
            h: "雨",
            v: "Vũ/Vú"
        },
        {
            h: "侮",
            v: "Vũ/Vụ"
        },
        {
            h: "務",
            v: "Vụ"
        },
        {
            h: "霧",
            v: "Vụ"
        },
        {
            h: "王",
            v: "Vương"
        },
        {
            h: "畑",
            v: "(Vườn)"
        },
        {
            h: "旺",
            v: "Vượng"
        },
        {
            h: "疣",
            v: "Vưu"
        },
        {
            h: "尤",
            v: "Vưu"
        },
        {
            h: "域",
            v: "Vực"
        },
        {
            h: "暈",
            v: "Vựng"
        },
        {
            h: "彙",
            v: "Vựng/Vị/Hối/Hội"
        },
        {
            h: "車",
            v: "Xa"
        },
        {
            h: "俥",
            v: "Xa"
        },
        {
            h: "奢",
            v: "Xa"
        },
        {
            h: "赦",
            v: "Xá"
        },
        {
            h: "舎",
            v: "Xá"
        },
        {
            h: "岔",
            v: "Xá"
        },
        {
            h: "殻",
            v: "Xác"
        },
        {
            h: "確",
            v: "Xác"
        },
        {
            h: "燦",
            v: "Xán"
        },
        {
            h: "蛇",
            v: "Xà"
        },
        {
            h: "巧",
            v: "Xảo"
        },
        {
            h: "社",
            v: "Xã"
        },
        {
            h: "射",
            v: "Xạ"
        },
        {
            h: "麝",
            v: "Xạ"
        },
        {
            h: "侵",
            v: "Xâm"
        },
        {
            h: "蚩",
            v: "Xi"
        },
        {
            h: "暹",
            v: "Xiêm"
        },
        {
            h: "掣",
            v: "Xiết"
        },
        {
            h: "企",
            v: "Xí"
        },
        {
            h: "厠",
            v: "Xí"
        },
        {
            h: "幟",
            v: "Xí"
        },
        {
            h: "赤",
            v: "Xích"
        },
        {
            h: "尺",
            v: "Xích"
        },
        {
            h: "斥",
            v: "Xích"
        },
        {
            h: "呎",
            v: "Xích"
        },
        {
            h: "歯",
            v: "Xỉ"
        },
        {
            h: "齒",
            v: "Xỉ"
        },
        {
            h: "侈",
            v: "Xỉ"
        },
        {
            h: "扠",
            v: "Xoa"
        },
        {
            h: "叉",
            v: "Xoa"
        },
        {
            h: "樞",
            v: "Xu"
        },
        {
            h: "枢",
            v: "Xu/Khu"
        },
        {
            h: "春",
            v: "Xuân"
        },
        {
            h: "椿",
            v: "Xuân/Thung"
        },
        {
            h: "率",
            v: "Xuất"
        },
        {
            h: "出",
            v: "Xuất"
        },
        {
            h: "蟀",
            v: "Xuất"
        },
        {
            h: "齣",
            v: "Xuất/Xích"
        },
        {
            h: "惷",
            v: "Xuẩn"
        },
        {
            h: "沖",
            v: "Xung"
        },
        {
            h: "衝",
            v: "Xung"
        },
        {
            h: "冲",
            v: "Xung"
        },
        {
            h: "炊",
            v: "Xuy"
        },
        {
            h: "吹",
            v: "Xuy/Xúy"
        },
        {
            h: "川",
            v: "Xuyên"
        },
        {
            h: "巛",
            v: "Xuyên"
        },
        {
            h: "栓",
            v: "Xuyên/Then"
        },
        {
            h: "釧",
            v: "Xuyến"
        },
        {
            h: "啜",
            v: "Xuyết"
        },
        {
            h: "臭",
            v: "Xú"
        },
        {
            h: "醜",
            v: "Xú"
        },
        {
            h: "触",
            v: "Xúc"
        },
        {
            h: "促",
            v: "Xúc"
        },
        {
            h: "蹴",
            v: "Xúc"
        },
        {
            h: "齪",
            v: "Xúc"
        },
        {
            h: "樗",
            v: "Xư"
        },
        {
            h: "称",
            v: "Xưng/Xứng"
        },
        {
            h: "昌",
            v: "Xương"
        },
        {
            h: "唱",
            v: "Xướng"
        },
        {
            h: "倡",
            v: "Xướng"
        },
        {
            h: "娼",
            v: "Xướng"
        },
        {
            h: "厰",
            v: "Xưởng"
        },
        {
            h: "廠",
            v: "Xưởng"
        },
        {
            h: "秤",
            v: "Xứng"
        },
        {
            h: "處",
            v: "Xử"
        },
        {
            h: "処",
            v: "Xử/Xứ"
        },
        {
            h: "衣",
            v: "Y"
        },
        {
            h: "医",
            v: "Y"
        },
        {
            h: "伊",
            v: "Y"
        },
        {
            h: "欹",
            v: "Y"
        },
        {
            h: "俺",
            v: "Yêm"
        },
        {
            h: "煙",
            v: "Yên"
        },
        {
            h: "焉",
            v: "Yên"
        },
        {
            h: "堙",
            v: "Yên"
        },
        {
            h: "嫣",
            v: "Yên"
        },
        {
            h: "腰",
            v: "Yêu"
        },
        {
            h: "妖",
            v: "Yêu"
        },
        {
            h: "幺",
            v: "Yêu"
        },
        {
            h: "夭",
            v: "Yêu/Yểu"
        },
        {
            h: "厭",
            v: "Yếm"
        },
        {
            h: "宴",
            v: "Yến"
        },
        {
            h: "晏",
            v: "Yến"
        },
        {
            h: "嚥",
            v: "Yến"
        },
        {
            h: "燕",
            v: "Yến/Yên"
        },
        {
            h: "靨",
            v: "Yếp"
        },
        {
            h: "謁",
            v: "Yết"
        },
        {
            h: "掲",
            v: "Yết"
        },
        {
            h: "軋",
            v: "Yết/Loát"
        },
        {
            h: "要",
            v: "Yếu"
        },
        {
            h: "掩",
            v: "Yểm"
        },
        {
            h: "黶",
            v: "Yểm"
        },
        {
            h: "魘",
            v: "Yểm"
        },
        {
            h: "奄",
            v: "Yểm"
        },
        {
            h: "偃",
            v: "Yển"
        },
        {
            h: "堰",
            v: "Yển"
        },
        {
            h: "杳",
            v: "Yểu"
        },
        {
            h: "殀",
            v: "Yểu"
        },
        {
            h: "意",
            v: "Ý"
        },
        {
            h: "懿",
            v: "Ý"
        },
        {
            h: "噫",
            v: "Ý"
        },
        {
            h: "倚",
            v: "Ỷ"
        },
        {
            h: "依",
            v: "Ỷ/Y"
        }
    ];
    var i = 0;
    var res = "";
    for (i = 0; i < hvMAP.length; i++) {
        if (w === hvMAP[i].h) {
            res = hvMAP[i].v;
            return res;
        }
    }
    return res;
}

export {HVConverter};
